[{"title": "Joe Biden: The President | The White House", "body": "Joseph Robinette Biden, Jr. was born in Scranton, Pennsylvania, the first of four children of Catherine Eugenia Finnegan Biden and Joseph Robinette Biden, Sr.Nationality: the United States", "view": 10}, {"title": "Joe Biden - Wikipedia", "body": "Joseph Robinette Biden Jr. (/ˈbaɪdən/ BY-dən; born November 20, 1942) is an American politician who is the 46th and current president of the United States.United States Senator from Delaware: United ...Other political affiliations: Independent (before ...‎Political party: Democratic (1969–present)‎In office January 3, 1973 – January 15, 2009: In ...‎Timeline of the Joe Biden... · ‎Joe Biden 1988 presidential... · ‎Beau Biden · ‎Family", "view": 10}, {"title": "A Presidency for All Americans - Joe Biden for President ...", "body": "But once again, America has bent the arc of the moral universe towards justice. Kamala, Doug — like it or not — you're family. You've become honorary Bidens and ...", "view": 10}, {"title": "Build America back better - Joe Biden for President", "body": "Joe Biden's Jobs and Economic Recovery Plan for Working Families. Read More. What else? Explore all of Joe Biden's plans. All ...", "view": 10}, {"title": "Joe Biden - Home | Facebook", "body": "Joe Biden. 9417668 likes · 273851 talking about this. Husband to Dr. Biden, proud father and grandfather. Ready to build back better for all Americans.", "view": 10}, {"title": "President Joe Biden - Home | Facebook", "body": "President Joe Biden. 9784458 likes · 676179 talking about this. 46th President of the United States, husband to @FLOTUS, proud father and grandfather....", "view": 10}, {"title": "Joe Biden (@joebiden) • Instagram photos and videos", "body": "17.7m Followers, 107 Following, 1373 Posts - See Instagram photos and videos from Joe Biden (@joebiden)", "view": 10}, {"title": "President Joe Biden (@potus) • Instagram photos and videos", "body": "17.8m Followers, 5 Following, 638 Posts - See Instagram photos and videos from President Joe Biden (@potus)", "view": 10}, {"title": "Joe Biden news: Latest on the 46th US President - CNN", "body": "President Joe Biden's proposals for criminal justice reform include changing sentencing guidelines and making police department funding conditional on ...", "view": 10}, {"title": "Joe Biden | TheHill", "body": "Vice President of the United States, under President Barack Obama, 2009 - 2017United States Senate, Senator, 1973 - 2009New Castle County, Delaware, ...", "view": 10}, {"title": "Christie: 2020 Joe Biden 'is now officially dead and buried'", "body": "2 days ago — When he went to the Hill, 2020 Joe Biden is now officially dead and buried,” Christie said on ABC's “This Week.” “The guy who ran against the ...", "view": 10}, {"title": "Joe Biden - CNBC", "body": "Joe Biden. 46th president of the United States. Latest. Treasury yields mixed with jobs reports in focus · Vicky McKeever24 Min Ago.", "view": 10}, {"title": "Watch live: Biden speaks on the debt ceiling as U.S. default ...", "body": "23 hours ago — President Joe Biden will offer remarks on the urgency of raising or suspending the debt ceiling before the U.S. defaults for the first time.", "view": 10}, {"title": "Biden pushes Congress to raise debt limit this week, slams GOP", "body": "22 hours ago — President Joe Biden on Monday blamed Republicans for blocking efforts to raise or suspend the U.S. borrowing limit and avert a first-ever ...", "view": 10}, {"title": "Joe Biden - AP News", "body": "News from The Associated Press, the definitive source for independent journalism from every corner of the globe.", "view": 10}, {"title": "President Joe Biden - The New York Times", "body": "Biden is the 46th president of the United States and was sworn in on January 20, 2021.Party: Democratic Party", "view": 10}, {"title": "Opinion | Can Joe Biden Recover? - The New York Times", "body": "Mehr 3, 1400 AP — ... memo that the conservative legal scholar John Eastman wrote explaining how Mike Pence could supposedly invalidate Joe Biden's election.", "view": 10}, {"title": "Joe Biden | Fox News", "body": "Joe Biden is a Democrat who serves as the 46th president of the United States. Elected in 2020, Biden previously served as vice president of the United ...", "view": 10}, {"title": "Joe Biden - Ballotpedia", "body": "Presidency. See also: Presidential candidates, 2020. Former Vice President Joe Biden (D) won the presidential election on November ...State: DelawareStatus: Superdelegate", "view": 10}, {"title": "Joe Biden news from the White House - The Independent", "body": "The latest news from Joe Biden, president of the United States.", "view": 10}, {"title": "The White House", "body": "Learn how the Biden-Harris Administration is tackling our nation's challenges ... Readout of Joseph R. Biden, Jr.'s Call with European Commission President ...", "view": 10}, {"title": "Statements and Releases Archives | The White House", "body": "Readout of President Biden's Meeting with Progressive Members of Congress ... Readout of Joseph R. Biden, Jr.'s Call with European Commission President ...", "view": 10}, {"title": "President Biden News & Videos - ABC News", "body": "President Joe Biden on Monday called out Republicans for failing to join Democrats to raise the debt ceiling, saying they were being \"hypocritical\" and \" ...", "view": 10}, {"title": "Joe Biden | US news | The Guardian", "body": "7 hours ago — Joe Biden · US politics live Biden says debt limit must be raised because of 'reckless' policies under Trump – as it happened. Published: 5:28 PM.", "view": 10}, {"title": "Biden warns 'meteor headed to crash' into US economy amid ...", "body": "21 hours ago — Joe Biden has condemned “reckless” Republicans for pushing the US government towards a historic debt default, warning: “A meteor is headed ...", "view": 10}, {"title": "Joe Biden: news, videos, reports and analysis - France 24", "body": "Find all the latest articles and watch TV shows, reports and podcasts related to Joe Biden on France 24.", "view": 10}, {"title": "Joe Biden - YouTube", "body": "President-elect Joe Biden & Vice President-elect Kamala Harris | America The Beautiful. •. 692,438 views 10 months ago. America, I'm honored that you have ...", "view": 10}, {"title": "Joe Biden - YouTube", "body": "President-elect Joe Biden & Vice President-elect Kamala Harris | America The Beautiful. •. 692,471 views 10 months ago. America, I'm honored that you have ...", "view": 10}, {"title": "Joe Biden news & latest pictures from Newsweek.com", "body": "Updates on Joe Biden, the 46th president of the United States. Elected president in 20210, he previously served as the 47th vice president under President ...", "view": 10}, {"title": "Joe Biden: Latest News, Top Stories & Analysis - POLITICO", "body": "Congressional Democrats don't want to talk about the discord around the total cost of President Joe Biden's social spending plan, even as that elusive figure ...", "view": 10}, {"title": "McConnell reactivates his connection to Biden - Politico", "body": "22 hours ago — Joe Biden and Mitch McConnell's two-man emergency hotline had gone silent — until now. The Senate minority leader on Monday morning prodded ...", "view": 10}, {"title": "A group of frontline House Democrats will meet with Joe Biden ...", "body": "1 hour ago — We have the list. They're figuring out the next steps on Biden's agenda. Here's the list ...", "view": 10}, {"title": "Joe Biden - The Economic Times", "body": "US President Joe Biden rolled up his shirt sleeve for a COVID-19 vaccine booster inoculation on Monday, hoping to provide a powerful example for Americans ...", "view": 10}, {"title": "President-elect Joe Biden - CBS News", "body": "CBS News coverage of President-elect Joe Biden. ... nominee Kamala Harris introduces Democratic 2020 U.S. presidential nominee Joe Biden at ...", "view": 10}, {"title": "Joe Biden - The Latest News from the UK and Around the World", "body": "Joe Biden signs bill to narrowly avert US government shutdown ... U.S. President Joe Biden hosts a virtual coronavirus disease (COVID-19) Summit as ...", "view": 10}, {"title": "How Popular Is Joe Biden? | FiveThirtyEight", "body": "Latest polls on President Joe Biden's approval ratings.", "view": 10}, {"title": "Biden says he can't guarantee debt ceiling lift due to 'hypocritical", "body": "46 minutes ago — President Joe Biden on Monday said he couldn't guarantee the debt ceiling would be raised in two weeks as he slammed Republicans for ...", "view": 10}, {"title": "Biden announces new vaccine mandates that could cover 100 ...", "body": "Shahrivar 18, 1400 AP — President Joe Biden on Thursday imposed stringent new vaccine rules on federal workers, large employers and health care staff in a sweeping ...", "view": 10}, {"title": "President Biden's COVID-19 Plan | The White House", "body": "Path out of the Pandemic. PRESIDENT BIDEN'S COVID-19 ACTION PLAN. President Biden is implementing a six-pronged, comprehensive national strategy that ...", "view": 10}, {"title": "The Biden Plan to Build a Modern, Sustainable Infrastructure ...", "body": "Joe Biden's Build Back Better plan ensures that – coming out of this profound public health and economic crisis, and facing the persistent climate crisis ...", "view": 10}, {"title": "Joe And Kamala's Plan To Beat COVID-19 - Joe Biden for ...", "body": "Whatever the state of the COVID pandemic on the day Joe Biden and Kamala Harris take office, their administration will: Listen to science; Ensure public health ...", "view": 10}, {"title": "Foreign Policy and American Leadership Plan - Joe Biden for ...", "body": "Through Joe Biden's foreign policy plan, America will once again lead by example, restoring dignity at home and respect on the world stage.Tir 20, 1398 AP · Uploaded by Joe Biden", "view": 10}, {"title": "Joe Biden - PolitiFact", "body": "Joe Biden is the president of the United States. A Democrat, Biden served as a Delaware senator from 1973 (elected at the age of 29) until 2009.", "view": 10}, {"title": "Joe Biden - WSJ Spotlight Coverage, Recent News", "body": "Joe Biden, the 46th president of the United States with Kamala Harris as his vice-president, was the 47th vice president of the U.S. from 2009 to 2017 under ...", "view": 10}, {"title": "Joe Biden - Business Standard", "body": "Joe Biden is an American politician and also the 46th and current president of the United States. A member of the Democratic Party, he served as the 47th ...Party: Democratic PartyBorn: November 20, 1942, Scranton", "view": 10}, {"title": "Sweeping new vaccine mandates for 100 million Americans", "body": "Shahrivar 18, 1400 AP — WASHINGTON (AP) — In his most forceful pandemic actions and words, President Joe Biden on Thursday ordered sweeping new federal vaccine ...", "view": 10}, {"title": "Latest News, Videos and Joe Biden Photos | Times of India", "body": "Joseph Robinette Biden Jr., popularly known as Joe Biden, is an American politician and the 46th and current president of the United States.", "view": 10}, {"title": "Summary data for Joe Biden, 2020 cycle • OpenSecrets", "body": "OrganizationPro/AgainstTypeTotal RaisedBiden for PresidentPro‑BidenCampaign$1,044,187,828Future Forward USAPro‑BidenCarey$151,401,586Priorities USA ActionPro‑BIDENCarey$139,463,406View 44 more rows", "view": 10}, {"title": "The Biden Plan for Securing Our Values as a Nation of ...", "body": "Trump has waged an unrelenting assault on our values and our history as a nation of immigrants. It's wrong, and it stops when Joe Biden is elected president.", "view": 10}, {"title": "Plan for Educators, Students, and our Future - Joe Biden for ...", "body": "Joe Biden will provide educators with the support and respect they deserve, and invest in all children from birth — giving them equal opportunity to succeed ...", "view": 10}, {"title": "The Latest - Joe Biden for President: Official Campaign Website", "body": "Joe Biden sitting in a church with a mask on, taking notes and listening to. Joe and Kamala's Plan to Beat COVID-19. Read More. The Latest ...", "view": 10}, {"title": "Joe Biden | Category | Fox Business", "body": "Joe Biden, a 2020 Democratic presidential candidate, is the former vice president of the United States under Barack Obama and a former senator from ...", "view": 10}, {"title": "Joe Biden News & Updates - Vox", "body": "What to know about Joe Biden's administration, policy platform, and more. ... Vox's home for coverage of President Joe Biden, the 46th president of the ...", "view": 10}, {"title": "Joe Biden | News, Videos & Articles", "body": "Joe Biden videos and latest news articles; GlobalNews.ca your source for the latest news on Joe Biden .", "view": 10}, {"title": "Joe Biden | Financial Times", "body": "Let's not go back to what wasn't working anyway. Lead the way with 50% off. Joe Biden. Add to myFT ...", "view": 10}, {"title": "Joe Biden's China trade policy lacks ambition | Financial Times", "body": "4 hours ago — Joe Biden's China trade policy lacks ambition. US retreat from shaping global system could hand Beijing a victory. The editorial board.", "view": 10}, {"title": "Joe Biden Jr. | C-SPAN.org", "body": "Joe Biden Jr. has 2,134 videos in the C-SPAN Video Library; the first appearance was a 1983 Forum as a Democratic Senator for Delaware.", "view": 10}, {"title": "The Biden Plan to Combat Coronavirus (COVID-19) and ...", "body": "THE BIDEN PLAN TO COMBAT CORONAVIRUS (COVID-19) AND PREPARE FOR FUTURE GLOBAL HEALTH THREATS. For more information on Joe's leadership during the ...", "view": 10}, {"title": "Joe Biden 2020: Polls, news and on the issues - CNN", "body": "Bahman 2, 1399 AP — Joe Biden is the Former vice president of the United States and is a candidate in the 2020 US presidential election. Find out more about his ...", "view": 10}, {"title": "Biden tells GOP to 'get out of the way' on debt limit - AP News", "body": "19 hours ago — WASHINGTON (AP) — President Joe Biden on Monday urged Republican senators to “get out of the way” and let Democrats suspend the nation's ...", "view": 10}, {"title": "Biden doubles US global donation of COVID-19 vaccine shots", "body": "Shahrivar 31, 1400 AP — President Joe Biden announced Wednesday that the United States is doubling its purchase of Pfizer's COVID-19 shots to share with the world ...", "view": 10}, {"title": "Statement by President Joe Biden on Dr. Francis Collins ...", "body": "27 minutes ago — Statement by President Joe Biden on Dr. Francis Collins Stepping Down as Director of the National Institutes of Health.", "view": 10}, {"title": "Joe Biden | US News", "body": "Joe Biden · Companies Succeed Where Others Fail on Vaccines · The Week in Cartoons for Oct. 4-8 · Biden: GOP 'Disgraceful' on Debt Ceiling · House Passes Funding ...", "view": 10}, {"title": "Joe Biden - BBC News", "body": "All the latest news about Joe Biden from the BBC. ... But a vote on President Biden's massive $1tn (£750bn) infrastructure bill was postponed.", "view": 10}, {"title": "Biden and the Democrats Need to Make Hard Spending ...", "body": "19 hours ago — Joe Biden gestures as he speaks to a large crowd of reporters. Even a smaller reconciliation bill can include transformative investments. But ...", "view": 10}, {"title": "The Biden Plan for Strengthening Worker Organizing, Collective", "body": "Strong unions built the American middle class. That's why Joe Biden has an extensive plan for strengthening organized labor and collective bargaining.", "view": 10}, {"title": "Joe Biden's Plan to Beat COVID-19", "body": "Over the last four months, Joe Biden has laid out comprehensive plans with five basic elements that he would do as President to address COVID-19: (1) ...", "view": 10}, {"title": "President Joe Biden reschedules trip to Chicago after ...", "body": "21 hours ago — President Biden has rescheduled a visit to Chicago for this week after calling off his trip last week.", "view": 10}, {"title": "Biden eager to get out of DC, push benefits of spending plan", "body": "10 hours ago — WASHINGTON (AP) — President Joe Biden is shifting strategy to sell his ambitious social spending plans by traveling outside Washington and ...", "view": 10}, {"title": "President Joe Biden scheduled to visit Howell on Tuesday ...", "body": "2 days ago — President Joe Biden speaks with members of the press before boarding Marine One on the South Lawn of the White House, Saturday, Oct. 2, 2021, in ...", "view": 10}, {"title": "Statement by President Joe Biden on 700,000 American ...", "body": "3 days ago — Statement by President Joe Biden on 700,000 American Deaths from COVID-⁠19 ... To heal we must remember, and as our nation mourns the painful ...", "view": 10}, {"title": "Remarks by President Biden on Fighting the COVID-19 ...", "body": "Shahrivar 18, 1400 AP — 5:02 P.M. EDTTHE PRESIDENT: Good evening, my fellow Americans. I want to talk to you about where we are in the battle against COVID-19, the.", "view": 10}, {"title": "Can Democrats hold together? Biden's agenda depends on it", "body": "1 day ago — But as Democrats try to usher President Joe Biden's expansive federal government overhaul into law, it's the party's diversity of ...", "view": 10}, {"title": "The utter radicalness of Joe Biden's presidency - CNN", "body": "4 days ago — Joe Biden has been president of the United States for a little over eight months now. And he may well be on the verge of radically ...", "view": 10}, {"title": "All news about Joe Biden | Euronews", "body": "Information about Joe Biden. Select the subjects you want to know more about on euronews.com.", "view": 10}, {"title": "Here's what we know about President Biden's visit to Howell ...", "body": "18 hours ago — President Joe Biden will stop in Howell on Tuesday to promote his infrastructure plan and economic agenda, White House officials announced ...", "view": 10}, {"title": "Joe Biden's Stutter, and Mine - The Atlantic", "body": "Bahman 26, 1398 AP — What Joe Biden Can't Bring Himself to Say. His verbal stumbles have voters worried about his mental fitness. Maybe they'd be more understanding ...", "view": 10}, {"title": "Protesters chant 'f*** Joe Biden and de Blasio' as thousands of ...", "body": "19 hours ago — Protesters chanted, \"F*** Joe Biden and de Blasio,\" outside the New York City Department of Education office Monday, according to a video ...", "view": 10}, {"title": "Get Involved With Joe Biden's Campaign", "body": "Volunteer. Joe Biden can't win without you on this team. Sign up to volunteer today. All activities are in accordance with CDC and social distancing ...", "view": 10}, {"title": "The Biden Agenda for Women", "body": "Joe Biden is going to build our country back better after this economic crisis and that includes ensuring we get closer to full inclusion of and equality ...", "view": 10}, {"title": "Joe Biden's Tax Returns and Financial Disclosures", "body": "Joe Biden is running for president, and he has released his financial disclosures and the last three years of his tax returns.", "view": 10}, {"title": "Here's The Deal - Joe Biden for President: Official Campaign ...", "body": "Michigan Governor Gretchen Whitmer joins former Vice President Joe Biden for a discussion on what her administration is doing to combat COVID-19, how she's ...", "view": 10}, {"title": "How Biden gave feuding House Democrats an off-ramp - CNN", "body": "3 days ago — President Joe Biden didn't travel to Capitol Hill on Friday to close the deal, or to rally the troops through a final legislative gantlet.", "view": 10}, {"title": "Bitterness festers as Democrats try again to pass Biden's ...", "body": "1 day ago — And it only deepened the critical question of Joe Biden's term: Can the President and his allies leverage a fragile hold on power to launch ...", "view": 10}, {"title": "Joe Biden - FOX 13 Tampa Bay", "body": "As Democrats work to resolve the rift stalling President Joe Biden's agenda, the president told reporters on Saturday, “Everybody is frustrated.", "view": 10}, {"title": "Joe Biden presidency: Five huge challenges looming - BBC", "body": "Shahrivar 29, 1400 AP — Joe Biden started his presidency full of plans - for Covid-19 relief, infrastructure investment and expanding government safety nets.", "view": 10}, {"title": "President Joe Biden visiting Michigan to pitch $1 trillion ...", "body": "2 days ago — This is Biden's first visit to Michigan since a July trip up north. ... HOWELL, MI - President Joe Biden will visit Michigan for the first ...", "view": 10}, {"title": "As the Joe Biden slide deepens, will it fall to the first lady to say", "body": "3 days ago — If Joe Biden's recent slide in the polls continues, is there a way for the Democrats to dump the president as their party's nominee in 2024, ...", "view": 10}, {"title": "Biden says Republican stonewalling on debt ceiling risks U.S. ...", "body": "10 hours ago — President Joe Biden said on Monday the federal government could breach its $28.4 trillion debt limit in a historic default unless ...", "view": 10}, {"title": "Manchin breaks with party leaders over strategy on debt ceiling", "body": "12 hours ago — Joe Manchin on Monday pushed back on several politically sensitive ... are taking at a crucial time for President Joe Biden's domestic agenda.", "view": 10}, {"title": "Join Rural Americans for Biden", "body": "Joe Biden believes that the story of America is one of ordinary people doing extraordinary things. As president, he will build a pathway to the middle class ...", "view": 10}, {"title": "Joe Biden's dire warning: a 'meteor' is headed to tank the US ...", "body": "21 hours ago — Washington: President Joe Biden has warned that a “meteor” will crash into the US economy if Republicans continue to block efforts to raise ...", "view": 10}, {"title": "Statement by President Joe Biden on Cybersecurity ...", "body": "4 days ago — Statement by President Joe Biden on Cybersecurity Awareness Month ... Cyber threats can affect every American, every business regardless of size, ...", "view": 10}, {"title": "The Biden-Harris Administration | The White House", "body": "President Joe Biden · Vice President Kamala Harris · First Lady Dr. Jill Biden · Second Gentleman Douglas Emhoff · The Cabinet · Executive Office of the President.", "view": 10}, {"title": "Executive Order on Requiring Coronavirus Disease 2019 ...", "body": "Shahrivar 18, 1400 AP — JOSEPH R. BIDEN JR. THE WHITE HOUSE, September 9, 2021. Next Post: Letter to the Speaker of the House of Representatives and the President ...", "view": 10}, {"title": "Joe Biden is proving he's pretty inept at politics - New York Post", "body": "19 hours ago — Whatever is left of the Joe Biden competence myth just crumbled away Monday, when the president gave a desperate speech to try to make ...", "view": 10}, {"title": "Joe Biden (@JoeBiden) | Twitter", "body": "The latest Tweets from Joe Biden (@JoeBiden). Husband to @DrBiden, proud father and grandfather. Ready to build back better for all Americans.", "view": 10}, {"title": "Joe Biden (@JoeBiden) | Twitter", "body": "Les tout derniers Tweets de Joe Biden (@JoeBiden). Husband to @DrBiden, proud father and grandfather. Ready to build back better for all Americans.", "view": 10}, {"title": "'SNL' returns with a new Joe Biden, looking to unite Democrats", "body": "2 days ago — 'SNL' returned for its 2021-2022 season premiere Saturday and opened with new cast member James Austin Johnson taking on the role of Biden.", "view": 10}, {"title": "Joe Biden News", "body": "Zee News brings latest news from India and World on breaking news, today news headlines, politics, business, technology, bollywood, entertainment, ...", "view": 10}, {"title": "Remarks to the Press with Q&A by Vice President Joe Biden in ...", "body": "Khordad 30, 1393 AP — Remarks to the Press with Q&A by Vice President Joe Biden in Guatemala. Residence of the United States Ambassador Guatemala City, Guatemala.", "view": 10}, {"title": "Vice President Joe Biden | The White House - Obama White ...", "body": "Joseph Robinette Biden, Jr., was born November 20, 1942, in Scranton, Pennsylvania, the first of four siblings. In 1953, the Biden family moved from ...", "view": 10}, {"title": "Vice President Joe Biden | The White House - Obama White ...", "body": "Joseph Robinette Biden, Jr., represented Delaware for 36 years in the U.S. Senate before becoming the 47th and current Vice President of the United States.", "view": 10}, {"title": "Plan for Climate Change and Environmental Justice - Joe ...", "body": "Joe Biden knows climate change is the greatest threat facing our country and our world, and he has a bold plan for a clean energy revolution.Dey 25, 1397 AP · Uploaded by Joe Biden", "view": 10}, {"title": "The Biden Plan for an Effective Re-Opening that Jumpstarts", "body": "Ensure workers and unions have a voice in reopening plans, and that reopening decisions by tribal governments are respected. (Read Joe Biden's plans for ...", "view": 10}, {"title": "The Latest Joe Biden News - ITV", "body": "Joe Biden has surveyed the storm damage wreaked by Hurricane Ida, which has re-focused attention on the president's climate change policies.", "view": 10}, {"title": "'SNL' kicks off new season with new cast member as Joe Biden", "body": "2 days ago — \"Saturday Night Live\" kicked off its 47th season by targeting President Joe Biden, Democrats in Congress and anti-vaccination activists.", "view": 10}, {"title": "Congress, Political Parties, National Security & More - NBC ...", "body": "Biden accuses Republicans of 'Russian roulette' on debt limit ... Illustration of President Joe Biden with approval rating line graphs of previous ...", "view": 10}, {"title": "Biden says debt limit must be raised because of 'reckless ...", "body": "17 hours ago — An updated summary of today's political news: Joe Biden lambasted Republicans on the debt limit, calling them “hypocritical” and “disgraceful” ...", "view": 10}, {"title": "Remarks by President Biden Before the 76th Session of the ...", "body": "Shahrivar 30, 1400 AP — United Nations HeadquartersNew York, New York 10:01 A.M. EDT THE PRESIDENT: Mr. President, Mr. Secretary-General, my fellow delegates, ...", "view": 10}, {"title": "Contact Us | The White House", "body": "President Joe Biden · Vice President Kamala Harris · First Lady Dr. Jill Biden · Second Gentleman Douglas Emhoff · The Cabinet · Executive Offices", "view": 10}, {"title": "Statement by President Joe Biden on Afghanistan - The White ...", "body": "Statement by President Joe Biden on Afghanistan. August 14, 2021 • Statements and Releases. Over the past several days, I have been in close contact with my ...", "view": 10}, {"title": "Statement by President Joe Biden on the Evacuation Mission in", "body": "Shahrivar 6, 1400 AP — This morning, I met with my national security team in Washington and my commanders in the field. We discussed the strike that U.S. forces ...", "view": 10}, {"title": "Biden admits Afghanistan's collapse 'did unfold more quickly ...", "body": "Mordad 25, 1400 AP — President Joe Biden admitted on Monday that the collapse of the Afghan government and the Taliban retaking control happened more quickly ...", "view": 10}, {"title": "Joe Biden – News, Research and Analysis - The Conversation", "body": "Joe Biden's pledge of support reassures Syria's embattled Kurds · Cengiz Gunes, The Open University. Joe Biden has been quick to calm Kurdish fears that the ...", "view": 10}, {"title": "Joe Biden - 9News - Latest news and headlines from Australia ...", "body": "Activists in the US left a grim message outside the home of US President Joe Biden's chief-of-staff to protest the government's response to global ...", "view": 10}, {"title": "Joe Biden - Age, Politics & Family - Biography", "body": "Joe Biden is the president of the United States. He also served as Barack Obama's vice president from 2008-2016.Date of birth: November 20, 1942Party: Democratic Party", "view": 10}, {"title": "Biden-Harris Plan for Tribal Nations", "body": "Joe Biden and Kamala Harris are committed to upholding the U.S.'s trust ... Not only did the Obama-Biden Administration appoint Native Americans to ...", "view": 10}, {"title": "SNL's new 'Joe Biden' was born and raised in Nashville", "body": "22 hours ago — Nashville native James Austin Johnson made a massive debut on 'Saturday Night Live,' opening the show as President Joe Biden.", "view": 10}, {"title": "Joe Biden - News, Tips & Guides | Glamour", "body": "Find the latest about Joe Biden news, plus helpful articles, tips and tricks, and guides at Glamour.com.", "view": 10}, {"title": "Joe Biden | The Times & The Sunday Times", "body": "Results 1 - 20 of 888 — Joe Biden is president of the United States. He was inaugurated as the 46th president in January 2021, after his victory over Donald ...", "view": 10}, {"title": "Joe Biden - Videos | Facebook", "body": "Joe Biden. 9417658 likes · 237183 talking about this. Husband to Dr. Biden, proud father and grandfather. Ready to build back better for all Americans.", "view": 10}, {"title": "Joe Biden - Photos | Facebook", "body": "See photos, profile pictures and albums from Joe Biden.", "view": 10}, {"title": "Joe Biden - South China Morning Post", "body": "Democratic politician Joe Biden became the 46th President of the United States of America on January 20, 2021. He won more than 270 Electoral College votes ...", "view": 10}, {"title": "Joe Biden | Today's latest from Al Jazeera", "body": "Stay on top of Joe Biden latest developments on the ground with Al Jazeera's fact-based news, exclusive video footage, photos and updated maps.", "view": 10}, {"title": "Joe Biden faces defining moment in US presidency - Al Jazeera", "body": "7 days ago — With Biden's job approval sliding, the US president needs a win in Congress where Democrats are divided on his agenda. President Joe Biden told ...", "view": 10}, {"title": "Joe Biden: The Life, the Run, and What Matters Now Hardcover", "body": "A concise, brilliant, and trenchant examination of Joseph R. Biden Jr.'s successful lifelong quest for the presidency by National Book Award winner Evan Osnos.", "view": 10}, {"title": "Highlights From Joe Biden's Vision for America", "body": "Vice President Joe Biden believes that in America, no matter where you start in life, everyone should be able to live up to their God-given potential.", "view": 10}, {"title": "Accessibility - Joe Biden for President: Official Campaign ...", "body": "Joe Biden Website Accessibility Statement. Joe Biden is committed to providing a web experience that meets the needs of as many JoeBiden.com visitors as ...", "view": 10}, {"title": "The Biden Emergency Action Plan to Save the Economy", "body": "Congress is close to passing a massive relief bill. · If Joe Biden were President right now, here are the three things he would do now to save our economy and ...", "view": 10}, {"title": "President Joe Biden coming to Howell on Tuesday to talk ...", "body": "1 day ago — President Joe Biden gives a thumbs up as he walks with House Speaker Nancy Pelosi of Calif., on Capitol Hill in Washington, Friday, Oct. 1, ...", "view": 10}, {"title": "President Joe Biden plans stop in Republican-dominated ...", "body": "16 hours ago — President Joe Biden is coming to visit an intensely divided community. Only 38% of voters in Livingston County cast a ballot for President Joe ...", "view": 10}, {"title": "Joe Biden - FOX 5 Atlanta", "body": "News about former Vice President and current presidential candidate Joe Biden.", "view": 10}, {"title": "Natural gas prices rise 23% to hit record highs in Europe", "body": "21 minutes ago — Prominent Chinese state media attacked Joe Biden for failing to change course from Donald Trump's “America First” policy as tensions between ...", "view": 10}, {"title": "It is far too soon for people to write off Joe Biden - Financial ...", "body": "Shahrivar 18, 1400 AP — A few weeks ago, Joe Biden's presidency was widely hailed as a triumph. Coronavirus was in retreat. The US economy was roaring back. And ...", "view": 10}, {"title": "Joe Biden at UD, Through the Years - University of Delaware", "body": "A Conversation with Vice President Joe Biden and Presidential Historian Jon Meacham · Biden_Institute-UDISCUSS-042518 · Biden_School_Naming_Announcement-KA-121118 ...", "view": 10}, {"title": "Joe Biden: Age, Presidency, Family - HISTORY", "body": "Bahman 1, 1399 AP — Joe Biden is the 46th president of the United States. He also served as Barack Obama's vice president from 2009-2017, and as a United States ...", "view": 10}, {"title": "Joe Biden and the Jewish Community: A Record and a Plan of ...", "body": "Vice President Joe Biden has consistently made solidarity with Israel, combatting anti-Semitism, and fighting for social justice pillars of his decades-long ...", "view": 10}, {"title": "Latest & Breaking News on Joe Biden - Moneycontrol", "body": "Joseph Robinette Biden Jr. is the Democratic Party's presidential nominee. He had previously served as the 47th Vice President of the United States. More.", "view": 10}, {"title": "Joe Biden - The New Yorker", "body": "Joe Biden. Reporting and commentary on the forty-sixth President. Latest. Our Columnists · Biden and the Democrats Need to Make Hard Spending Choices.", "view": 10}, {"title": "It's Too Early to Consign Joe Biden to the Ash Heap of History", "body": "Mehr 1, 1400 AP — Photograph of Joe Biden speaking with silhouettes and shadows of cameras and people on both sides. The Biden Presidency, on both the foreign and ...", "view": 10}, {"title": "Joe Biden popularity & fame | YouGov", "body": "Joe Biden is the 4th most popular Democrat and the 4th most popular politician. Explore the latest YouGov polling, survey results and articles about Joe ...", "view": 10}, {"title": "Stephen Colbert Projects Joe Biden Is Still President", "body": "5 days ago — Stephen Colbert was happy on Monday night to project that Joseph R. Biden Jr. is still president 11 months after the election, following a ...", "view": 10}, {"title": "Opinion | Joe Biden Says Age Is Just a Number - The New ...", "body": "Dey 27, 1398 AP — Joe Biden. Former vice president of the United States. The editorial board is a group of opinion journalists whose views are informed by ...", "view": 10}, {"title": "The Biden presidency | The Economist", "body": "Welcome to The Economist's coverage of Joe Biden's presidency. On this page you can find our reporting on his domestic and foreign policies, ...", "view": 10}, {"title": "Joe Biden could be tempted to reach for the platinum coin - CNN", "body": "6 days ago — Enabled by a quirk in the law, Biden could use an unusual workaround to head off a debt ceiling standoff with Republicans that could send ...", "view": 10}, {"title": "Joe Biden - IMDb", "body": "Joe Biden, Actor: Parks and Recreation. Joe Biden was born on November 20, 1942 in Scranton, Pennsylvania, USA as Joseph Robinette Biden Jr. He is an actor, ...Born: November 20, 1942, Scranton", "view": 10}, {"title": "Kamala's Story - Joe Biden for President: Official Campaign ...", "body": "The first Black and Indian American woman to represent California in the United States Senate, Kamala Harris grew up believing in the promise of America and ...Education: Howard University", "view": 10}, {"title": "The Biden Plan for Mobilizing American Talent and Heart to ...", "body": "Joe Biden has taken care of aging parents, and he's been a single parent. Biden knows how hard it is to raise a family and to care for a sick family member.", "view": 10}, {"title": "The Biden Plan to Build Security and Prosperity in Partnership ...", "body": "But if the political will exists, there is no reason Central America cannot become the next great success story of the Western Hemisphere.” —Vice President Joe ...", "view": 10}, {"title": "Top Vatican Cardinal: Joe Biden should not be denied ...", "body": "18 hours ago — When asked specifically if he thought Communion should be denied to President Joe Biden, Cardinal Turkson said, “No.”.", "view": 10}, {"title": "President Joe Biden plans Michigan visit to tout infrastructure", "body": "2 days ago — President Joe Biden will visit Michigan trying to build public support his stalled infrastructure agenda. Biden will tout his Build Back ...", "view": 10}, {"title": "Joe Biden - News18", "body": "Quick Facts. Born: 20 November 1942; Career: Politician. Joseph Robinette Biden Jr. is an American politician serving as the 46th and current president of ...", "view": 10}, {"title": "One stunning afternoon: Setbacks imperil Biden's reset", "body": "Shahrivar 27, 1400 AP — WASHINGTON (AP) — It was an hour President Joe Biden would no doubt like to forget. On Friday, the Pentagon acknowledged that a drone strike ...", "view": 10}, {"title": "Biden promises 'relentless diplomacy' to skeptical allies", "body": "Shahrivar 30, 1400 AP — UNITED NATIONS (AP) — President Joe Biden summoned the world's nations to forcefully address the festering global issues of the COVID-19 ...", "view": 10}, {"title": "Biden defeats Trump for White House, says 'time to heal'", "body": "Aban 17, 1399 AP — WASHINGTON (AP) — Democrat Joe Biden defeated President Donald Trump to become the 46th president of the United States on Saturday and ...Party: Democratic PartyPlace of birth: Scranton", "view": 10}, {"title": "Biden tells GOP to 'get out of the way' on debt limit - AP News", "body": "5 hours ago — WASHINGTON (AP) — President Joe Biden urged Republican senators to “get out of the way” and let Democrats suspend the nation's debt limit ...", "view": 10}, {"title": "UK Brexit minister Lord Frost warns Joe ... - The Independent", "body": "21 hours ago — The UK's Brexit minister has warned Joe Biden to stay out Northern Ireland Brexit talks, branding the president no more than an \"interested ...", "view": 10}, {"title": "Updates To The Biden Plan To Grow A Stronger, More ...", "body": "Joe Biden is running for president to rebuild the middle class so that this time everyone comes along — no matter their race, gender, sexual orientation, ...", "view": 10}, {"title": "Joe Biden | Latest news, analysis, and comment from the i paper", "body": "The latest updates on Joe Biden from the i paper - from news and comment to in-depth analysis on inews.co.uk.", "view": 10}, {"title": "World witnessing 'the death of 2020 Joe Biden' - Sky News ...", "body": "A lot of Americans are going to be looking for change as President Joe Biden is \"unreliable\", according to ...2 days ago", "view": 10}, {"title": "How Joe Biden Became Irish - POLITICO", "body": "Shahrivar 23, 1400 AP — The president has skillfully played up his Irish roots, but the story of his ancestry is more complicated. President Joe Biden sits next to a ...", "view": 10}, {"title": "Joe Biden, welcome to the thunderdome - POLITICO", "body": "Mehr 4, 1400 AP — President Joe Biden stops to speak to members of the media as he arrives at the White House. | AP Photo/Andrew Harnik.", "view": 10}, {"title": "Joe Biden - latest news, breaking stories and comment", "body": "PM 'not counting chickens' over hopes Joe Biden will help in climate cash drive. A target of giving 100 billion dollars (£73 billion) a year to support ...", "view": 10}, {"title": "President Joe Biden calls out Republicans for opposing debt ...", "body": "1:01Ylan Mui joins the Halftime Report from Washington with news from President Biden's press conference. For ...22 hours ago · Uploaded by CNBC Television", "view": 10}, {"title": "Political Cartoons on President Joe Biden | Elections | US News", "body": "Political Cartoons on President Joe Biden. The former vice president is the 46th president of the United States. Oct. 4, 2021. Oct. 4, 2021, at 4:11 p.m..", "view": 10}, {"title": "Joe Biden - NBC New York", "body": "Biden Lifts Abortion Referral Ban on Family Planning Clinics ... Biden on Raising Debt Ceiling: 'That Is Up to Mitch McConnell'. President Joe Biden ...", "view": 10}, {"title": "Joe Biden plays down chances of UK-US trade deal - BBC News", "body": "Shahrivar 31, 1400 AP — Joe Biden has played down the chances of a post-Brexit free trade deal between the US and UK, as he held talks with Boris Johnson at the ...", "view": 10}, {"title": "President Biden urges unity in first UN speech amid tensions ...", "body": "Shahrivar 30, 1400 AP — Joe Biden called for cooperation in his first speech as US president to the UN General Assembly.", "view": 10}, {"title": "Joe Biden: Where does he stand on key issues? - BBC News", "body": "Dey 30, 1399 AP — When he formally announced his entry into the 2020 presidential race, Joe Biden declared that he stood for two things - workers who \"built ...", "view": 10}, {"title": "Federal Register :: Executive Orders", "body": "Executive Orders view all Presidential Documents. In 2021, Joseph R. Biden Jr. published 63 executive orders (from EO 13985 through EO 14047) ...", "view": 10}, {"title": "Joe Biden and Kamala Harris: TIME's Person of the Year 2020", "body": "Together, Joe Biden and Kamala Harris offered restoration and renewal in a single ticket. And America bought what they were selling.", "view": 10}, {"title": "'You've Got to Have Purpose.' Joe Biden's 2020 Campaign Is ...", "body": "Bahman 10, 1398 AP — It's dark inside Joe Biden's campaign bus, a lumbering blue diesel emblazoned with the slogan Battle for the Soul of the Nation.", "view": 10}, {"title": "Joe Biden - HuffPost", "body": "Joe Biden news and opinion. ... Biden Lifts Abortion Referral Ban On Family Planning Clinics. The Trump-era restriction blocked Title X family planning ...", "view": 10}, {"title": "UK Brexit minister Lord Frost warns Joe ... - Independent.ie", "body": "20 hours ago — The UK's Brexit minister has warned Joe Biden to stay out Northern Ireland Brexit talks, branding the president no more than an \"interested ...", "view": 10}, {"title": "Biden's Chicago-area trip is back on; will be here Thursday to ...", "body": "22 hours ago — 29 visit, President Joe Biden now will travel to the Chicago suburbs on Thursday to highlight his order to require large employers to ...", "view": 10}, {"title": "Joe Biden: Latest News & Coverage on 46th U.S. President", "body": "The United States experienced the greatest voter turnout in modern history, which led to Joe Biden receiving a total of 290 electoral votes, leaving Trump with ...", "view": 10}, {"title": "Joe Biden - The Telegraph", "body": "Joe Biden. What are trade deals between countries – and why does the UK want one with the US? Securing a post-Brexit free trade deal with the US is a key ...", "view": 10}, {"title": "You can take Joe Biden out of the Senate, but … - Roll Call", "body": "4 hours ago — Many see President Joe Biden's public tolerance for the meandering ways of Congress as a weakness, Shapiro writes.", "view": 10}, {"title": "Joe Biden wins the US presidential election - CNN", "body": "Aban 17, 1399 AP — America has chosen Democrat Joe Biden as its 46th president, CNN projects, turning at a time of national crisis to a man whose character was ...", "view": 10}, {"title": "Joe Biden has spent his entire life preparing for this week - CNN", "body": "Mehr 5, 1400 AP — If you asked President Joe Biden to sum up his life -- and political career -- in a single term, he would probably say \"deal-maker.\"", "view": 10}, {"title": "'Saturday Night Live' recasts President Joe Biden in season ...", "body": "2 days ago — From left to right: Aidy Bryant as Sen. Joe Manchin, Cecily Strong as Sen Krysten Sinema, James Austin Johnson as President Joe Biden, Ego ...", "view": 10}, {"title": "President Joe Biden coming to Michigan this week - FOX 2 ...", "body": "1 day ago — U.S. President Joe Biden speaks at Mack Truck Lehigh Valley Operations on July 28, 2021 in Macungie, Pennsylvania. President Biden spoke to ...", "view": 10}, {"title": "Biden calls out Republicans for refusing to help raise debt ...", "body": "22 hours ago — President Joe Biden on Monday called out Republicans for failing to join Democrats to raise the debt ceiling, saying they were being ...", "view": 10}, {"title": "Joe Biden: What you need to know about the 46th president", "body": "Bahman 1, 1399 AP — What you might not know about former Vice President Joe Biden: As senator, he appointed Sen. Dianne Feinstein as the first woman on the ...", "view": 10}, {"title": "Joe Biden's poll numbers are plummeting at exactly the wrong ...", "body": "Mehr 1, 1400 AP — It's been a very rough last two months for President Joe Biden, plagued by a disastrous end to the war in Afghanistan and the Delta variant ...", "view": 10}, {"title": "Presidency of Joe Biden - Wikipedia", "body": "Joe Biden's tenure as the 46th president of the United States began with his inauguration on January 20, 2021. Biden, a Democrat from Delaware who ...", "view": 10}, {"title": "President Joe Biden on his economic plan - YouTube", "body": "22:25President Joe Biden discusses his Build Back Better economic plan, which he says benefits everyone ...Shahrivar 27, 1400 AP · Uploaded by CNBC Television", "view": 10}, {"title": "Joseph Biden Jr., President of the United States - GovTrack.us", "body": "Legislative profile for President Joseph Biden [D], the President of the United States. ... Biden was the primary sponsor of 42 bills that were enacted.", "view": 10}, {"title": "Joe Biden needs a victory but progressives are eating him alive", "body": "20 hours ago — President Joe Biden delivers remarks on the debt ceiling during an event in the State Dining Room of the White House, Monday, Oct. 4, 2021, ...", "view": 10}, {"title": "Weak Joe Biden caves to loony left: Goodwin - New York Post", "body": "2 days ago — President Joe Biden's comments after the meeting revealed his capitulation, saying first that “we're going to get this done.”", "view": 10}, {"title": "The leading advocate for public education - National School ...", "body": "5 days ago — The Honorable Joseph R. Biden ... 10 Joe Strupp, Asbury Park Press, “NJ mask mandate for students sparks school board disruption, ...", "view": 10}, {"title": "With \"Strong\" Message On China, Biden Dials New Japan ...", "body": "12 hours ago — New Japanese Prime Minister Fumio Kishida said on Tuesday that he received a \"strong\" message from President Joe Biden about the United ...", "view": 10}, {"title": "BoJo (Possibly) Boosts Biden's Build Back Better by Being Weird", "body": "17 hours ago — ... and chips (considering the provenance of the video) and saying what appears to be a few words of support for U.S. president Joe Biden.", "view": 10}, {"title": "Joe Biden's challenge at his first UN General Assembly - CNN", "body": "Shahrivar 30, 1400 AP — When President Joe Biden mounts the iconic green marble rostrum inside the hall of the United Nations General Assembly on Tuesday, ...", "view": 10}, {"title": "Joe Biden's Criminal Justice Policy", "body": "As president, Joe Biden will strengthen America's commitment to justice and reform our criminal justice system. The Biden Plan for Strengthening America's ...Mordad 1, 1398 AP · Uploaded by Joe Biden", "view": 10}, {"title": "Guide to the Joe Biden Presidency - Investopedia", "body": "Shahrivar 15, 1400 AP — One of America's youngest senators at 30 and its oldest president at 78, Joe Biden's story includes major accomplishments, life-altering ...", "view": 10}, {"title": "The key question Joe Biden must answer in his debut ... - CNN", "body": "Shahrivar 30, 1400 AP — As President Joe Biden makes his presidential debut at the United Nations General Assembly on Tuesday, the question is not whether America ...", "view": 10}, {"title": "Joe Biden warns 'a meteor is headed to crash into our economy'", "body": "22 hours ago — President Joe Biden accused Senate Republicans of taking a \"reckless\" position in refusing to join Democrats in voting to raise the ...", "view": 10}, {"title": "President Joe Biden pitching infrastructure plan in Howell on ...", "body": "5 hours ago — President Joe Biden will be in metro Detroit on Tuesday. He's heading to Howell to pitch his infrastructure plan and push it across the ...", "view": 10}, {"title": "Chants of 'F--- Joe Biden' rain down from NASCAR ... - Fox News", "body": "3 days ago — Chants of “F--- Joe Biden” rained down from the crowd at Alabama's Talladega Superspeedway after Brandon Brown captured his first NASCAR ...", "view": 10}, {"title": "Statement by President Joe Biden on the Investigation into the ...", "body": "Khordad 5, 1400 AP — Back in early 2020, when COVID-19 emerged, I called for the CDC to get access to China to learn about the virus so we could fight it more ...", "view": 10}, {"title": "President Joe Biden is headed to Michigan on Tuesday | WEYI", "body": "2 days ago — WASHINGTON - President Joe Biden is coming to Howell, Michigan on Tuesday. According to the White House, the president will rally for his ...", "view": 10}, {"title": "President Joe Biden coming to Michigan Tuesday - what to know", "body": "President Joe Biden's \"'Build Back Better\" plan would benefit Michigan in several key ways. HOWELL, Mich. - President Joe Biden will be visiting Michigan ...", "view": 10}, {"title": "Which do you hear? Reporter mistakes crowd's 'F ... - Yahoo", "body": "Reporter mistakes crowd's 'F*** Joe Biden' chant for 'Let's Go Brandon'. Kaelan Deese. Sun, October 3, 2021, 10:39 AM ·2 min read. In this article:.", "view": 10}, {"title": "Kamala Harris Made Joe Biden's Rough Week Even Worse", "body": "2 days ago — The past week was tough for President Joe Biden. Vice President Kamala Harris didn't make it any easier. Biden's legislative agenda ...", "view": 10}, {"title": "Joe Manchin and Kyrsten Sinema - The Guardian", "body": "2 days ago — The West Virginia and Arizona senators' resistance threatens to upend Biden's entire presidency – is self-preservation to blame?", "view": 10}, {"title": "Joe Biden: six months on, cold, hard reality eclipses early ...", "body": "Tir 28, 1400 AP — Joe Biden's meeting with German chancellor last week offered comfort food for anyone nostalgic for the old global order.", "view": 10}, {"title": "Battle for the Soul: can Joe Biden beat Trump's Republicans", "body": "Mordad 17, 1400 AP — Joe Biden declared his third candidacy for president on 25 April 2019 in a three-and-a-half minute video. The format was new, but for Biden ...", "view": 10}, {"title": "Refugee admissions hit record low, despite Biden's reversal", "body": "13 hours ago — SAN DIEGO (AP) — Refugee admissions to the United States fell to a record low during the 2021 budget year, despite President Joe Biden's ...", "view": 10}, {"title": "Biden plots debt ceiling blitz to focus the blame on McConnell", "body": "6 hours ago — President Joe Biden delivers remarks about the need for Congress to raise the debt limit at the White House on Oct. 4.", "view": 10}, {"title": "Biden: 'I can't' guarantee U.S. won't hit debt limit - POLITICO", "body": "21 hours ago — President Joe Biden said Monday that he could not guarantee that the federal government will not default on debt payments due later this ...", "view": 10}, {"title": "Democratic party in-fighting threatens President Joe Biden's ...", "body": "23 hours ago — President Joe Biden's ambitious domestic legislative agenda, including infrastructure and social programs spending, hangs in the balance as ...", "view": 10}, {"title": "Which do you hear? Reporter mistakes crowd's 'F*** Joe ...", "body": "Reporter mistakes crowd's 'F*** Joe Biden' chant for 'Let's Go Brandon'. Kaelan Deese. Sun, October 3, 2021, 10:39 AM ·2 min read. In this article:.", "view": 10}, {"title": "If Joe Biden fails this week, his entire domestic agenda ... - CNN", "body": "Shahrivar 30, 1400 AP — It's impossible to overstate the stakes of this week's legislative horse-trading for the remainder of Joe Biden's presidency.", "view": 10}, {"title": "President Joe Biden's Job Approval Stabilizes, But Not Among ...", "body": "1 day ago — President Biden's job approval rating has stopped its slide, the October IBD/TIPP Poll finds, but Democrats are turning less bullish on him.", "view": 10}, {"title": "Have You Heard the One About President Joe Biden? - GQ", "body": "Tir 27, 1392 AP — \"Keep going straight here,\" Joe Biden says. We've been at this for hours, climbing in and out of the SUV to look at stuff, a water tower, ...", "view": 10}, {"title": "Saturday Night Live is back with a new Joe Biden - NBC2 News", "body": "2 days ago — CNN — “Saturday Night Live” is back and the show came back with a new President Joe Biden. The variety show returned for its season premiere ...", "view": 10}, {"title": "Presidential Approval Ratings -- Joe Biden - Gallup News", "body": "Do you approve or disapprove of the way Joe Biden is handling his job as president?", "view": 10}, {"title": "Why Joe Biden is such an elusive target for his critics", "body": "Mordad 12, 1400 AP — The gesture was twice foolish. First, whatever Joe Biden's line on abortion, neither his pastor nor the Holy See support his exclusion. Second, ...", "view": 10}, {"title": "How Europe's relationship with Joe Biden turned sour - BBC", "body": "Shahrivar 11, 1400 AP — A series of disagreements, most notably over Afghanistan, have some European leaders revising their expectations about President Joe Biden, ...", "view": 10}, {"title": "Joe Biden: Life Before the Presidency | Miller Center", "body": "Joseph Robinette Biden Jr. was born on November 20, 1942, in Scranton, Pennsylvania, ... In 1953, Joe Sr. landed a job selling cars in Wilmington, Delaware, ...Works written: Promises to Keep", "view": 10}, {"title": "Build Back Better: Joe Biden's Jobs and Economic Recovery ...", "body": "Joe Biden believes to his core that there's no greater economic engine in the world than the hard work and ingenuity of the American people.", "view": 10}, {"title": "Plan for Full Participation and Equality for People with ...", "body": "Read Joe Biden's plan to support people with disabilities during the COVID-19 pandemic at https://joebiden.com/covid19-disabilities/.", "view": 10}, {"title": "Joe Biden reverses Donald Trump's abortion policy on federal ...", "body": "6 hours ago — The Biden administration has reversed a controversial policy set under Donald Trump barring organisations providing abortion referrals from ...", "view": 10}, {"title": "Joe Biden presidential campaign, 2020 - Ballotpedia", "body": "Joe Biden's campaign website lists the following foreign policy goals: \"Defend our Vital Interests: As president, Biden will never hesitate to protect the ...", "view": 10}, {"title": "Key parts of Biden's plan to confront delta variant surge", "body": "Shahrivar 18, 1400 AP — WASHINGTON (AP) — President Joe Biden has unveiled a new “action plan\" plan to confront the COVID-19 surge that's being driven by the spread ...", "view": 10}, {"title": "Op-Ed: Don't Let Joe Biden Snoop on Your Bank Account", "body": "1 day ago — President Biden likes to claim his $3.5 trillion tax and spending spree will only hurt the wealthiest Americans, leaving everyone else ...", "view": 10}, {"title": "Biden calls for Senate to vote on debt limit increase this week", "body": "21 hours ago — President Joe Biden joined Senate Majority Leader Chuck Schumer in calling Monday for a vote on the debt limit this week.", "view": 10}, {"title": "Joe Biden 2020 - Politico", "body": "Read the latest streaming news and analysis on Joe BIden and the 2020 Presidential Election. Follow today's top polls, candidates, primaries, fundraising, ...", "view": 10}, {"title": "Plan to Protect and Build on Obamacare - Joe Biden for ...", "body": "Joe Biden will protect and build on Obamacare by giving Americans more choice, reducing health care costs, and making the system less complex to navigate.Tir 24, 1398 AP · Uploaded by Joe Biden", "view": 10}, {"title": "The Biden Plan to End Our Gun Violence Epidemic", "body": "Joe Biden will enact legislation to once again ban assault weapons. This time, the bans will be designed based on lessons learned from the 1994 bans. For ...", "view": 10}, {"title": "United States President Joe Biden depends Afghan evacuation", "body": "5:14Now American president Joe Biden is of course facing a lot of criticism over America's chaotic and ...Shahrivar 21, 1400 AP · Uploaded by WION", "view": 10}, {"title": "Biden tells GOP to “get out of the way” on debt limit - The ...", "body": "12 hours ago — President Joe Biden on Monday told Republican senators to “get out of the way” and let Democrats suspend the nation's debt limit on their ...", "view": 10}, {"title": "Statement by President Joe Biden | The White House", "body": "Statement by President Joe Biden. August 30, 2021 • Statements and Releases. I want to thank our commanders and the men and women serving under them for ...", "view": 10}, {"title": "Statement by President Joe Biden on the Continuing Resolution", "body": "5 days ago — Tonight, I signed into law the continuing resolution to fund the government through early December. I want to thank both houses of ...", "view": 10}, {"title": "Why we're against Joe Biden's infrastructure bill | Opinion", "body": "4 days ago — Republican legislators: Why we're against Joe Biden's infrastructure bill. BY JOHN N. KENNEDY, STEVE SCALISE, GARRET GRAVES, CLAY HIGGINS, ...", "view": 10}, {"title": "Joe Biden didn't just compromise with segregationists. He ...", "body": "Tir 4, 1398 AP — Joe Biden helped give America the language that is still used to oppose school integration today, legislative and education history experts ...", "view": 10}, {"title": "Biden defeats Trump to win White House, NBC News projects", "body": "Aban 17, 1399 AP — A victory in Pennsylvania put Joe Biden over the 270 Electoral College vote threshold needed to win the presidency.", "view": 10}, {"title": "Biden defends Afghanistan policy amid mounting criticism", "body": "Mordad 25, 1400 AP — President Joe Biden returned to the White House Monday afternoon to give a speech on the situation in Afghanistan.", "view": 10}, {"title": "Who's Biden gonna call after Merkel? - POLITICO", "body": "1 day ago — President Joe Biden and German Chancellor Angela Merkel during a news conference in the East Room of the White House. | Susan Walsh/AP Photo.", "view": 10}, {"title": "President Joe Biden: Wealthy should pay their fair share in taxes", "body": "2:53President Joe Biden delivers remarks on the economy and why he is calling for the wealthy to pay all the taxes ...Shahrivar 25, 1400 AP · Uploaded by CNBC Television", "view": 10}, {"title": "US President Joe Biden to host Quad summit", "body": "4:48Quad meeting will take place on 21st September 2021 under the chairmanship of US President Joe Biden .The ...Shahrivar 23, 1400 AP · Uploaded by WION", "view": 10}, {"title": "President Joe Biden: 'The war in Afghanistan is now over'", "body": "5:21President Joe Biden addresses the nation following the final withdrawal of troops from Afghanistan. \"If you're ...Shahrivar 10, 1400 AP · Uploaded by CNBC Television", "view": 10}, {"title": "Joe Biden's suggestion of summit with Xi Jinping falls on deaf ...", "body": "Shahrivar 23, 1400 AP — Joe Biden suggested he hold a face-to-face summit with Chinese president Xi Jinping during a 90-minute call last week but failed to secure ...", "view": 10}, {"title": "Biden Calls Out Manchin, Sinema for Holding up Economic ...", "body": "21 hours ago — Biden swipes at Joe Manchin and Kyrsten Sinema for holding up progress on his social spending plans. Joseph Zeballos-Roig and Grace Panetta. in ...", "view": 10}, {"title": "Joe Biden facts and photos - National Geographic Kids", "body": "Fast Facts. NAME: Joseph Robinette Biden, Jr. NICKNAME: Joe, Amtrak Joe; BORN: November 20, 1942, in Scranton, ...Party: Democratic Party", "view": 10}, {"title": "Readout of Joseph R. Biden, Jr.'s Call with Prime Minister ...", "body": "14 hours ago — President Joseph R. Biden, Jr. spoke today with Prime Minister Kishida Fumio of Japan to congratulate him on his election.", "view": 10}, {"title": "Statement by President Joe Biden on Supreme Court Ruling ...", "body": "Shahrivar 11, 1400 AP — Statement by President Joe Biden on Supreme Court Ruling on Texas Law SB8 ... The Supreme Court's ruling overnight is an unprecedented assault on ...", "view": 10}, {"title": "Joe Biden's Forever Diplomacy - WSJ", "body": "Mehr 5, 1400 AP — Joe Biden's Forever Diplomacy. Tehran violates another international deal for nuclear inspections. By. The Editorial Board.", "view": 10}, {"title": "Joe Biden's Lose-Lose Week - WSJ", "body": "Mehr 5, 1400 AP — Joe Biden's Lose-Lose Week. Failure to pass his agenda could sink his presidency—but so could passing it. By. William McGurn.", "view": 10}, {"title": "Joe Biden's Economic Fantasy World - WSJ", "body": "Mehr 5, 1400 AP — Joe Biden's Economic Fantasy World. He seems to think that if you pay for something it doesn't cost anything. Hold on to your wallet.", "view": 10}, {"title": "Remarks by President Biden on the End of the War in ...", "body": "Shahrivar 9, 1400 AP — State Dining Room 3:28 P.M. EDT THE PRESIDENT: Last night in Kabul, the United States ended 20 years of war in Afghanistan -- the longest ...", "view": 10}, {"title": "Full transcript of ABC News' George Stephanopoulos ...", "body": "Mordad 28, 1400 AP — Read the full transcript of President Joe Biden's exclusive interview with ABC News' George Stephanopoulos on Wednesday.", "view": 10}, {"title": "Opinion | Joe Biden: My trip to Europe is about America ...", "body": "Khordad 15, 1400 AP — Joe Biden is president of the United States. On Wednesday, I depart for Europe on the first foreign travel of my presidency.", "view": 10}, {"title": "Biden accuses Republicans of recklessness in debt ceiling ...", "body": "21 hours ago — Senate majority leader Chuck Schumer, President Joe Biden and Senate minority leader Mitch McConnell From left: Senate majority leader Chuck ...", "view": 10}, {"title": "Biden tells GOP to 'get out of the way' on debt limit | CTV News", "body": "19 hours ago — U.S. President Joe Biden on Monday told Republican senators to 'get out of the way' and let Democrats suspend the nation's debt limit on ...", "view": 10}, {"title": "Joe Biden: There's a smarter way to be tough on Iran - CNN", "body": "Shahrivar 23, 1399 AP — Warning that Donald Trump's Iran policy \"is a dangerous failure\" that has worsened the threat to American security, Joe Biden spells out ...", "view": 10}, {"title": "Biden Wins Presidency, Ending Four Tumultuous Years Under ...", "body": "Ordibehesht 6, 1400 AP — Joseph R. Biden Jr. achieved victory offering a message of healing and unity. He will return to Washington facing a daunting set of crises.", "view": 10}, {"title": "Afghanistan: Joe Biden speech on withdrawal fact-checked", "body": "Shahrivar 10, 1400 AP — In a televised address following the final departure of US troops from Afghanistan, President Joe Biden made a series of assertions about US ...", "view": 10}, {"title": "How Joe Biden Became a Steady Hand Amid So Much Chaos", "body": "Shahrivar 8, 1400 AP — In recent months, Mr. Biden's restraint with words and his refusal to take the political bait laid by President Trump show a level of ...", "view": 10}, {"title": "Remarks by President Biden on the Terror Attack at Hamid ...", "body": "Shahrivar 4, 1400 AP — East Room 5:24 P.M. EDT THE PRESIDENT: Been a tough day. This evening in Kabul, as you all know, terrorists attacked --", "view": 10}, {"title": "Biden tells GOP to 'get out of the way' on debt limit | KSTP.com", "body": "22 hours ago — President Joe Biden accused Republican lawmakers on Monday of blocking efforts to increase the government's borrowing authority, ...", "view": 10}, {"title": "'SNL' returns with a new Joe Biden, looking to unite Democrats", "body": "2 days ago — “Saturday Night Live” is back, and with it came a new President Joe Biden. The NBC variety show returned for its season premiere Saturday and ...", "view": 10}, {"title": "Biden shows stubborn streak in refusal to shift course on ...", "body": "Mordad 25, 1400 AP — President Joe Biden delivers a speech on Afghanistan from the White House Joe Biden said at the White House on Monday: 'I have learned the ...", "view": 10}, {"title": "Afghanistan: 'The sooner we finish, the better,' says Joe Biden", "body": "Shahrivar 3, 1400 AP — US President Joe Biden says the US is \"on pace\" to meet a 31 August deadline for evacuations, despite previous calls from allies for an ...", "view": 10}, {"title": "Joe Biden: Unearthing the president's unsung English roots", "body": "Khordad 21, 1400 AP — Joe Biden's presence in the UK this week brings him closer to a part of his family heritage that had been obscure - until recently.", "view": 10}, {"title": "Endettement des États-Unis | Joe Biden fustige l'attitude", "body": "17 hours ago — Le président américain fait monter la pression : à cause d'une opposition républicaine « irresponsable », Joe Biden a dit lundi qu'il ne ...", "view": 10}, {"title": "Joe Biden: the new president seeks to heal a divided US", "body": "Bahman 3, 1399 AP — This week, Mr Biden, 78, started trying to make that promise a reality as he took the oath of office as America's 46th president. He has reached ...", "view": 10}, {"title": "Joe Biden profile: Third White House run lucky for 'Middle ...", "body": "Bahman 1, 1399 AP — So who is Joe Biden and how did he become US president? A political fixture. Mr Biden ran for the Democratic 2008 nomination before dropping out ...", "view": 10}, {"title": "U.S. President Joe Biden | News | The Star", "body": "Ongoing coverage of U.S. President Joe Biden at thestar.com. Visit thestar.com for breaking news on the U.S. election.", "view": 10}, {"title": "Statement by President Joe Biden on the Investigation into the", "body": "Shahrivar 5, 1400 AP — This week, I received the report on the 90-day sprint I asked our intelligence community to conduct into the origins of the COVID-19 ...", "view": 10}, {"title": "Statement by President Joe Biden and First Lady Jill Biden on ...", "body": "Farvardin 20, 1400 AP — On behalf of all the people of the United States, we send our deepest condolences to Her Majesty Queen Elizabeth II, the entire Royal Family ...", "view": 10}, {"title": "President Joe Biden: 'The world is changing' - YouTube", "body": "3:28President Joe Biden speaks from the White House following the final evacuation of U.S. troops from Afghanistan.Shahrivar 10, 1400 AP · Uploaded by CNBC Television", "view": 10}, {"title": "Joe Biden in Winter - Politico", "body": "Vice President Joe Biden and I were riding the Amtrak to Philly on a frigid February day. I had asked about 2016 and whether America was ready, ...", "view": 10}, {"title": "Plan for Education Beyond High School - Joe Biden for ...", "body": "Joe Biden is running for president to rebuild the backbone of the United States – the middle class – and this time make sure everyone has a chance to come ...", "view": 10}, {"title": "Biden calls on Cuomo to resign after bombshell sexual ...", "body": "Mordad 12, 1400 AP — President Joe Biden called on Democratic New York Gov. Andrew Cuomo to resign Tuesday, following a report that Cuomo sexually harassed 11 ...", "view": 10}, {"title": "Analysis: Defiant Biden is face of chaotic Afghan evacuation", "body": "Mordad 25, 1400 AP — Four presidents share responsibility for the missteps in Afghanistan that accumulated over two decades. But only President Joe Biden will be ...", "view": 10}, {"title": "Biden takes the helm, appeals for unity to take on crises", "body": "Bahman 1, 1399 AP — WASHINGTON (AP) — Joe Biden was sworn in as the 46th president of the United States on Wednesday, declaring that “democracy has prevailed” ...", "view": 10}, {"title": "Biden's declaration: America's democracy 'is rising anew'", "body": "Ordibehesht 9, 1400 AP — WASHINGTON (AP) — President Joe Biden declared Wednesday night that “America is rising anew” as he called for an expansion of federal ...", "view": 10}, {"title": "Remarks by President Biden in Address to a Joint Session of ...", "body": "Ordibehesht 9, 1400 AP — Remarks by President Biden in Address to a Joint Session of Congress ... If I've heard it once, I've heard it a thousand times: “Joe, ...", "view": 10}, {"title": "Statement by President Joseph R. Biden, Jr. on Protests in Cuba", "body": "Tir 21, 1400 AP — Statement by President Joseph R. Biden, Jr. on Protests in Cuba ... We stand with the Cuban people and their clarion call for freedom and relief ...", "view": 10}, {"title": "Iran nuclear: Other options if diplomacy fails, says Biden - BBC", "body": "Shahrivar 5, 1400 AP — US President Joe Biden has said that if diplomacy does not resolve the Iranian nuclear crisis, America \"is ready to turn to other options\". · He ...", "view": 10}, {"title": "Joe Biden just can't quit Delaware -- even as president - CNN", "body": "Esfand 23, 1399 AP — Bidding farewell to his adopted home state in January, Joe Biden -- then the President-elect -- grew emotional as he boarded his flight to ...", "view": 10}, {"title": "The Biden Plan to Ensure the Future is “Made in All of America ...", "body": "Joe Biden will mobilize the talent, grit, and innovation of the American people and the full power of the federal government to bolster American industrial ...", "view": 10}, {"title": "A President-Elect Shaped by Tragedy and Tradition - The New ...", "body": "Ordibehesht 24, 1400 AP — Joseph R. Biden Jr. has spent his career devoted to institutions and ... “They're invested in Joe Biden because of him, of who they see as ...", "view": 10}, {"title": "Opinion | I Observed Joe Biden at Close Range for 20 Years ...", "body": "Mordad 18, 1399 AP — Democratic presidential candidate former Vice President Joe Biden speaks at the Chase Center July 14,. Chip Somodevilla/Getty Images. Opinion ...", "view": 10}, {"title": "Joe Biden heads overseas as his prospects darken at home", "body": "Khordad 19, 1400 AP — Joe Biden is heading abroad, just at the moment when his hopes for a historic legislative legacy at home seem headed for a wall.", "view": 10}, {"title": "At 100 days, where does President Biden stand with the public?", "body": "Ordibehesht 2, 1400 AP — In the short term, Biden's outlook is positive, but America's divides ... U.S. President Joe Biden speaks during a virtual Leaders Summit on ...", "view": 10}, {"title": "Statement by President Joe Biden on Hong Kong's Apple Daily", "body": "Statement by President Joe Biden on Hong Kong's Apple Daily. June 24, 2021 • Statements and Releases. It is a sad day for media freedom in Hong Kong and ...", "view": 10}, {"title": "Remarks by President Biden in Press Conference - The White ...", "body": "Farvardin 5, 1400 AP — “I'm going to send him on a thousand-mile journey across the desert and up to the United States because I know Joe Biden is a nice guy and ...", "view": 10}, {"title": "Remarks by President Biden in a CNN Town Hall with Don ...", "body": "Tir 31, 1400 AP — Mount St. Joseph UniversityCincinnati, Ohio (July 21, 2021) 8:01 P.M. EDT THE PRESIDENT: How you doing, pal? Good to.", "view": 10}, {"title": "Joe Biden: The Heartbreaking Car Accident that Killed His Wife", "body": "Bahman 9, 1399 AP — It was love at first sight for Joe Biden. The University of Delaware junior had taken a spring break trip to the Bahamas and sneaked into an ...", "view": 10}, {"title": "Beneath Joe Biden's Folksy Demeanor, a Short Fuse and an ...", "body": "Ordibehesht 25, 1400 AP — As Mr. Biden settles into the office he has chased for more than three decades, aides say he demands hours of debate from scores of policy ...", "view": 10}, {"title": "Biden 100 days: What we all got wrong about him - BBC News", "body": "Ordibehesht 7, 1400 AP — As I remarked, perhaps unwisely, to an audience the other night, the transition from Trump to Joe Biden has been like going from a daily crack ...", "view": 10}, {"title": "'SNL' returns with a new Joe Biden, looking to unite Democrats", "body": "2 days ago — By Frank Pallotta, CNN Business. “Saturday Night Live” is back, and with it came a new President Joe Biden.", "view": 10}]