[{"title": "Donald Trump - Wikipedia", "body": "Donald John Trump (born June 14, 1946) is an American politician, media personality, and businessman who served as the 45th president of the United States ...Vice President: Mike PenceOther political affiliations: Reform (1999–2001); ...‎Political party: Republican (1987–1999, 2009–...‎Occupation: Politician; businessman; television ...‎Bibliography of Donald Trump · ‎Donald Trump 2016... · ‎Donald Trump sexual...", "view": 10}, {"title": "Donald J. Trump: Home", "body": "Over the past four years, Donald J. Trump's administration delivered for Americans of all backgrounds like never before. Save America is about building on ...‎News · ‎Events · ‎Alerts · ‎Terms of Service", "view": 10}, {"title": "Donald J. Trump - Home | Facebook", "body": "Donald J. Trump, New York, NY. 32691131 likes · 24043 talking about this. This is the official Facebook page for Donald J. Trump.", "view": 10}, {"title": "Donald Trump | TheHill", "body": "Donald Trump. Getty Images. 0 Tweet Share More. Occupation: President of the United States, 2017 - 2021. Political Affiliation: Republican. Residence:.", "view": 10}, {"title": "President Donald J. Trump - Instagram", "body": "23.8m Followers, 8 Following, 6076 Posts - See Instagram photos and videos from President Donald J. Trump (@realdonaldtrump)", "view": 10}, {"title": "Trump News, Commentary and Analysis - CNN", "body": "News on former President Donald Trump and the Trump administration.", "view": 10}, {"title": "Donald Trump - CNBC", "body": "Donald Trump was the 45th president of the United States.", "view": 10}, {"title": "Donald Trump - Latest News and Top Stories", "body": "Donald Trump · Politics News · Bannon fires up 'shock troops' for next GOP White House · NBC News NOW · Jan. 6 Capitol riot committee issues subpoenas to top Trump ...", "view": 10}, {"title": "Donald Trump news - latest live updates - The Independent", "body": "Donald Trump news, tweets, Biden and election updates.", "view": 10}, {"title": "Donald Trump | Today's latest from Al Jazeera", "body": "Trump has claimed fraud in the election in Arizona, a key swing state that helped Biden gain the White House. 24 Sep 2021 ...", "view": 10}, {"title": "The Trump Organization | Luxury Real Estate Portfolio", "body": "The official website of The Trump Organization. Explore our luxury real estate portfolio of the finest hotels, golf courses, estates and more.", "view": 10}, {"title": "Donald J. Trump Official Biography | The Trump Organization", "body": "Donald J. Trump is currently the 45th President of the United States and the Founder of the Trump Organization, a global real estate empire and one of the ...", "view": 10}, {"title": "Donald Trump - Ballotpedia", "body": "Former Vice President Joe Biden (D) defeated Trump in the 2020 presidential election on November 3, 2020. Biden received 306 electoral votes, while Trump ...Domestic policy: Abortion • Crime and justice • ...Economic affairs and regulations: Agriculture a...Foreign affairs and national security: Afghanist...", "view": 10}, {"title": "Donald J. Trump | The White House", "body": "The biography for President Trump and past presidents is courtesy of the White House Historical Association. Donald John Trump was born in Queens, New York, ...", "view": 10}, {"title": "Donald Trump | US news | The Guardian", "body": "The latest news, opinion and analysis on Donald Trump, the 45th president of the United States.", "view": 10}, {"title": "Donald Trump News & Videos - ABC News", "body": "23 deadline for former President Donald Trump to undergo questioning in a former “Apprentice” contestant's defamation lawsuit over what he said in denying ...", "view": 10}, {"title": "Donald Trump - AP News", "body": "News from The Associated Press, the definitive source for independent journalism from every corner of the globe.", "view": 10}, {"title": "Donald Trump - The New York Times", "body": "News about Donald Trump, including commentary and archival articles published in The New York Times.", "view": 10}, {"title": "Donald Trump | Fox News", "body": "Donald Trump is a Republican who served as the 45th president of the United States from 2017 to 2021. Prior to entering politics, Trump was a real estate ...", "view": 10}, {"title": "Donald Trump - The Latest News from the UK and Around the ...", "body": "Sky News - First for Breaking News, video, headlines, analysis and top stories from business, politics, entertainment and more in the UK and worldwide.", "view": 10}, {"title": "Donald Trump - Forbes", "body": "Donald Trump was the only billionaire president in American history. The bulk of his fortune remains tied up in New York City real estate.", "view": 10}, {"title": "Donald Trump: news, videos, reports and analysis - France 24", "body": "Find all the latest articles and watch TV shows, reports and podcasts related to Donald Trump on France 24.", "view": 10}, {"title": "Donald Trump: Latest News, Top Stories & Analysis - POLITICO", "body": "Read the latest news and analysis on President Donald Trump. Follow today's top stories and breaking news from inside Washington D.C. and beyond.", "view": 10}, {"title": "Donald J Trump - YouTube", "body": "This is the official YouTube Channel for Donald J. Trump.", "view": 10}, {"title": "Latest News, Videos and Donald Trump Photos | Times of India", "body": "Donald John Trump is the 45th President of the USA, who took over the office since January 20, 2017. He is also an American businessman, ...Date of birth: June 14, 1946", "view": 10}, {"title": "Donald Trump | South China Morning Post", "body": "in 2017, after he defeated Democratic rival Hillary Clinton in the general election of 2016. He was preceded by Barack Obama, who was in office for two ...", "view": 10}, {"title": "Donald Trump - WSJ Spotlight Coverage, Recent News", "body": "Donald Trump was the 45th president of the U.S. He beat Democratic candidate Hillary Clinton in the 2016 election, becoming the first without prior military ...", "view": 10}, {"title": "Donald Trump - PolitiFact", "body": "PolitiFact is a fact-checking website that rates the accuracy of claims by elected officials and others on its Truth-O-Meter.", "view": 10}, {"title": "Donald Trump | PEOPLE.com", "body": "I'll Take Your Questions Now by Stephanie Grisham reportedly covers the first lady's reaction to her husband's alleged infidelity, the infamous jacket she ...", "view": 10}, {"title": "Donald Trump | Financial Times", "body": "We use cookies for a number of reasons, such as keeping FT Sites reliable and secure, personalising content and ads, providing social media features and to ...", "view": 10}, {"title": "Donald Trump | Latest News, Photos & Videos | WIRED", "body": "Find the latest Donald Trump news from WIRED. See related science and technology articles, photos, slideshows and videos.", "view": 10}, {"title": "President Biden (@POTUS) | Twitter", "body": "The latest Tweets from President Biden (@POTUS). 46th President of the United States, husband to @FLOTUS, proud dad & pop. Tweets may be archived: ...", "view": 10}, {"title": "Donald J. Trump (@DonaldTrump) | Twitter", "body": "The latest Tweets from Donald J. Trump (@DonaldTrump). Visit the official Donald J. Trump Twitter handle @realDonaldTrump. https://t.co/HyNW4tByaR.", "view": 10}, {"title": "Donald Trump - Vox", "body": "Coverage of the 45th president of the United States, from his domestic and foreign policy to his tweets.", "view": 10}, {"title": "Donald Trump news & latest pictures from Newsweek.com", "body": "Donald John Trump is the 45th President of the United States. Trump won as a Republican against Democrat Hillary Clinton in 2016.", "view": 10}, {"title": "Donald Trump | News, Videos & Articles", "body": "Donald Trump videos and latest news articles; GlobalNews.ca your source for the latest news on Donald Trump .", "view": 10}, {"title": "Donald Trump - BBC News", "body": "US trade representative vows new approach to Beijing, saying it will take \"all steps necessary” to protect interests. Read more. Article share tools.", "view": 10}, {"title": "Donald Trump News Headlines - 9News", "body": "Latest Donald Trump news from the American White House, related global politics, Twitter rants and the latest scandals.", "view": 10}, {"title": "Donald Trump - IMDb", "body": "Donald Trump, Producer: The Apprentice. Donald John Trump was born on June 14, 1946 at the Jamaica Hospital Medical Center in Queens, New York City, ...", "view": 10}, {"title": "Donald Trump | The Times & The Sunday Times", "body": "Results 1 - 20 of 2892 — Donald Trump was the 45th president of the United States, from 2017 to 2021. He is the only US president to have been impeached twice.", "view": 10}, {"title": "Donald Trump – News, Research and Analysis - The ...", "body": "For much of the country's history, the Republican Party was the party of Lincoln and racial equality, and the Democratic Party backed Jim Crow laws and white ...", "view": 10}, {"title": "Donald Trump - Bloomberg Billionaires Index", "body": "Trump was the 45th president of the United States. He's also founder of the Trump Organization, a real estate conglomerate and licensing business that owns ...Biggest asset: Vornado PartnershipAge: 74", "view": 10}, {"title": "Donald Trump - National Geographic Kids", "body": "NAME: Donald John Trump · NICKNAME: The Donald · BORN: June 14, 1946, in Queens, New York · TIME IN OFFICE: January 20, 2017, to January 20, 2021 · VICE PRESIDENT: ...", "view": 10}, {"title": "Donald Trump's allies are going to make America great again ...", "body": "1 hour ago — President Donald Trump leaves after speaking during a Make America Great Again rally at Fayetteville Regional Airport on November 2, 2020, ...", "view": 10}, {"title": "Donald Trump Fast Facts | CNN Politics", "body": "Tir 11, 1400 AP — Read CNN's Donald Trump Fast Facts to learn more about the 45th president of the United States.", "view": 10}, {"title": "Donald Trump - South Florida Sun-Sentinel", "body": "It's not an unfamiliar frame for describing the rise of the new nationalism: There's a bad wind blowing through the West, and nothing less than democracy is ...", "view": 10}, {"title": "Donald Trump - News, Tips & Guides | Glamour", "body": "Donald Trump's administration derailed this initiative, which Barack Obama started while in office. By Christopher Rosa. Joe ...", "view": 10}, {"title": "Donald Trump - The Telegraph", "body": "US politics entering 'new era of Left wing power' led by fiery New York progressives. The 'Squad' of progressive Democratic representatives are holding up a ...", "view": 10}, {"title": "Stephanie Grisham says she is 'terrified' of a 2024 Donald ...", "body": "1 day ago — Former White House press secretary Stephanie Grisham, who worked for Donald Trump for more than five years, now says she fears another four ...", "view": 10}, {"title": "A Psychologist Analyzes Donald Trump's Personality - The ...", "body": "Khordad 26, 1395 AP — The Mind of Donald Trump. Narcissism, disagreeableness, grandiosity—a psychologist investigates how Trump's extraordinary personality might ...Education: New York Military Academy", "view": 10}, {"title": "Stephanie Grisham: Trump 'will be about revenge' if he wins in ...", "body": "20 hours ago — Ex-president's third press secretary says he will run again and presents a greater threat to democracy.", "view": 10}, {"title": "Donald J Trump - YouTube", "body": "This is the official YouTube Channel for Donald J. Trump.", "view": 10}, {"title": "Donald trump Latest News and Updates - Business Standard", "body": "Donald Trump. US trade chief seeks talks with China, won't rule out new tariff actions · Biden admin announces to revisit Trump-era trade agreement with ...", "view": 10}, {"title": "Donald Trump - latest news, breaking stories and comment", "body": "Latest London news, business, sport, showbiz and entertainment from the London Evening Standard.", "view": 10}, {"title": "Donald Trump - Impeachment, Presidency & Education", "body": "Billionaire real estate mogul and former reality television personality Donald Trump was the 45th president of the United States.Education: Fordham University, Wharton School ...Date of birth: June 14, 1946", "view": 10}, {"title": "Donald Trump - HuffPost", "body": "Catch up on the latest news on Donald Trump. Including photos, videos and tweets.Party: Republican Party", "view": 10}, {"title": "Donald Trump | US News", "body": "News You Can Use® from the states to the Capitol.", "view": 10}, {"title": "Donald Trump asks Florida judge to force Twitter to reinstate ...", "body": "3 days ago — The request follows the former president suing Twitter, Facebook and Google in July accusing them of censoring conservative voices.", "view": 10}, {"title": "Trump seeking to elevate Republicans who refuse to accept ...", "body": "1 day ago — Ex-president has endorsed Republican secretary of state candidates who would wield enormous power over elections.", "view": 10}, {"title": "Criminal inquiry into Trump's Georgia election interference ...", "body": "5 hours ago — The disgraced former president faces a range of possible charges – including conspiracy and election fraud.", "view": 10}, {"title": "Donald Trump sends a very clear message to Ron DeSantis", "body": "24 hours ago — Donald Trump may be waiting to announce his (seemingly inevitable) run for his old office in 2024 but he's already sending a warning shot at ...", "view": 10}, {"title": "Donald Trump ratchets up demands on Gov. Greg Abbott to ...", "body": "2 days ago — Former President Donald Trump is pressuring Texas Gov. Greg Abbott to allow a \"strong and real\" review of the election results in a state ...", "view": 10}, {"title": "Donald Trump - POLITICO Europe", "body": "Trump's former secretary of State played a key role in the deal with the Taliban. He says Biden botched it. Other Republicans aren't letting him off the ...", "view": 10}, {"title": "Is Donald Trump running for president again in 2024? Maybe.", "body": "18 hours ago — Donald Trump's campaign to convince you he might campaign for president in 2024 is itself a political play.", "view": 10}, {"title": "Donald Trump | Biography, Education, & Facts | Britannica", "body": "Mordad 26, 1400 AP — Donald Trump, 45th president of the United States (2017–21). Trump was also a real-estate developer and businessman who owned, managed, ...Political Affiliation: Republican PartyNotable Works: “Trump: The Art of the Deal”Born: June 14, 1946 (age 75) New York City N...", "view": 10}, {"title": "Fulton County, Georgia's Trump Investigation - Brookings ...", "body": "1 day ago — On Saturday, January 2, 2021, at around 3:00 p.m., former President Donald J. Trump placed a call to Georgia's Republican Secretary of State ...", "view": 10}, {"title": "Trump demands Pulitzer board rescind awards for Russia ...", "body": "22 hours ago — 2018 award was shared by New York Times and Washington Post for exposing interference and links between Trump and Moscow.", "view": 10}, {"title": "Trump wants court to force Twitter to reinstate his account - CNN", "body": "3 days ago — Former President Donald Trump has asked a federal judge to restore his Twitter account, according to a court document filed Friday.", "view": 10}, {"title": "Donald Trump - The New Yorker", "body": "Reporting and commentary on the Trump White House, by New Yorker writers and political columnists.", "view": 10}, {"title": "Donald Trump – The US Sun", "body": "Donald Trump was the 45th president of the United States. Before entering politics, he was a ... Trump lost the 2020 presidential election to Joe Biden.", "view": 10}, {"title": "Donald Trump has until December 23 to be deposed in an ex ...", "body": "15 hours ago — The former Apprentice contestant is suing the former US president for defamation, after he called her a \"liar\" when she accused him of ...", "view": 10}, {"title": "Donald Trump asks US judge to force Twitter to restart his ...", "body": "3 days ago — Mr Trump files a request for a preliminary injunction against Twitter in the US District Court for the Southern District of Florida, ...", "view": 10}, {"title": "Judge says Trump can be deposed in former 'Apprentice'", "body": "16 hours ago — A New York state judge on Monday gave former U.S. President Donald Trump a Dec. 23 deadline to undergo questioning in a defamation lawsuit ...", "view": 10}, {"title": "Donald J. Trump - FOX 5 Atlanta", "body": "A court has set a Dec. 23 deadline for former President Donald Trump to undergo questioning in a former \"Apprentice\" contestant's defamation lawsuit over what ...", "view": 10}, {"title": "Donald Trump - Orlando Sentinel", "body": "Tanto el gobernador de Florida, Ron DeSantis como los senadores republicanos Rick Scott y Marco Rubio se oponen a la idea de perforar las costas de Florida ...", "view": 10}, {"title": "Donald Trump: Biography, Tenure, Political Party ... - News18", "body": "Quick Facts. Born : 14th June 1946; Career: Entrepreneur, Politician. Donald John Trump is an American politician who was the 45th president of the United ...", "view": 10}, {"title": "Donald Trump Impeachment Trial News and Updates - Daily ...", "body": "Latest news on Donald Trump's impeachment trial - from MailOnline.", "view": 10}, {"title": "US maintains Donald Trump's hard line in trade dispute with ...", "body": "6:06US Trade Representative Katherine Tai on Monday announced that Washington will seek new trade talks with ...3 hours ago · Uploaded by DW News", "view": 10}, {"title": "Donald Trump - Haaretz Com", "body": "Former Prime Minister Benjamin Netanyahu (L), former U.S. President Donald Trump, and. Analysis |. A Year Into Normalization Deal, Israel's Hope for ...", "view": 10}, {"title": "Trump asks judge to force Twitter to reinstate his account - The ...", "body": "2 days ago — Company suspended former president's account in January following the attack on the US Capitol.", "view": 10}, {"title": "The Latest Donald Trump News - ITV", "body": "The former president has been joined by other plaintiffs in the lawsuit. 7 Jul. Donald Trump and Alan Weisselberg ...", "view": 10}, {"title": "Donald Trump 2020: Polls, news and on the issues - CNN", "body": "Bahman 2, 1399 AP — Donald Trump is the President of the United States and is a candidate in the 2020 US presidential election. Find out more about his bio and ...", "view": 10}, {"title": "Donald Trump is '99, 100 percent' likely to run for president in ...", "body": "Shahrivar 16, 1400 AP — The 2024 election is still 1155 days away -- I counted -- but, according to one senior aide to Donald Trump, the former president is ...", "view": 10}, {"title": "Donald Trump Latest News and Headlines - Yahoo", "body": "\"The View\" hosts Sunny Hostin and Ana Navarro discuss fallout after their false positive COVID tests were announced on-air. Yahoo TV ...", "view": 10}, {"title": "Presidential Approval Ratings -- Donald Trump - Gallup News", "body": "Do you approve or disapprove of the way Donald Trump is handling his job as president?", "view": 10}, {"title": "Donald Trump | PBS NewsHour", "body": "A Republican-backed review of the 2020 presidential election in Arizona's largest county ended Friday without producing proof to support former President Donald ...", "view": 10}, {"title": "Latest Donald Trump News, Designation, Education, Net ...", "body": "Donald Trump: Read Donald Trump latest updates. Donald Trump announcements, news, tweets, videos. Donald Trump net worth, education, asset value and more on ...", "view": 10}, {"title": "Trump on a 2024 GOP primary vs. Ron DeSantis: 'I'd beat him ...", "body": "2 days ago — Former President Donald Trump made a bold prediction about his ability to prevail in a Republican primary that could include Florida ...", "view": 10}, {"title": "Donald Trump desperately needs Twitter. But will he ever be ...", "body": "31 minutes ago — Trump has handled his social media exile with all the grace one would expect – and now he's pathetically grovelling for the chance to tweet.", "view": 10}, {"title": "Trump plans to sue to keep White House records on Capitol ...", "body": "6 days ago — Legal strategy could delay and possibly stymie efforts by House select committee into Capitol attacks to see key documents.", "view": 10}, {"title": "President Biden (@POTUS) | Twitter", "body": "The latest Tweets from President Biden (@POTUS). 46th President of the United States, husband to @FLOTUS, proud dad & pop. Tweets may be archived: ...", "view": 10}, {"title": "Donald Trump Jr. (@DonaldJTrumpJr) | Twitter", "body": "The latest Tweets from Donald Trump Jr. (@DonaldJTrumpJr). EVP of Development & Acquisitions The @Trump Organization, Father, Outdoorsman, In a past life ...", "view": 10}, {"title": "Donald Trump Falls Off The Forbes 400 For First Time In 25 ...", "body": "4 hours ago — The former president, who has long obsessed over where he ranks on the Forbes 400, is no longer rich enough to make the list.", "view": 10}, {"title": "Donald Trump Falls Off The List Of Richest Americans | Forbes", "body": "5:26Donald Trump is worth an estimated $2.5 billion, leaving him $400 million short of the cutoff to make this year ...3 hours ago · Uploaded by Forbes", "view": 10}, {"title": "Donald Trump | TheHill", "body": "The Hill is a top US political website, read by the White House and more lawmakers than any other site -- vital for policy, politics and election campaigns.", "view": 10}, {"title": "Will Trump run again … and win? - Al Jazeera", "body": "1 day ago — Former US President Donald Trump attends a rally in Perry, Georgia, US on September 25, 2021 [Reuters/Dustin Chambers].Party: Republican Party", "view": 10}, {"title": "Trump on Gov. DeSantis: I'd beat him in 2024 - CNN", "body": "1:04Former President Donald Trump says he would beat Gov. Ron DeSantis (R-FL) if the two decide to try for the ...1 day ago", "view": 10}, {"title": "Donald Trump Jr. - CNBC", "body": "Donald Trump, Jr. Businessman and President Donald Trump's oldest son. Latest. thumbnail · Indicted Trump exec Allen Weisselberg removed as officer of ...", "view": 10}, {"title": "Trump asks U.S. judge to force Twitter to restart his account", "body": "3 days ago — Trump filed a request for preliminary injunction against Twitter in the U.S. District Court for the Southern District of Florida.", "view": 10}, {"title": "Donald Trump presidential campaign, 2016 - Ballotpedia", "body": "That same year, Trump indicated some interest in seeking the Republican nomination for president but ultimately declined to run. Trump's candidacy for the ...", "view": 10}, {"title": "Endorsements by Donald Trump - Ballotpedia", "body": "Battleground primary endorsements are listed in the appropriate general election or special election section, in addition to the battleground primary section.", "view": 10}, {"title": "President Joe Biden - Home | Facebook", "body": "President Joe Biden. 9784458 likes · 676179 talking about this. 46th President of the United States, husband to @FLOTUS, proud father and grandfather....", "view": 10}, {"title": "Donald Trump Fast Facts | CNN Politics", "body": "Tir 11, 1400 AP — Read CNN's Donald Trump Fast Facts to learn more about the 45th president of the United States.", "view": 10}, {"title": "Stephanie Grisham: President Trump loved the chaos - CNN", "body": "4:40Former White House Press Secretary Stephanie Grisham went on \"Good Morning America\" to talk about her ...1 day ago", "view": 10}, {"title": "Latest & Breaking News on Donald Trump - Moneycontrol", "body": "Donald John Trump is the 45th President of the United States and is seeking re-election. He belongs to the Republican Party. Before joining politics, Trump ...", "view": 10}, {"title": "Donald Trump Faces Deadline For Questioning In Defamation ...", "body": "12 hours ago — The new deadline for Trump's deposition — a legal term for out-of-court, pretrial questioning under oath — comes as Summer Zervos' 2017 ...", "view": 10}, {"title": "Permanent suspension of @realDonaldTrump - Twitter Blog", "body": "Dey 19, 1399 AP — On January 8, 2021, President Donald J. Trump Tweeted: “The 75,000,000 great American Patriots who voted for me, AMERICA FIRST, ...", "view": 10}, {"title": "Donald Trump News, Trends, Reviews, & More | Mashable", "body": "Donald Trump is claiming his permanent ban from the private company's social media platform is illegal censorship. 4 minutes ago. By Jack Morse ...", "view": 10}, {"title": "Donald Trump - NPR", "body": "No information is available for this page.Learn why", "view": 10}, {"title": "Trump, talked out of announcing a 2024 bid for now, settles", "body": "1 day ago — The former president's advisers fear an early announcement would complicate his fundraising and other activities, but Trump is taking steps ...", "view": 10}, {"title": "Trump asks court to force Twitter to reinstate his account - The ...", "body": "3 days ago — Former President Donald Trump has requested a court make Twitter reinstate his account, in a court filing on Friday.", "view": 10}, {"title": "Full text: Donald Trump announces a presidential bid - The ...", "body": "Khordad 26, 1394 AP — It's coming from more than Mexico. It's coming from all over South and Latin America, and it's coming probably -- probably -- from the Middle ...", "view": 10}, {"title": "Donald Trump | Category | Fox Business", "body": "Donald Trump, a Republican, is the 45th president of the United States of America.", "view": 10}, {"title": "Donald Trump News", "body": "Zee News brings latest news from India and World on breaking news, today news headlines, politics, business, technology, bollywood, entertainment, ...", "view": 10}, {"title": "Latest News, Photos, Videos on Donald Trump - NDTV.COM", "body": "Former US President Donald Trump asked a federal judge in Florida to force Twitter to reinstate his account, Bloomberg News reported late on Friday.", "view": 10}, {"title": "Summary data for Donald Trump, 2016 cycle • OpenSecrets", "body": "This page highlights the fundraising details for the presidential campaign of Donald Trump for 2016. For more information, click through the page.", "view": 10}, {"title": "Judge says Trump can be deposed in former 'Apprentice'", "body": "16 hours ago — A New York state judge on Monday gave former U.S. President Donald Trump a Dec. 23 deadline to undergo questioning in a defamation lawsuit ...", "view": 10}, {"title": "Donald J. Trump: Books, Biography, Blog, Audiobooks, Kindle", "body": "President Donald J. Trump lays out his professional and personal worldview in this classic work—a firsthand account of the rise of America's foremost deal-maker ...", "view": 10}, {"title": "Donald Trump Jr - latest news, breaking stories and comment", "body": "The latest breaking news, comment and features from The Independent.", "view": 10}, {"title": "Trump White House Archive - National Archives |", "body": "This is historical material “frozen in time”. The website is no longer updated and links to external websites and some internal pages may not work.", "view": 10}, {"title": "Donald Trump - Fox 8", "body": "No information is available for this page.Learn why", "view": 10}, {"title": "Donald Trump Against the World - Project Syndicate", "body": "There is virtually no group of people or country that Donald Trump, the US Republican Party's presumptive presidential nominee, has not insulted or ...", "view": 10}, {"title": "Donald Trump 2020: Polls, news and on the issues - CNN", "body": "Bahman 2, 1399 AP — Donald Trump is the President of the United States and is a candidate in the 2020 US presidential election. Find out more about his bio and ...", "view": 10}, {"title": "Donald Trump | Latest news, features and comment | iNews", "body": "Latest Donald Trump coverage on inews.co.uk, with essential news, features and in-depth analysis on the US President.", "view": 10}, {"title": "Why Trump has a new super PAC with an unintentionally ...", "body": "2 hours ago — Rachel Maddow Show: Donald Trump super PAC Make America Great Again, Again! MAGA Pam Bondi Kimberly Guilfoyle Corey Lewandowski.", "view": 10}, {"title": "Donald Trump", "body": "John Kerry condemns Trump's 'appalling inability' to understand military sacrifice · Fmr. Obama Advisor: 'Trump is a fundamentally undemocratic president' ...", "view": 10}, {"title": "Donald Trump", "body": "All stories about Donald Trump. ... The 2022 Races That Could Determine if Trump Steals the Election in 2024. Jeremy Stahl. Oct 04, 2021 11:53 AM.", "view": 10}, {"title": "Cartoons on President Donald Trump | US News", "body": "Stay informed daily on the latest news and advice on COVID-19 from the editors at U.S. News & World Report. Sign Up. Sign in to manage your ...", "view": 10}, {"title": "Donald Trump asks US judge to force Twitter to restart his ...", "body": "3 days ago — Mr Trump files a request for a preliminary injunction against Twitter in the US District Court for the Southern District of Florida, ...", "view": 10}, {"title": "Donald Trump - Topic - ABC News", "body": "There are four massive problems confronting US President Joe Biden and Democrats. How the President and his trusted lieutenants navigate out of them will have ...", "view": 10}, {"title": "Donald Trump - The Indian Express", "body": "Donald Trump Latest breaking news, pictures, photos and Video News. Find Donald Trump news headlines, photos, videos, comments, blog posts and opinion at ...", "view": 10}, {"title": "Donald Trump - Nettavisen", "body": "Avslører: - Derfor havnet Donald Trump på sykehus ... Donald Trumps niese med stikk til familien: - Definitivt den dummeste av dem alle.", "view": 10}, {"title": "Donald Trump - CBS New York", "body": "Former President Donald Trump Visits NYPD, FDNY On 9/11He took pictures, answered questions and thanked them for their bravery that day.", "view": 10}, {"title": "'Election subversion:' Trump allies seek new ways to ...", "body": "1 day ago — Trump-style Republicans are pushing state laws that would make it easier to challenge elections - and perhaps overturn them.", "view": 10}, {"title": "Latest False Fact-checks on Donald Trump - | PolitiFact", "body": "PolitiFact is a fact-checking website that rates the accuracy of claims by elected officials and others on its Truth-O-Meter.", "view": 10}, {"title": "Donald Trump News - wionews.com", "body": "Donald Trump was the 45th President of the United States of America and was defeated by Joe Biden in the 2020 presidential election.", "view": 10}, {"title": "What is Donald Trump up to now? | The Week UK", "body": "Donald Trump's attorneys have filed a further lawsuit against Twitter to have his social media accounts reinstated. He was permanently banned from the ...Works written: Trump: The Art of the Deal", "view": 10}, {"title": "Donald Trump earns his highest favorability marks in any Iowa ...", "body": "1 day ago — The latest Des Moines Register/Mediacom Iowa Poll shows 53% of Iowans now have a favorable view of the former Republican president and 45% have ...", "view": 10}, {"title": "Latest Donald Trump News, Designation, Education, Net ...", "body": "Donald Trump: Read Donald Trump latest updates. Donald Trump announcements, news, tweets, videos. Donald Trump net worth, education, asset value and more on ...", "view": 10}, {"title": "Donald Trump Topic News and Features | British GQ", "body": "The latest Donald Trump Topic news and features. Explore GQ UK to find out more including articles on fashion, culture and lifestyle.", "view": 10}, {"title": "Donald Trump is '99, 100 percent' likely to run for president in ...", "body": "Shahrivar 16, 1400 AP — The 2024 election is still 1155 days away -- I counted -- but, according to one senior aide to Donald Trump, the former president is ...", "view": 10}, {"title": "Donald Trump Jr. Official Biography", "body": "Donald Trump Jr. is a best-selling author, the son of Donald J. Trump and the Executive Vice President of the Trump Organization.", "view": 10}, {"title": "Donald Trump Jr. - Executive Vice President - LinkedIn", "body": "New York, New York, United States · Executive Vice President · The Trump OrganizationView Donald Trump Jr.'s profile on LinkedIn, the world's largest professional community. Donald has 1 job listed on their profile. See the complete profile ...", "view": 10}, {"title": "The Democratic Civil War Has a Winner: Donald Trump", "body": "4 days ago — Biden's agenda is up against more than just the moderates-versus-progressives split.", "view": 10}, {"title": "Donald Trump Still Faces a Reckoning in New York - The New ...", "body": "6 days ago — Court documents and interviews indicate that the Manhattan District Attorney is accumulating evidence of pervasive tax fraud.", "view": 10}, {"title": "Donald Trump - HuffPost", "body": "Catch up on the latest news on Donald Trump. Including photos, videos and tweets.", "view": 10}, {"title": "Donald Trump - HuffPost", "body": "Hours after a bloody insurrection on Capitol Hill, Congress got back to work and certified President-elect Joe Biden's election victory. By. HuffPost Video ...", "view": 10}, {"title": "Donald Trump - HuffPost", "body": "\"Could you please step down and let our country heal?” tweeted Russell Moore, who heads the Southern Baptist Convention's public policy arm.", "view": 10}, {"title": "Trump News Mobile Web - W. Palm Beach, FL", "body": "Trump got the vaccine, so why won't he urge his followers? Trump Organization CFO sues over storm claim. Trump holds court — and grip on GOP — at Mar-a-Lago.", "view": 10}, {"title": "Donald Trump's Contract with the American Voter", "body": "What follows is my 100-day action plan to Make America Great Again. It is a contract between myself and the American voter — and begins with restoring.", "view": 10}, {"title": "Donald Trump | Dazed", "body": "MusicA$AP Rocky says Trump actually made his Swedish arrest 'a little worse' · TikTok · Science & TechJoe Biden officially reverses the TikTok ban ordered ...", "view": 10}, {"title": "Federal Register :: Executive Orders", "body": "Disposition Tables contain information about Presidential Documents beginning with those signed by William J. Clinton and are arranged according to ...", "view": 10}, {"title": "Donald Trump: TIME Person of the Year 2016", "body": "The starting point for his success, which can be measured with just tens of thousands of votes, was the most obvious recipe in politics. He identified the ...", "view": 10}, {"title": "A TIME Exclusive: Donald Trump After Hours", "body": "President Donald Trump spends his time after hours in the White House with a mix of cable television news, Twitter and more.", "view": 10}, {"title": "Donald Trump 2020 - Politico", "body": "Read the latest streaming news and analysis on Donald Trump and the 2020 Presidential Election. Follow today's top polls, candidates, primaries, fundraising ...", "view": 10}, {"title": "Former press secretary: Trump 'will be about revenge ... - Politico", "body": "1 day ago — Former White House press secretary Stephanie Grisham warned Monday that Donald Trump would be consumed by \"revenge\" and implement “pretty ...", "view": 10}, {"title": "Jan. 6 panel braces for collision with Trump - POLITICO", "body": "1 day ago — The Select Committee expects the former president to fight its probe into the attack on Capitol Hill. Former President Donald Trump speaks at a ...", "view": 10}, {"title": "Trump on prospect of facing DeSantis in 2024: 'I'd beat him'", "body": "2 days ago — Former President Donald Trump asserted in an interview excerpt published Sunday that should he formally enter the 2024 presidential race, ...", "view": 10}, {"title": "Donald Trump - NBC New York", "body": "Donald Trump · Trump Faces Deadline for Questioning in Defamation Suit · Biden Lifts Abortion Referral Ban on Family Planning Clinics · Supreme Court Begins ...", "view": 10}, {"title": "Mike Pence and Mitch McConnell have a Donald Trump ...", "body": "4 days ago — Michael D'Antonio writes that former Vice Preisdent Mike Pence and Senate Minority Leader Mitch McConnell have run into a problem for the ...", "view": 10}, {"title": "Donald Trump | World | Toronto Star", "body": "News and analysis on former U.S. President Donald Trump.", "view": 10}, {"title": "Trump on Gov. DeSantis: I'd beat him in 2024 - CNN", "body": "1:04Former President Donald Trump says he would beat Gov. Ron DeSantis (R-FL) if the two decide to try for the ...1 day ago", "view": 10}, {"title": "Donald Trump - The Denver Post", "body": "Subpoenas could shed light on how Jan. 6 rally came together. By Michelle R. Smith. October 1, 2021 at 3:03 p.m..", "view": 10}, {"title": "Presidential Approval Ratings -- Donald Trump - Gallup News", "body": "Do you approve or disapprove of the way Donald Trump is handling his job as president?", "view": 10}, {"title": "Donald J. Trump Presidential Library: Home", "body": "The Trump Presidential Library is part of the Presidential Libraries system administered by the National Archives and Records Administration, a federal agency.", "view": 10}, {"title": "Donald Trump asks US judge to force Twitter to restore his ...", "body": "8 hours ago — Trump's attorneys on Friday filed a motion in US District Court in Miami seeking a preliminary injunction against Twitter and its CEO, Jack ...", "view": 10}, {"title": "Donald Trump – The US Sun", "body": "Donald Trump was the 45th president of the United States. Before entering politics, he was a ... Trump lost the 2020 presidential election to Joe Biden.", "view": 10}, {"title": "Donald Trump | The Irish Times", "body": "US president Joe Biden on Friday urged his fellow Democrats in Congress to overcome divisions and back two massive spending Bills that account for muc(...).", "view": 10}, {"title": "Donald Trump's Former Press Secretary Stephanie Grisham On", "body": "23 hours ago — Stephanie Grisham, former White House press secretary under Donald Trump and chief of staff to then First Lady Melania Trump, began her book ...", "view": 10}, {"title": "Donald Trump: Presidency, Family, Education - HISTORY", "body": "Esfand 3, 1399 AP — Donald J. Trump was the 45th U.S. president. He was elected in November 2016 and served until January 2021. Previously, he was a real estate ...Education: Fordham University,Program: The ApprenticeDate of birth: June 14, 1946", "view": 10}, {"title": "Contact Us | The White House", "body": "Contact Us · ZIP/Postal Code * Required · What would you like to say? Required · Keep me posted with regular updates from the White House ...", "view": 10}, {"title": "Hive: Donald Trump News, In-Depth Articles, Photos & Videos", "body": "Donald Trump profile and collection of news, in-depth analysis, opinion articles, photos and videos from Vanity Fair.", "view": 10}, {"title": "Donald Trump Is Asking a Judge to Restore His Twitter Account", "body": "19 hours ago — During his final weeks in office, then-President Trump's verified Twitter account was permanently suspended following the deadly Jan.", "view": 10}, {"title": "Stephanie Grisham Regrets Serving in Donald Trump's White ...", "body": "18 hours ago — Former press secretary Stephanie Grisham admits she enabled the culture she wants to expose in her explosive tell-all, I'll Take Your ...", "view": 10}, {"title": "Inauguration of Donald Trump - Wikipedia", "body": "Ceremony[edit]. President Trump delivering his inauguration speech following his swearing-in ceremony. File: ...Date: January 20, 2017; 4 years agoLocation: United States Capitol, ‎Washington, ...‎Participants: Donald Trump; 45th President of t...‎Organized by: Joint Congressional Committee ...", "view": 10}, {"title": "Family of Donald Trump - Wikipedia", "body": "Donald Jr., Ivanka, and Eric are Trump's three eldest children, from his first marriage with Ivana Trump. Prior to the election, each of the siblings held the ...Parents: Fred Trump, Mary Anne MacLeodSiblings: Robert Trump, Maryanne Barry, Eliza...", "view": 10}, {"title": "Trump on a 2024 GOP primary vs. Ron DeSantis: 'I'd beat him ...", "body": "2 days ago — Former President Donald Trump made a bold prediction about his ability to prevail in a Republican primary that could include Florida ...", "view": 10}, {"title": "Donald Trump sues to get his Twitter account back | Engadget", "body": "3 days ago — The former president has filed suit under a controversial Florida law..", "view": 10}, {"title": "Donald Trump v. The United States by Michael S. Schmidt", "body": "NEW YORK TIMES BESTSELLER • With unparalleled reporting, a Pulitzer Prize–winning New York Times reporter chronicles the clash between a president...", "view": 10}, {"title": "Donald J. Trump - FOX 13 News", "body": "Former President Donald Trump wants a federal judge to force Twitter to restore his account, which was suspended in January following the deadly storming of ...", "view": 10}, {"title": "The story behind Trump's mysterious 2019 Walter Reed trip ...", "body": "1:29Former President Donald Trump's secret visit to Walter Reed in 2019 appeared to be for a routine colonoscopy ...7 days ago", "view": 10}, {"title": "Yet more evidence Donald Trump is running a shadow ...", "body": "5:58Former President Donald Trump continues to give his commentary on other U.S. presidents' handling of ...Shahrivar 23, 1400 AP · Uploaded by CNN", "view": 10}, {"title": "Donald Trump faces deadline for questioning in defamation suit", "body": "21 hours ago — US News: NEW YORK: Former US President Donald Trump now has a December 23 deadline to undergo questioning in a former \"Apprentice\" ...", "view": 10}, {"title": "Donald Trump's favorability ratings are his highest in any Iowa ...", "body": "23 hours ago — The latest Des Moines Register/Mediacom Iowa Poll shows 53% of Iowans now have a favorable view of the former Republican president and 45% have ...", "view": 10}, {"title": "Donald Trump Archives - FactCheck.org", "body": "Mike Rogers, the ranking Republican on the House Armed Services Committee, said congressional testimony this week showed that President Joe Biden ignored the ...", "view": 10}, {"title": "Donald Trump faces deadline for questioning in a former ...", "body": "18 hours ago — Former President Donald Trump now has a Dec. 23 deadline to undergo questioning in a former “Apprentice” contestant's defamation lawsuit.", "view": 10}, {"title": "Donald Trump Said That Nobody Has Done More for Religion ...", "body": "4 days ago — Donald Trump said Joe Biden was doing \"destructive\" things to religion in an interview with FlashPoint on The Victory Channel, a Christian ...", "view": 10}, {"title": "Sidney Powell is on Donald Trump's 'no-go list,' report says ...", "body": "4 days ago — Powell is an outcast in Trumpworld as she faces potential disbarment and a $1.3 billion defamation lawsuit. 10 Things in Politics: The latest in ...", "view": 10}, {"title": "Donald Trump asks US judge to force Twitter to restore his ...", "body": "8 hours ago — Trump's attorneys on Friday filed a motion in US District Court in Miami seeking a preliminary injunction against Twitter and its CEO, Jack ...", "view": 10}, {"title": "All things Trump - Los Angeles Times", "body": "The 45th President. (Chip Somodevilla / Getty Images). Donald Trump defeats Hillary Clinton and vows in his victory speech that America will 'no longer accept ...", "view": 10}, {"title": "Trump: 'I got the Pfizer' - Yahoo Finance", "body": "3 days ago — Former President Donald Trump discusses the COVID-19 pandemic with Yahoo Finance's Adam Shapiro and reveals for the first time he got the ...", "view": 10}, {"title": "Trump warns on 'scary' inflation, says surging prices will ...", "body": "1 day ago — \"It looks to me like inflation is going to ravage our country,\" former President Donald Trump told Yahoo Finance.", "view": 10}, {"title": "Trump, after adding trillions to the government's IOUs ...", "body": "1 day ago — Former President Donald Trump says our country has a debt problem and that the debt limit fight is \"a bad situation to be in.", "view": 10}, {"title": "Donald Trump's favorability ratings are his highest in any Iowa ...", "body": "23 hours ago — The latest Des Moines Register/Mediacom Iowa Poll shows 53% of Iowans now have a favorable view of the former Republican president and 45% have ...", "view": 10}, {"title": "The story behind Trump's mysterious 2019 Walter Reed trip ...", "body": "1:29Former President Donald Trump's secret visit to Walter Reed in 2019 appeared to be for a routine colonoscopy ...7 days ago", "view": 10}, {"title": "Yes, Donald Trump's final days in office were even worse than ...", "body": "Tir 22, 1400 AP — Donald Trump's final days as president were defined by near-total chaos as House Democrats moved to impeach him for his action (and ...", "view": 10}, {"title": "Donald Trump Archives - FactCheck.org", "body": "Mike Rogers, the ranking Republican on the House Armed Services Committee, said congressional testimony this week showed that President Joe Biden ignored the ...", "view": 10}, {"title": "Donald Trump faces deadline for questioning in defamation suit", "body": "21 hours ago — US News: NEW YORK: Former US President Donald Trump now has a December 23 deadline to undergo questioning in a former \"Apprentice\" ...", "view": 10}, {"title": "Donald Trump - HuffPost", "body": "For some Republicans, it's a performance. For others, Trump's false claims of election fraud are Gospel. By. Matt Fuller ...", "view": 10}, {"title": "Donald Trump - HuffPost", "body": "The Tampa Bay Buccaneers quarterback has “lived to regret\" his association with the former president, said the Fox Sports commentator. By. Lee Moran ...", "view": 10}, {"title": "Donald Trump - HuffPost", "body": "Catch up on the latest news on Donald Trump. ... The \"Late Show\" host debunked the GOP claim that Trump's impeachment trial is a waste of time.", "view": 10}, {"title": "Donald Trump dismisses Ron DeSantis' presidential chances", "body": "22 hours ago — Former U.S. President Donald Trump said Gov. Ron DeSantis would be no match for him in a potential 2024 matchup.", "view": 10}, {"title": "Donald Trump faces deadline for questioning in a former ...", "body": "18 hours ago — Former President Donald Trump now has a Dec. 23 deadline to undergo questioning in a former “Apprentice” contestant's defamation lawsuit.", "view": 10}, {"title": "Donald Trump popularity & fame | YouGov", "body": "Donald Trump is the 3rd most popular Republican and the 14th most popular politician. Explore the latest YouGov polling, survey results and articles about ...", "view": 10}, {"title": "New book: Aide played 'Cats' hit to calm Trump down - CNN", "body": "2:52A new book from former White House press secretary Stephanie Grisham says when then-President Donald ...3 days ago", "view": 10}, {"title": "Trump plans to sue to keep White House records on Capitol ...", "body": "6 days ago — Legal strategy could delay and possibly stymie efforts by House select committee into Capitol attacks to see key documents.", "view": 10}, {"title": "Stephanie Grisham: Trump turncoat who may be most ...", "body": "2 days ago — Former press secretary has decided to 'break her silence' but may find media less hospitable than to those who went before.", "view": 10}, {"title": "What's Donald Trump up to these days? I tried to find out via ...", "body": "Farvardin 22, 1400 AP — In the early days of his post-presidential life, Trump has crashed a wedding and welcomed maskless Mar-a-Lago guests.", "view": 10}, {"title": "Donald and Melania Trump 'unleashed' on Stephanie ...", "body": "16 hours ago — President Donald Trump berated then-White House press secretary Stephanie Grisham after she was unable to bring members of the press into a ...", "view": 10}, {"title": "Donald Trump told a Christian TV network that ... - Yahoo News", "body": "2 days ago — Donald Trump said Joe Biden was doing \"destructive\" things to religion in an interview with FlashPoint on The Victory Channel, a Christian ...", "view": 10}, {"title": "Trump faces deadline for questioning in defamation suit", "body": "2 days ago — NEW YORK (AP) — Former President Donald Trump now has a Dec. 23 deadline to undergo questioning in a former “Apprentice” contestant's ...", "view": 10}, {"title": "Trump sues niece, NY Times over records behind '18 tax story", "body": "Shahrivar 30, 1400 AP — NEW YORK (AP) — Former President Donald Trump on Tuesday sued his estranged niece and The New York Times over a 2018 story about his ...", "view": 10}, {"title": "Trump asks U.S. judge to force Twitter to restart his account", "body": "3 days ago — Trump filed a request for preliminary injunction against Twitter in the U.S. District Court for the Southern District of Florida.", "view": 10}, {"title": "Trump rally in Georgia may have bolstered legal case against ...", "body": "1 day ago — Donald Trump's scorched-earth rally in Georgia last month might have done more than deepen the factional divide in the state GOP.", "view": 10}, {"title": "Donald Trump Said That Nobody Has Done More for Religion ...", "body": "4 days ago — Donald Trump said Joe Biden was doing \"destructive\" things to religion in an interview with FlashPoint on The Victory Channel, a Christian ...", "view": 10}, {"title": "Donald Trump: Who He Is and What He Stands For - The New ...", "body": "Mehr 1, 1399 AP — The 45th president, a deeply divisive leader, was running for re-election on immigration, trade and the economy. Then the coronavirus crisis ...", "view": 10}, {"title": "Crossing the Line: How Donald Trump Behaved With Women ...", "body": "Ordibehesht 26, 1395 AP — Donald J. Trump had barely met Rowanne Brewer Lane when he asked her to change out of her clothes. Donald was having a pool party at ...", "view": 10}, {"title": "Trump Loses Case to Enforce Omarosa Manigault Newman's ...", "body": "7 days ago — Donald Trump had filed the case against Ms. Manigault Newman, a former White House aide and “Apprentice” star, after she wrote a tell-all ...", "view": 10}, {"title": "The absolute grossest example of the Trump-ing of the ... - CNN", "body": "3 days ago — When former President Donald Trump endorsed Harriet Hageman's primary challenge to Wyoming Rep. Liz Cheney last month, he called her \"strong ...", "view": 10}, {"title": "'I had no idea I was such a ham': Looking back on 'Donald ...", "body": "3 days ago — Australian journalist Jonathan Swan swears his stunned expressions during his Emmy-winning tussle with the former president weren't staged.", "view": 10}, {"title": "Donald Trump turned on Lindsey Graham. Of course. - YouTube", "body": "4:23Former President Donald Trump has stressed the importance of loyalty throughout his tenure in office, but ...7 days ago · Uploaded by CNN", "view": 10}, {"title": "How Melania Reacted To Stormy Daniels' Charges Against ...", "body": "4:54Former US First Lady Melania Trump's chief of staff has revealed insights into Donald Trump's marriage ...6 days ago · Uploaded by CRUX", "view": 10}, {"title": "How Popular Is Donald Trump? | FiveThirtyEight", "body": "Bahman 1, 1399 AP — FiveThirtyEight is tracking Donald Trump's approval ratings ... Our Trump approval rating polling averages are final and no longer updating.", "view": 10}, {"title": "Donald Trump | World | Toronto Star", "body": "News and analysis on former U.S. President Donald Trump.", "view": 10}, {"title": "Trump asks judge to force Twitter to restore his account - Politico", "body": "2 days ago — He was banned from the Jan. 6 Capitol riot. President Donald Trump at a coronavirus news conference.", "view": 10}, {"title": "Opinion | Donald Trump Is Doing His Comeback All Wrong", "body": "Shahrivar 18, 1400 AP — All but erased from public life, he is making a mistake by announcing a presidential run so early. Former U.S. President Donald Trump takes the ...", "view": 10}, {"title": "President Donald Trump - Politico", "body": "Latest news, headlines, analysis, photos and videos on President Donald Trump.", "view": 10}, {"title": "Donald Trump - The Japan Times", "body": "Comprehensive news coverage of the 45th U.S. president, Donald Trump.", "view": 10}, {"title": "Sidney Powell is on Donald Trump's 'no-go list,' report says ...", "body": "4 days ago — Powell is an outcast in Trumpworld as she faces potential disbarment and a $1.3 billion defamation lawsuit. 10 Things in Politics: The latest in ...", "view": 10}, {"title": "Trump to Give Deposition in Summer Zervos Lawsuit Before ...", "body": "21 hours ago — Summer Zervos' defamation lawsuit against Donald Trump was stalled during his presidency but is now moving forward.", "view": 10}, {"title": "Donald Trump - Time Magazine", "body": "Read the latest stories about Donald Trump on Time. ... Republicans Are Split Over Trump's Second Impeachment—and the Party's Future. By Molly Ball ...", "view": 10}, {"title": "Donald Trump Is on the 2021 TIME100 List - Time Magazine", "body": "Shahrivar 24, 1400 AP — Find out why Donald Trump is one of the 100 most influential people of 2021.", "view": 10}, {"title": "Marine who Trump brought on stage at rally draws scrutiny", "body": "3:09During a rally in Georgia, former President Donald Trump invited Lance Cpl. Hunter Clark to the stage where ...4 days ago", "view": 10}, {"title": "Donald Trump's appalling response to a new tell-all ... - CNN", "body": "6 days ago — Stephanie Grisham spent years at the side of the Trumps, serving as then-President Donald Trump's press secretary and as chief of staff for ...", "view": 10}, {"title": "Donald Trump files legal request to compel Twitter to restore ...", "body": "14 hours ago — Trump was banned in January after he made various tweets that have been linked to the US Capitol attack.", "view": 10}, {"title": "Five Ways Donald Trump Tried to Push a Coup - The Atlantic", "body": "Mehr 1, 1400 AP — Some of the plots to overturn the election happened in secret. But don't forget the ones that unfolded in the open.", "view": 10}, {"title": "The Many Scandals of Donald Trump: A Cheat Sheet - The ...", "body": "Bahman 4, 1395 AP — One of the women who accused Trump of sexual misconduct has sued him for defamation after he labeled her claims false.", "view": 10}, {"title": "Why Biden is keeping key parts of Trump's China trade policy", "body": "19 hours ago — Democrats blasted former President Donald Trump for launching a trade war with China. But President Biden's top trade official is vowing to ...", "view": 10}, {"title": "Trump sues niece and New York Times over tax story - BBC", "body": "Shahrivar 31, 1400 AP — A lawsuit accuses Mary Trump and reporters of an \"insidious plot\" to obtain confidential documents.", "view": 10}, {"title": "Donald Trump policies: Where does the president stand on key", "body": "Mehr 7, 1399 AP — Donald Trump won the 2016 US presidential election riding on one simple phrase: \"Make America Great Again\". As he seeks a second term, ...", "view": 10}, {"title": "IRS ordered to hand over Donald Trump tax returns to Congress", "body": "Mordad 8, 1400 AP — The ruling is a big legal blow to the ex-president, who has not publicly disclosed his tax returns.", "view": 10}, {"title": "Trump-fueled falsehoods have deep roots (opinion) - CNN", "body": "2 days ago — Former President Donald Trump spread more than 30000 falsehoods during his term, according to the Washington Post.", "view": 10}, {"title": "Donald Trump's laughably childish threat to Mike Pence - CNN", "body": "Shahrivar 24, 1400 AP — Donald Trump is, at root, just an overgrown kid. And not in any good way.", "view": 10}, {"title": "Donald Trump - Intelligencer - New York Magazine", "body": "Embattled Democrats Should Count Their BlessingsDemocrats may not leave the legacy their trifecta led them to expect. But it could have been far worse if 2020 ...", "view": 10}, {"title": "Donald Trump - New York Magazine", "body": "See an archive of all donald trump stories published on the New York Media network, which includes NYMag, The Cut, Vulture, and Grub Street.", "view": 10}, {"title": "Why is everyone saying Donald Trump is running in 2024?", "body": "5:06The countdown to when, not if, former President Donald Trump announces another run for president is on as ...Shahrivar 18, 1400 AP · Uploaded by CNN", "view": 10}, {"title": "Donald Trump - Research and data from the Pew Research ...", "body": "Results 1 - 10 of 205 — It looks at how new voters and voters who turned out in either 2016, 2018 or both voted in the 2020 presidential election, and offers a ...", "view": 10}, {"title": "Donald Trump Seeks Reinstatement of @realDonaldTrump on ...", "body": "19 hours ago — The former president filed a request for preliminary injunction against the social network in U.S. District Court.", "view": 10}, {"title": "Donald Trump's mental health becomes an issue again - CNN", "body": "Shahrivar 24, 1400 AP — Here's a fact you may have missed amid all of the coverage of the allegations and revelations in the new book by Bob Woodward and Robert ...", "view": 10}, {"title": "Donald Trump is 100% right about Stacey Abrams - CNN", "body": "Mehr 4, 1400 AP — This weekend, I found myself agreeing with something former President Donald Trump said at his rally in Georgia: Having Stacey Abrams as ...", "view": 10}, {"title": "Donald Trump pushes Greg Abbott on a forensic election audit", "body": "6 days ago — There has been no evidence of widespread election fraud in Texas, where Trump defeated President Joe Biden by 6 percentage points.", "view": 10}, {"title": "Trump asks judge to force Twitter to restore his account - Sky ...", "body": "3 days ago — A filing in the US District Court for the Southern District of Florida says Twitter allowed the Taliban to tweet frequently about its ...", "view": 10}, {"title": "Donald Trump: Secret action taken to prevent 'screaming ...", "body": "Shahrivar 24, 1400 AP — A senior official was so worried about the then leader's \"serious mental decline\" that he also contacted China to reassure his counterpart ...", "view": 10}, {"title": "Latest Donald Trump 2024 Polling as Former President ...", "body": "1 day ago — The former commander-in-chief remains influential in GOP politics, and has tipped himself to maintain support down the line should he choose ...", "view": 10}, {"title": "Gravitas: America's top general \"hid nukes\" from Donald Trump", "body": "4:12In the final days of the Trump Administration - America's top military commander General Mark Milley was ...Shahrivar 24, 1400 AP · Uploaded by WION", "view": 10}, {"title": "Summary data for Donald Trump, 2020 cycle • OpenSecrets", "body": "OrganizationPro/AgainstTypeTotal RaisedDonald J Trump for PresidentPro‑TrumpCampaign$773,954,550America First ActionPro‑TRUMPSuperPAC$150,128,473Preserve America PACPro‑TrumpSuperPAC$105,322,042View 38 more rows", "view": 10}, {"title": "Donald J. Trump - FOX 2 Detroit", "body": "The president accused the Republican Chair of the Oversight Committee and the Senate Majority leader of trying to \"hide the truth\" about the election. The ...", "view": 10}, {"title": "Donald Trump's 'Fall From Grace' Accelerates Following 'Peril ...", "body": "4:49Rev. Al Sharpton addresses the former president after men in his orbit were hit with a wave of subpoenas. Still ...Mehr 4, 1400 AP · Uploaded by MSNBC", "view": 10}, {"title": "Donald Trump: Last Week Tonight with John Oliver (HBO)", "body": "21:54Our main story was about Donald Trump. We can't believe we're saying that either.Connect with Last Week ...Esfand 10, 1394 AP · Uploaded by LastWeekTonight", "view": 10}, {"title": "Trump's former press secretary details his mysterious ... - CNN", "body": "7 days ago — Former President Donald Trump's secret visit to Walter Reed in 2019 appeared to be for a routine colonoscopy, according to Stephanie Grisham ...", "view": 10}, {"title": "What Liz Cheney gets exactly right about Donald Trump - CNN", "body": "Mehr 5, 1400 AP — No matter what you think of Wyoming Rep. Liz Cheney, she spoke a truth that her fellow Republicans need to hear on Sunday.", "view": 10}, {"title": "Yet more evidence Donald Trump is running a shadow ... - CNN", "body": "Shahrivar 18, 1400 AP — One benefit of never admitting you lost a presidential election -- even though, of course, you did -- is that you can just keep on acting ...", "view": 10}, {"title": "Stephanie Grisham: Donald and Melania Trump 'Unleashed ...", "body": "1 day ago — \"His eyes were fixed and filled with anger. His face had passed red and was turning almost purple,\" Grisham said of Trump in her book.", "view": 10}, {"title": "Donald Trump builds war chest of $102 million entering 2nd half", "body": "Mordad 10, 1400 AP — New disclosure reports filed Saturday night show that Donald Trump's affiliated political committees have a total of $102 million in cash on ...", "view": 10}, {"title": "Donald Trump turned on Lindsey Graham. Of course. - CNN", "body": "Mehr 1, 1400 AP — The one ironclad rule of friendship with Donald Trump is this: Eventually, he will turn on you.", "view": 10}, {"title": "Donald Trump sues niece Mary Trump, New York Times ...", "body": "Shahrivar 31, 1400 AP — Former President Donald Trump filed a lawsuit in New York state court Tuesday against his niece Mary Trump, as well as several New York ...", "view": 10}, {"title": "Donald J. Trump | C-SPAN.org", "body": "Watch the C-SPAN collection of videos, access clips including recent appearances by Donald J. Trump. View positions held along with a brief bio.", "view": 10}, {"title": "Liz Cheney on being a Republican while opposing Donald ...", "body": "Mehr 4, 1400 AP — Liz Cheney tells Lesley Stahl about running for re-election as an anti-Trump Republican in Wyoming, as her own party there has called for ...", "view": 10}, {"title": "Donald J. Trump - White House Historical Association", "body": "Donald John Trump was born in Queens, New York, on June 14, 1946. His father, Fred Trump was a successful real estate developer. Trump was educated at the ...", "view": 10}, {"title": "Trump Sues NYT and Niece—Who Calls Him 'F*cking Loser'", "body": "Shahrivar 31, 1400 AP — Former President Donald Trump has filed a lawsuit against The New York Times, three of its reporters, and his niece—claiming they hatched an ...", "view": 10}, {"title": "New bombshells show Trump's coup threat was real and hasn't", "body": "Shahrivar 31, 1400 AP — A rush of new and shocking behind-the-scenes disclosures about how then-President Donald Trump sought to thwart the Constitution and the ...", "view": 10}, {"title": "Donald Trump's main goal? Kill off the Republican ... - CNN", "body": "Shahrivar 29, 1400 AP — For all of Donald Trump's talk about the \"fake news\" media and supposedly socialist Democrats, his real focus since leaving office has been ...", "view": 10}, {"title": "Donald Trump turned on Lindsey Graham. Of course. - CNN", "body": "4:26Former President Donald Trump has stressed the importance of loyalty throughout his tenure in office, but ...7 days ago", "view": 10}, {"title": "The raging new Donald Trump campaign starts up where he ...", "body": "Shahrivar 18, 1400 AP — Michael D'Antonio writes that summer's over and Donald Trump's dark 2024 campaign has begun.", "view": 10}, {"title": "Mac Miller - Donald Trump - YouTube", "body": "3:20GO:OD AM Album Out NowDownload it here: https://smarturl.it/GOODAMRex Arrow Films, Rostrum Records ...Esfand 13, 1389 AP · Uploaded by Mac Miller", "view": 10}, {"title": "Donald Trump lashes out at top US military officer: 'I'm not into ...", "body": "Tir 24, 1400 AP — Broadside comes after joint chiefs chairman reportedly told aides he feared a 'Reichstag moment'", "view": 10}, {"title": "Donald Trump raises a $100m war chest | Financial Times", "body": "Mordad 10, 1400 AP — Former president has brought in more cash than anyone else in the Republican party ahead of midterm elections.", "view": 10}, {"title": "Donald Trump's false comments connecting Mexican ...", "body": "Tir 17, 1394 AP — They're bringing drugs. They're bringing crime. They're rapists. And some, I assume, are good people.” –Real estate mogul Donald Trump, ...", "view": 10}, {"title": "Donald Trump masqueraded as publicist to brag about himself", "body": "Ordibehesht 24, 1395 AP — The man on the phone vigorously defending Donald Trump says he's a media spokesman named John Miller, but then he says, “I'm sort of new ...Party: Republican Party", "view": 10}, {"title": "Is Donald Trump finished? - Mint", "body": "Shahrivar 18, 1400 AP — I warned you about the China lab leak possibility. I warned you about “defund the police,\" runaway urban crime, and the Democrats with their ...", "view": 10}, {"title": "Trump joins video platform Rumble ahead of Ohio rally | Reuters", "body": "Tir 5, 1400 AP — Former U.S. President Donald Trump joined video platform Rumble on Saturday, the same day he will take the stage at a campaign-style rally ...", "view": 10}, {"title": "Donald Trump takes a shot at Lindsey Graham - CNN Video", "body": "1:37According to the book \"Peril\", Sen. Lindsey Graham (R-SC) and Sen. Mike Lee (R-UT) reportedly questioned ...Mehr 1, 1400 AP", "view": 10}, {"title": "Trump is showing just how divisive a new White House ... - CNN", "body": "Shahrivar 22, 1400 AP — Only Donald Trump knows whether he will mount a run for the White House in 2024. But it's already clear what such a campaign would look like ...", "view": 10}, {"title": "What Mitch McConnell *really* thinks of Donald Trump - CNN", "body": "Shahrivar 31, 1400 AP — The Senate minority leader views the ex-president as a has-been who will fade from the limelight the further he -- and the public -- is removed ...", "view": 10}, {"title": "Paul Ryan was convinced Donald Trump had narcissistic ...", "body": "Shahrivar 25, 1400 AP — Paul Ryan knew that he had a problem. Donald Trump had been elected president and now Ryan, as the Republican Speaker of the House, ...", "view": 10}, {"title": "This retiring Republican just handed more power to Donald ...", "body": "Shahrivar 26, 1400 AP — Ohio Republican Rep. Anthony Gonzalez's retirement announcement made national headlines on Thursday night as he savaged former President ...", "view": 10}, {"title": "Donald Trump Asks 'Dedicated' Supporters To Pay To Carry ...", "body": "Mordad 14, 1400 AP — Donald Trump and the Save America PAC are asking the former president's supporters for consider carrying a so-called \"Trump Card\" to prove ...", "view": 10}, {"title": "Former US President Donald Trump slams top US ... - YouTube", "body": "2:31Former US President Donald Trump has slammed top US military officer, General Mark Milley, on the calls ...Shahrivar 28, 1400 AP · Uploaded by WION", "view": 10}]