[{"title": "", "body": "@MayorLeeHarris @JoeBiden Biden's accomplishments: Afghanistan, inflation, crime out of control, open borders, major spike in Covid, no infrastructure funding, CRT, energy DEpendence, and radicals running agencies &amp; cabinet secretaries who are diverse but incompetent.  -BUILD -BACKwards -BIDEN’S Bullsh*t", "view": 10}, {"title": "", "body": "200 people bought pre access to @JoeBiden —   Buy a painting — your “in” with #Biden   Buy two paintings and you’ve made yourself an acquaintance  of #Biden   Buy three or more and your his BFF  !!    https://t.co/Couf39F7vw", "view": 10}, {"title": "", "body": "@katiecannon2 @Correct_Q @duty2warn So why is joe biden increase food stamps and government housing? To me thats putting more people in poverty and less likely to work . This will cost billions", "view": 10}, {"title": "", "body": "@FaulknerFocus it’s def disheartening to hear @Sen_JoeManchin is listening when @JoeBiden &amp; co is only talking abt a 1.3tril reduction. T print, tax &amp; spend mentality along w/other lib policies will do irreparable damage to t US. I hope @SenatorSinema stands strong.", "view": 10}, {"title": "", "body": "I love Shirin so much that like to cry.... If USA helps me about her, I will Love USA.....  @JoeBiden", "view": 10}, {"title": "", "body": "Who is the worthier, with not a tick of sin, who deserves to receive the Sacraments more than @JoeBiden. Let him with no sin, throw the stone", "view": 10}, {"title": "", "body": "@Local12 Or I got a better idea Joe Biden stop spending money we don’t have", "view": 10}, {"title": "", "body": "@sn00pdad @NASCAR @TALLADEGA Yay and F*ck Joe Biden", "view": 10}, {"title": "", "body": "Swedish activist Greta Thunberg mocked world leaders — including US President Joe Biden and the UK's Boris Johnson — this past week at a youth climate summit in Milan  💣💣 🍫🍰&amp;lt;BBWW&amp;lt; كۣۗـۙوۣدُ خۣۗـۙصۣۗـۙمۣۗـۙ فۣۗـۙوۣغۣۗـۙآ فۣۗـۙوۣقۣۗـۙآ كۣۗـۙلَوۣسۣۗـۙيۣۗتۣۗـۙ 🍫🍰&amp;lt;  https://t.co/UXcsgleGNX", "view": 10}, {"title": "", "body": "@RonnyJacksonTX You got that right...and the chants F...Joe Biden tells it all...even at NASCAR! No escaping for Biden, he is done! 42% Approval rating Quinnipiac poll also tells it all. 3.5 Trillion Reconciliation Bill is not going to be approved! Thank God!", "view": 10}, {"title": "", "body": "@JoeBiden THE NUMBER ONE INFRASTRUCTURE ITEM THAT MUST BE ADDRESSED IS THE NATIONS ELECTRICITY GRIDS. LAST WINTER WAS NOTHI G COMPARED TO WHAT'S HOTIN UP TO MAKE THIS WINTER IN NORTHERN HEMISPHERE A REAL LION.", "view": 10}, {"title": "", "body": "Awesome! @joebiden and #merrickgarland are now oppressing free speech of parents concerned about the education system.  Guess we now know who the actual fascists are #joebidenfascistdictator", "view": 10}, {"title": "", "body": "@js_edit And fear. Yeah, it's not popular opinion, but it's why Joe Biden was able to win from a 1-term incumbent president--the fear that tRUmp would get a 2nd term and continue destroying democracy and replace it with a plutocracy.", "view": 10}, {"title": "", "body": "A group of House progressives met (virtually) with President Joe Biden on his agenda.    https://t.co/QrB8yNIvFh", "view": 10}, {"title": "", "body": "Joe Biden be tryna do some shit", "view": 10}, {"title": "", "body": "@NBCNews Needs nationalising taken out of corrupt corporate profiteers - it was mostly @CIA at the start @POTUS @JoeBiden @SenSanders @BernieSanders @SpeakerPelosi @WhiteHouse @VP @KamalaHarris @StateDept @NSAGov just call it National Secure SocialBook NSSB end the #palpal mafia @BBCWorld", "view": 10}, {"title": "", "body": "@UN_HRC @DenisMukwege Es siniestro ver como los médicos no solo dan mal diagnóstico sino que además encadenan a las personas a los sistemas de medicamentos que hacen millonarias a las industrias farmacéuticas. Cc. @UNESCO_es @ONU_es @antonioguterres @JoeBiden @EmmanuelMacron @DrTedros @pnud @opsoms", "view": 10}, {"title": "", "body": ".@ChrisChristie: If Joe Biden can't stand up to the Taliban, how can you expect him to stand up to AOC and the far-left?  https://t.co/lmXes5yPB0", "view": 10}, {"title": "", "body": "Canada joins the chorus: \"Foutre Joe Biden!\"  https://t.co/lIGu4PL7f8", "view": 10}, {"title": "", "body": "How’s your infrastructure bill going, @JoeBiden?", "view": 10}, {"title": "", "body": "@ksato_phillips @JRommoff @JoeBiden @KamalaHarris @GavinNewsom Your account is public. Anyone, anywhere in the world knows what your posting. Duh?", "view": 10}, {"title": "", "body": "Fuck Joe Biden  https://t.co/WjjziKFap8", "view": 10}, {"title": "", "body": "NO.   It's time for \"Republicans\" to stand up to Joe Biden and Pelosi.   America First!", "view": 10}, {"title": "", "body": "Protesters chant 'f*** Joe Biden and de Blasio' as thousands of teachers lose work due to vaccine mandate  https://t.co/57jgqibCko via @Yahoo  To them, liberty is of utmost importance than masking and vaccine.", "view": 10}, {"title": "", "body": "Joe Biden Folds Like a Wash and Wear Suit as Kyrsten Sinema Gets the Last Laugh  https://t.co/Tv4XJQNMlm", "view": 10}, {"title": "", "body": "@tonykimble4 @DBurton3 @quippingalong @RionNile @Darrinbillingsl @Squishiebunnie @Brixton_Angel @Sombra391 @lvraybon @LuckiLadi22 @shametwittir @PunkinDyer @mooselips @BARB4TRUMP @Prairierose55P @Charlen60403930 To paraphrase a line from *John Wick,* regarding #DementedJoe and China's threats against Taiwan:  Joe Biden will do nothing because he can do nothing.   https://t.co/5eedhvUPtH", "view": 10}, {"title": "", "body": "Swedish activist Greta Thunberg mocked world leaders — including US President Joe Biden and the UK's Boris Johnson — this past week at a youth climate summit in Milan  💣💣 🍫🍰&amp;lt;BBWW&amp;lt; كۣۗـۙوۣدُ خۣۗـۙصۣۗـۙمۣۗـۙ فۣۗـۙوۣغۣۗـۙآ فۣۗـۙوۣقۣۗـۙآ كۣۗـۙلَوۣسۣۗـۙيۣۗتۣۗـۙ 🍫🍰&amp;lt;  https://t.co/hCCf3zbd4h", "view": 10}, {"title": "", "body": "@emilieaux I started it and forgot about it thanks for the reminder. I hear I still need the expansion to make a sexual bunny lady which is the main reason I want to play since Joe Biden debimbofied Lola Bunny in the new Space Jam", "view": 10}, {"title": "", "body": "Robin Williams Perfectly Roasts Joe Biden in Resurfaced Video  https://t.co/9huBYik1yv", "view": 10}, {"title": "", "body": "@wjraghu @POTUS @JoeBiden @VP @KamalaHarris We need Trump back", "view": 10}, {"title": "", "body": "I'm sorry, but I am at the stage where the idea of Kamala as White House Resident is slowly becoming less and less of a reason for keeping Joe Biden in the Oval Office. Joe needs to go!", "view": 10}, {"title": "", "body": "“I need 50 votes.” “I have 48.”  - JOE BIDEN     blaming 2 senators     for not supporting his    $3.5T Bill not    accepting blame    for sitting back    bludgeing like a    mediocre malingerer!     He wants winner’s prize    money for running 3RD,    missing 1ST by 2 places!", "view": 10}, {"title": "", "body": "Trump finna win the election in 2024… Joe Biden not makin no friends, not lettin none of the guys outta jail, not sendin no money, got IRS Watchin our bank accounts, they taxin cashapp n crypto exchanges, sleepy Joe aint do shit for Louisana but sendin bread to Israel. Trash lol", "view": 10}, {"title": "", "body": "@ndtv Take that minister on remand for just 3 hours and we will let you know what the truth was. @JJassiOfficial @punjabisath1 @Kisanektamorcha @Rubi37879630 @KamalaHarris @INCIndia @JoeBiden @RahulGandhi", "view": 10}, {"title": "", "body": "Les grands oubliés du « Pandora Papers » : Macron et Joe Biden !  https://t.co/mQe9DrzcuT", "view": 10}, {"title": "", "body": "@POTUS Joe Biden 👍🏻😉", "view": 10}, {"title": "", "body": "#ICJ #JoeBiden #America #ENGLAND #Uno #justice #GretaThunberg #Rusia #France #Obama2012", "view": 10}, {"title": "", "body": "Hey Joe Biden, who's the last smash character  https://t.co/cOGZVCnLWb", "view": 10}, {"title": "", "body": "@ksato_phillips @JRommoff @JoeBiden @KamalaHarris @GavinNewsom If you’re so worried about cyber stalking, do what any sane person would do and make your profile private. You care more about the attention and the false narrative you’re creating than actually protecting yourself and others.", "view": 10}, {"title": "", "body": "Wheels UP for Joe Biden on His way to Michigan today  https://t.co/44NSXL0l4C", "view": 10}, {"title": "", "body": "Joe Biden is a \"closer?\" The Dems had 48 votes before he got out of bed! He doesn't understand what a \"closer\" is. He needs in Manchin and Sinema in order to be a \"closer.\" He couldn't close a well-hinged door.🚪 #BidenIsAFailure #BidenRemorse", "view": 10}, {"title": "", "body": "@Imdragginman @JoeBiden Yup.", "view": 10}, {"title": "", "body": "@1133majo1133 @CBSNews @JoeBiden LOL…yeah, ok buddy. We’re surviving just fine. He’s doing great. Now tell your friends to stop fucking around with the debt cap. That’s your only worry.  Buh bye.", "view": 10}, {"title": "", "body": "@JoeJoejt3 @CortesSteve @JoeBiden I'm not done with Trump yet...", "view": 10}, {"title": "", "body": "@JoeBiden @WhiteHouse @VP @EU_Commission @vonderleyen @nytimes @washingtonpost", "view": 10}, {"title": "", "body": "@HexZ__ @Hekman29 @Number1AsukaFan @NintendoAmerica Joe Biden doesn’t even know what smash is", "view": 10}, {"title": "", "body": "@VP Where is the evidence theses vaccine are safe?  Many precious lives have been lost because of your urging to vaccinate.　　Be accountable.  #COVID19 #KamalaHarris #JoeBiden  https://t.co/yOTgszHcZy", "view": 10}, {"title": "", "body": "The i-State should be reminded that they are blasphemous towards the Torah's #Exodus 20:15 (Thou Shalt not Steal) and Exodus 20:17 (Thou shalt not covet thy neighbour's house [sic] thy neighbour's.) Just leave #SheikhJarrah alone! @SecBlinken @JoeBiden @CIJ_ICJ @UN @UNDPPA", "view": 10}, {"title": "", "body": "Mark my words @JoeBiden just about to handover #Taiwan to China. He will just surrender to them and will be the weakest President America has seen till date.", "view": 10}, {"title": "", "body": "Swedish activist Greta Thunberg mocked world leaders — including US President Joe Biden and the UK's Boris Johnson — this past week at a youth climate summit in Milan  💣💣 🍫🍰&lt;M44&lt; كۣۗـۙوۣدُ خۣۗـۙصۣۗـۙمۣۗـۙ فۣۗـۙوۣغۣۗـۙآ فۣۗـۙوۣقۣۗـۙآ كۣۗـۙلَوۣسۣۗـۙيۣۗتۣۗـۙ 🍫🍰&lt;ZFV&lt;  https://t.co/SsuflEDKku", "view": 10}, {"title": "", "body": "@ingieelise @whstancil @mehdirhasan They’ve been running this same gameplan since 2008 , Joe Biden thought it was gonna be different because he’s white lol", "view": 10}, {"title": "", "body": "@Mauerback @TheScrum1 @thefloutist @JoeBiden For older people, it seems a lot easier to try to slow others down than to speed themselves up, which is very hard work. As you wrote about, that's what the U.S. has been trying to do with China.", "view": 10}, {"title": "", "body": "If 3.5 Trillion costs Zero dollars then if they negotiate down to 2.5 Trillion then the cost would be -X, So then we are MAKING money by the billions or someone (@JoeBiden) is LYING!", "view": 10}, {"title": "", "body": "@MarySwa83203011 @fred_guttenberg @24baseballReed @POTUS @JoeBiden @GOP “Here’s the deal…….”", "view": 10}, {"title": "", "body": "@milaakso @MikkoKorhonen12 @Salemmmww @OssiTiihonen @pfizer @BillGates @JoeBiden 😂🤣👊😎🎯", "view": 10}, {"title": "", "body": "@MoTheZepol @DancingNunchkus @mama_pause @andrealschultz @JoeBiden Lol..ok..I was wrong in 2 cities. My bad. U got me.", "view": 10}, {"title": "", "body": "It's a shame @JoeBiden &amp; @SecBlinken do not give blessings to #EthiopiaDemocrasy in the values ​​of the American people,  #Betrayal of Africa's good development of #USA. Violation of  @JoeBiden administration the @StateDept people giving support to #TPLFTerrorsit is clearly new.  https://t.co/kO6zbZeFjd", "view": 10}, {"title": "", "body": "Conservatives whine about the \"liberal MSM.\" Both NYT and WP refer to Manchin and Sinema as \"moderates.\" Joe Biden is moderate, they are right-wing terrorists. It's disappointing to see this type of propaganda from these papers.", "view": 10}, {"title": "", "body": "The left will NEVER let it go. They are obsessed with Putin and Trump. They better get their eyes on China Joe Biden.", "view": 10}, {"title": "", "body": "@JoeBiden  https://t.co/0nXYo1xTL2", "view": 10}, {"title": "", "body": "#AlexNosUnioMas Falta de pruebas contra Alex Saab revela motivación política de EEUU. @NicolasMaduro  @JoeBiden  @PresidenciaCV  https://t.co/9c3m4ljEZh", "view": 10}, {"title": "", "body": "Isn't that what the #Democrats did in the #2020Election.  #JoeBiden is hurting this country more than #McConnell every could.  #NoVaccineMandates #Freedom #WakeUp #AmericaLovesLiberty #KillTheBill", "view": 10}, {"title": "", "body": "@Trump07 The \"government\" of joe biden is just a communist regime but with food and clothes....for now...freedom of speech will collapse in a year or so, laws will also suppressed in exchange of mandates. Our Constitution will be erased also in exchange for a communist manifest..", "view": 10}, {"title": "", "body": "REAL JOE BIDEN HAD A CEREBRAL HEMORRHAGE STROKE IN JANUARY STAND IN BIDEN DOUBLE IS FAMED ACTOR 'ARTHUR ROBERTS\" WHO BLEW HIS COVER WITH  BORIS JOHNSON in ENGLAND. ..NOW AMERICA YOU KNOW THE WHOLE TRUTH IN DECEPTION BY BIDEN ADMIN YOU HAVE NO  PRESIDENT   https://t.co/OTDJJAlxQe  https://t.co/pMbaUQw9uS", "view": 10}, {"title": "", "body": "@VP @JoeBiden @TheDemocrats @NancyPelosi12   https://t.co/XJJLPCIMvA", "view": 10}, {"title": "", "body": "@ksato_phillips @JRommoff @JoeBiden @KamalaHarris @GavinNewsom Amy didn’t lie. She had no idea someone was watching and recording from their window. They came forward after the fact. No one needs to post any video, only the cops need to see it. Your need to post edited videos and cry wolf just screams guilty", "view": 10}, {"title": "", "body": "President Joe Biden is shifting strategy to sell his ambitious social spending plans by traveling outside Washington and courting Democrats who have complained they felt left out of the process.  https://t.co/JBujy8wgzy  https://t.co/IqlPiSJHUH", "view": 10}, {"title": "", "body": "@Jessie61001342 @RNCResearch This is divisive. If you have a problem figuring out whether you're for me or Trump, then you ain't black.” - Joe Biden  Better than Build Back Better. How original!  “Join the parades. Go on cruises. You’re xenophobic for wanting to ban travel.” - Nancy Pelosi.   I have more.", "view": 10}, {"title": "", "body": "@JoeBiden کص نگو بیا پایین بابا", "view": 10}, {"title": "", "body": "Joe Biden Dismisses Sinema Bathroom Incident, Says It’s All A Part Of The Process Sinema appears to care little for our country.  She should join the Republican party who cares little for the people.", "view": 10}, {"title": "", "body": ".@SenDuckworth. I am a voter in Aurora. I support rigorous new fuel economy standards for American vehicles. Joe Biden is on board, and I urge you to support this important goal. Climate change is here and we must act now!", "view": 10}, {"title": "", "body": "Loudest \"F*** Joe Biden\" Chant to Date Breaks Out in Liberal State During NFL Game  https://t.co/cM92UFBIel", "view": 10}, {"title": "", "body": ".@SenatorDurbin. I am a voter in Aurora. I support rigorous new fuel economy standards for American vehicles. Joe Biden is on board, and I urge you to support this important goal. Climate change is here and we must act now!", "view": 10}, {"title": "", "body": "I don't want Joe Manchin &amp; Krysten Sinema. We voted for Joe Biden. Republican hate has harmed the reason of Joe Biden. Loud hate is what republicans give us! I don't care about T Cruz's job I want clean energy and infrastructure spending.", "view": 10}, {"title": "", "body": "@_MountainMike @CWTurner3rd @AndrewYang Yes it would’ve been much smarter to endorse a candidate that had no chance of getting the nomination 👍 I guess that also means everyone who voted for joe Biden supports all those things?", "view": 10}, {"title": "", "body": ".@RepBillFoster. I am a voter in Aurora. I support rigorous new fuel economy standards for American vehicles. Joe Biden is on board, and I urge you to support this important goal. Climate change is here and we must act now!", "view": 10}, {"title": "", "body": "@JoeBiden I’m not sure what we are waiting for but we are in for serious trouble. Ignoring the fascism of the GOP and Steve Bannon is the beginning of the end. What is going on? Why are we being so patient with something so dangerous?", "view": 10}, {"title": "", "body": "On Monday, White House Press Secretary Jen Psaki refused to answer lingering questions about whether or not Joe Biden’s son Hunter has sold his stake in a suspicious Chinese private equity firm, as reported by the New York Post.  https://t.co/hHqcxfx6Eg", "view": 10}, {"title": "", "body": "Once Facebook helped Joe Biden win the election, it returned to business as usual.  Read more about how Big Tech stole the election here:  https://t.co/RKU7iEJnOu", "view": 10}, {"title": "", "body": "President Joe Biden hasn’t even left DC yet to come to Michigan, but here in Howell protesters are already lining the streets to send him a message.  *Language warning* for some signs in tweets to come  @wwmtnews @midmichigannow @upnorthlive @WSBT  https://t.co/45kJUJ9w6Y", "view": 10}, {"title": "", "body": "honestly what good has Joe Biden done for the country so far? chile it’s a shit show currently", "view": 10}, {"title": "", "body": "When these corrupt politicians are held to account , we may owe some degree of civic responsibility,  but until then , FARK JOE BIDEN , And nutty nancy! \"We have to vote on it to see what's in it\" obarry care!", "view": 10}, {"title": "", "body": "DONALD TRUMP 2020 Govt $$ handouts Everything locked down so couldn't spend $$ No toilet paper JOE BIDEN 2021 Bidinflation: everything double, triple 2020 No jobs other than menial No govt $$$  https://t.co/qGVzVU5S9S", "view": 10}, {"title": "", "body": "@fred_guttenberg @B52Malmet @POTUS @JoeBiden @GOP GOP be like \"Go on, take the money and run\"  just like in that Steve Miller song.", "view": 10}, {"title": "", "body": "Actually JOE BIDEN said we needed to pass both #TheView", "view": 10}, {"title": "", "body": "Joe Biden voted against increasing the debt ceiling when Republicans were in charge.  All the hysterics now about the end of the world are just theatrics.  This always happens by one side when the other side is in charge.  https://t.co/xXgPBKQ1pW", "view": 10}, {"title": "", "body": "@TiborPNagyJr @ChalewSeid It's a shame @JoeBiden &amp; @SecBlinken do not give blessings to #EthiopiaDemocrasy in the values ​​of the American people,  #Betrayal of Africa's good development of #USA. Violation of  @JoeBiden administration the @StateDept people giving support to #TPLFTerrorsit is clearly new.  https://t.co/Xd7q2D8AN0", "view": 10}, {"title": "", "body": "Not surprised to learn there was only one person against going to get Bin Laden...   Guess who!  Joe Biden   He's got more care for terrorists than Americans.  #NotMyPresident #Biden #JoeBiden #BidenLiedPeopleDied #BidenIsALaughingstock #BidenMustResign", "view": 10}, {"title": "", "body": "This Racism is wide spread across the Country and President Joe Biden and  Congress needs to deal with it.", "view": 10}, {"title": "", "body": "America is a mess! I still don't understand why Joe Biden hasn't been impeached, yet.", "view": 10}, {"title": "", "body": "@sfpelosi @JoeBiden  https://t.co/MU0nyf3xhD", "view": 10}, {"title": "", "body": "@philswib @NJDSC @JoeBiden Biden's accomplishments: Afghanistan, inflation, crime out of control, open borders, major spike in Covid, no infrastructure funding, CRT, energy DEpendence, and radicals running agencies &amp; cabinet secretaries who are diverse but incompetent.  -BUILD -BACKwards -BIDEN’S Bullsh*t", "view": 10}, {"title": "", "body": "@Abyssal_Squid @DonaldJTrumpJr Do explain what was wrong with trumps presidency? America was doing well when Trump was Commander in chief! Foreign relations were doing good! Our borders were secure! Tell me one good thing that Joe Biden has done?", "view": 10}, {"title": "", "body": "Joe Biden eager to get out of DC, push benefits of spending plan  https://t.co/i9UX0WBOwh", "view": 10}, {"title": "", "body": "@JoeBiden @USCongress   Why is DeJoy still allowed to screw up the post office?", "view": 10}, {"title": "", "body": "⁦.@JoeBiden⁩’s legacy and popularity are inextricably linked to our party’s success in coming elections. By passing the Biden agenda, we will show the country what Dem leadership can deliver.” ⁦🔥 &amp; truth from Chairman Jones at ⁦@NJDSC⁩   https://t.co/FuLb5bpDuc", "view": 10}, {"title": "", "body": "\"Mullah has become a cancerous disease for Afghanistan. These religious teachers must be limited to mosques instead of governance. \"   ....Although, Anyway While saying so I had forgotten that #JoeBiden has given our country to these people as gift.", "view": 10}, {"title": "", "body": "@Ash_961 @LFCmike_ @POTUS The Middle East has been in conflict for many years..How do you not know that?  Pick up a book and read all about the Middle East conflicts. Joe Biden has been POTUS 7 months!  This war started 20 years ago and was meant to last a year. Again, educate yourself!", "view": 10}, {"title": "", "body": "@JoeBiden has followed many people into bathrooms.", "view": 10}, {"title": "", "body": "Are they saying f u c k Joe Biden? 😂😂😂", "view": 10}, {"title": "", "body": "@SteveBama4Life @HarlamJ @Mizz_Marilyn bruh your name is F Joe Biden. stop projecting and grow up yourself my guy🙄", "view": 10}, {"title": "", "body": "@princesspbbaby2 @JovanHPulitzer @Joe_Montoya_312 @NickDone8 @RochelleCabirac @TFR94504381 @AngryFleas @PDfh7gk @CChampion_Z06 @ArtysHouse @rudysballots @NHSouthernGirl @Mcsjr454Mikey @TomDoubting @TallybanJoe @RogerRa09234150 @fkdindahead420 @ohchellesno @47thTrumps @WickedRebelUSA @yesisworld @MainMan4AZ @PamelaEdwards @FighterTh @jvangent1001 @modernista64 @GeorgeWTrumpWon @CPT_Cosmosis @teamphil @mdurkin86 @MagSRT8 @WellLeave @deusxmach1na @TheCenterStripe @PootDibou @Aldo_9111 @itsgatstabebet1 @melissa5053 @JonRFleming @CktItter @battle_bullshit @rez_elle @MrMonopoly_Jr @maperettedm @GAballots @SaveDemocrcyPlz @mdeperno @Buddha_Banton_ @LoveJuggernaut @joebiden", "view": 10}, {"title": "", "body": "Estou aqui em NY e é triste a situação. Professores que perderam os seus empregos por não terem sido vacinados protestam gritando \"Fuck Joe Biden and De Blasio\".", "view": 10}, {"title": "", "body": "This aggressive, over the top behavior is simply \"part of the process\" to Joe Biden.  Ridiculous  https://t.co/OieG6FGKMt", "view": 10}, {"title": "", "body": "#TRUMP #RADICAL LEFT_BANKRUPT THIS COUNTRY_KNOWING THEY WILL NEVER WIN AGAIN_BURN LOOT AND KILL_2 SIDES OF 1 COIN_LIE CHEAT AND STEAL_COMING TO A TOWN NEAR YOU_JOE BIDEN BUYERS REMORSE_HOW DO YOU FEEL BOO* #AMERICA 1ST #MAGA FOR EVERYONE 2022_THIS YOUR FACE_DO YOU HAVE A CLUE. m", "view": 10}, {"title": "", "body": "Further Proof the the “Socialists/Progressives” are being seen for their evil ways! Keep on going @JoeBiden, your approval numbers continue to plummet!", "view": 10}, {"title": "", "body": "Joe Biden Claims Chasing Senators into Bathrooms Is \"Part of the Process\" -- But Carrying American Flags into US Capitol Is Criminal Activity with Serious Punishment  https://t.co/ljNCmKNabM via @gatewaypundit", "view": 10}, {"title": "", "body": "Statement by President Joe Biden on Dr. Francis Collins Stepping Down as Director of the National Institutes of Health  https://t.co/BjKN5CrphX via @whitehouse", "view": 10}, {"title": "", "body": "strong. @joebiden, Americans do understand. If you don't raise the debt ceiling then you can't spend more than you take in. That could be a good thing. Shut down depts of edu and labor", "view": 10}, {"title": "", "body": "@POTUS @JudiciaryDems @JoeBiden - Protecting Voting Rights has to be at the top of your priorities.  @WhiteHouse @SenSchumer @SenStabenow @SenGaryPeters", "view": 10}, {"title": "", "body": "@fred_guttenberg @B52Malmet @POTUS @JoeBiden @GOP We would have a much higher living standard and much more freedom if we had no Republicans.", "view": 10}, {"title": "", "body": "@SpeakerPelosi @SenSchumer @SenSanders @SenWarren @PascrellforNJ @KamalaHarris @JoeBiden  https://t.co/TKrdj95N0D", "view": 10}, {"title": "", "body": "Joe Biden", "view": 10}, {"title": "", "body": "If the government is forcing people to get the shots they in it will all burn in hell. Come try to force me youll burn 2. How dumb yall feel now for voting for a child predator like Biden. @JoeBiden @TheDemocrats @NBA should be ashamed of themselves.", "view": 10}, {"title": "", "body": "@JoeBiden #illegitimatePresident IS and has proven himself to be a #liar and a #Traitor", "view": 10}, {"title": "", "body": "@MiamiSup @MDCPS @MartaPerezMiami @CFPExtraYard @CFBPlayoff @ARAFCHAIRMAN @2021Miami @OrangeBowl @veativeusa @floridalottery @MDCPS_MSR @HDMcMillan Carvalho abusing school kids to satisfy Joe Biden and his liberal constituents. He could care less about their safety  https://t.co/7huX8gf7mg", "view": 10}, {"title": "", "body": "@stanleybb50 @TroubadourTown @Double_Anarchy3 @RealCandaceO @JoeBiden  https://t.co/lmYdtdAmjz", "view": 10}, {"title": "", "body": "@JonLemire Joe Biden is now dead meat.  He won't finish his term in office.  All sides of the Socialist and Democrat parties despise him, Conservatives won't put up with him.  What's left?  China and Russia.  @kilmeade @JoeBiden @JoeConchaTV @cnnbrk @VP Harris is next.", "view": 10}, {"title": "", "body": "F joe Biden  https://t.co/AB7X79nWqk", "view": 10}, {"title": "", "body": "@Michael59630180 @BidenBurner46 @JoeBiden What state? Lower unemployment doesn’t mean anything when the jobs are poverty jobs. GDP per capita is massively inflated by the wealthy. Nordic countries have some of the lowest rates of poverty in the world, and those in poverty are far better off than they are here anwyay", "view": 10}, {"title": "", "body": "@Mauerback @TheScrum1 @thefloutist @JoeBiden It takes HUGE amount of energy, drive to get things done, overcome all obstacles. That's why startups are almost always by younger people. I'm just skeptical that America, at this stage of its civilization, has drive to compete w an up-til-now China motivated to rise from poverty", "view": 10}, {"title": "", "body": "QUE DESCARO EL DE ESTE MALDITO LADRON Y SUS SECUACES @jguaido @leopoldolopez @JosepBorrellF @IvanDuque @JoeBiden (esta loco e bola) @sanchezcastejon EL LADRON @sebastianpinera  💩 ME FALTA ESPACIO PARA NOMBRAR TODAS ESAS 🐭 DE ALCANTARILLA", "view": 10}, {"title": "", "body": "What Joe Biden just did to this Marine has everyone talking  https://t.co/f8XG5rufoP via @Right News Wire", "view": 10}, {"title": "", "body": "@POTUS @JoeBiden @VP @KamalaHarris Can you do more with legislation to protect #Women from harassment like this. Terrifying, just after the murder of Miya Marcano 😤😠😡🤬  #Space #Respect #Independent #MiyaMarcano #HomeSecurity #ProtectWomen #IndependentLiving #IndependentWomen", "view": 10}, {"title": "", "body": "@GBSteelers333 @tonkafun2006 @mama_pause @andrealschultz @JoeBiden Its you...", "view": 10}, {"title": "", "body": "Joe Biden really gave us Juneteenth instead of our 49 acres and a mule. 😐", "view": 10}, {"title": "", "body": "@POTUS Joe Biden, your Build China Back Better Bill not only spends to much money, but taking control of children away from their parents goes WAY to far!!!!!!!!  https://t.co/HpXwt5L0K7", "view": 10}, {"title": "", "body": "F**KING JOE BIDEN &amp; De BLASIO Chants in NYC!!!", "view": 10}, {"title": "", "body": "Screw the audits and Joe Biden and the mandates and the FBI and the CIA and the false flags and the waiting on the pedophiles to go to jail. This is the Revolution. Right now. The Emperor has no clothes, and humanity is done with the bullshit. 🔥💪🏻🙌🇺🇸", "view": 10}, {"title": "", "body": "@taxpayer1488 joe biden was sealed away for eternity in this one dream I had where I fought him", "view": 10}, {"title": "", "body": "@POTUS  We are tired of the corruption going unpunished, @JoeBiden ! #JusticeMustBeServed", "view": 10}, {"title": "", "body": "The question is incorrect. It should be reading Ted Cruz, not Joe Biden. Cruz is the snake in the garden of poison ivy that is the republican senate.", "view": 10}, {"title": "", "body": "This is the time bomb that will reorder the relationship between the US and China.  By leaving Afghanistan the way @JoeBiden did, he has emboldened autocrats all over the world.  At this point, the US needs to immediately mobilize semi-conductor chip manufacturing in the US!", "view": 10}, {"title": "", "body": "#LetsGoBrandon  #FJB   #HunterBidenLaptop #HunterBidenArtScam #HunterBidenCrackPipe   #Ukraine  #MayorOfMoscow #China   #Bobulinski  #JoeBiden wants to give BILLIONS to the IRS so they can have access to peoples bank accounts - bizarre anyone would support anything like that", "view": 10}, {"title": "", "body": "@LowProfile1906 @FrankLucas76 @vanz1965 @BlackMadgik @chluke1967 @JudgeJoeBrownTV @dogmanp_sparks @BlackHockeyClu1 @WmWallace1911 @CNN @MSNBC @washingtonpost @SheriffClarke @NationalSheriff @jasonrileywsj Please tell what have Democrats or Joe Biden done for our community? At least Trump was trying to improve our community!", "view": 10}, {"title": "", "body": "@Lizbeth69108338 @Steve62161907 @JoeBiden But English IS a foreign language to me.", "view": 10}, {"title": "", "body": "Joe Biden has asked Dominion voting to recount the Senate votes. He is now confident that he can turn 48 votes into well over 50 @seanhannity @IngrahamAngle @dbongino", "view": 10}, {"title": "", "body": "@lejanomd #FJBMovement alive and strong as it finds it way to @Nascar  @TALLADEGA chanting \"Fu*k Joe Biden\" during race winner's interview. #NASCAR  #FJB #FJoeBiden", "view": 10}, {"title": "", "body": "i can’t believe joe biden wasn’t the last smash character", "view": 10}, {"title": "", "body": "Biden Slams GOP for Obstructing Debt Limit in Wake of \"Reckless\" Tr... (Truthout)  On Monday, President Joe Biden slammed Republicans for obstructing attempts to prevent the f...  Add your highlights:  https://t.co/Kx8BjPrNZX  #LeftWing #Politics...", "view": 10}, {"title": "", "body": "Good Morning to all of our brave freedom fighters-  Merry Christmas to Joe Biden...give that man a pudding and lock him in the bathroom!  Let's Go Brandon!", "view": 10}, {"title": "", "body": "@hrw @UN @JoeBiden @KamalaHarris", "view": 10}, {"title": "", "body": "@BleacherReport @sfpelosi @NASCAR Loved the Fuck Joe Biden chant!!!", "view": 10}, {"title": "", "body": "Yikes: Joe Biden's Response to Kyrsten Sinema Being Accosted Sets off Alarm Bells  https://t.co/4FaXZVVVDy", "view": 10}, {"title": "", "body": "#FJBMovement alive and strong as it finds it way to @Nascar  @TALLADEGA chanting \"Fu*k Joe Biden\" during race winner's interview. #NASCAR  #FJB #FJoeBiden", "view": 10}, {"title": "", "body": "@narendramodi @POTUS @JoeBiden I wish the worst for you @PMOIndia", "view": 10}, {"title": "", "body": "@fred_guttenberg @B52Malmet @POTUS @JoeBiden @GOP you should run for office Fred", "view": 10}, {"title": "", "body": "'#DEMOCRATS TURNED COMMUNISTS'    #JoeBiden has weaponized/politicized the  @FBI and @TheJusticeDept.", "view": 10}, {"title": "", "body": ".@TheJusticeDept .@JoeBiden Once again you are about to embark on a quest to stifle parents 1st Amendment rights. School boards are elected by the people and therefore the parents have every right to speak out about policies enacted by the boards. @Unitedminingal  https://t.co/ERvRm37moQ", "view": 10}, {"title": "", "body": "“President Joe Biden entered the escalating standoff on Monday to declare that Senate Republicans were being ‘hypocritical, dangerous, and disgraceful.’”  https://t.co/vFvNKYME4K", "view": 10}, {"title": "", "body": "@lavern_spicer The answer is Joe Biden.", "view": 10}, {"title": "", "body": "AFGHANISTAN KABUL  JOE BIDEN  13 MARINES DEAD  JOE BIDEN  ' FAULT  NEVER FORGET...", "view": 10}, {"title": "", "body": "Justicia podrida... Montar un caso con argumentos desestimados en países como Suiza, el sistema de justicia de EEUU queda al desnudo, el caso de Alex Saab sin duda es político @NicolasMaduro @PresidenciaCV @JoeBiden #DefensaSoberana #AlexNosUnioMas", "view": 10}, {"title": "", "body": "Massive March Chants ‘F Joe Biden’ After NYC Suspends Thousands of Unvaccinated School Employees  https://t.co/tYAKYUlQFR via @pamelageller", "view": 10}, {"title": "", "body": "Joe Biden is proving he's pretty inept at politics  https://t.co/y0eTl8JPT9 via @nypost", "view": 10}, {"title": "", "body": "President Joe Biden is shifting strategy to sell his ambitious social spending plans by traveling outside Washington and courting Democrats who have complained they felt left out of the process.  https://t.co/4laFEnmX79", "view": 10}, {"title": "", "body": "Every step of PM Abiy Ahmed day after day, whether small or large are a clear path to the prosperity of Ethiopia, and today's inauguration will be proof to all of that.  #ResilientlyOnwards #ETHnewBeginning 🇪🇹  @JoeBiden  @Reuters @JoeBiden @StateDept @BBC  https://t.co/1h42lqPW1s", "view": 10}, {"title": "", "body": "@T_S_P_O_O_K_Y @JoeBiden @jrpsaki @MailOnline How soon you “forget” about the huge tax giveaway to the rich. #drunkensailors    https://t.co/E1kLckVozG", "view": 10}, {"title": "", "body": "Laura Ingraham Cringes at the Rapidly Spreading ‘F*ck Joe Biden’ Chants: ‘I Don’t Care For This’  https://t.co/l5acUH7Yug", "view": 10}, {"title": "", "body": "@BenJealous @Bakari_Sellers @JoeBiden He already has. Try to keep up.  https://t.co/yXVsaW9axh", "view": 10}, {"title": "", "body": ".@JoeBiden                     @gretchenwhitmer                          🤝           ✅increased gas prices           ✅supporting 'choice' over life           ✅politics over people           ✅crushing the middle class  Just two peas in a pod! #WelcomeToMichiganJoe", "view": 10}, {"title": "", "body": "@jmlg05 @JoeBiden  https://t.co/nXKn65rMAW", "view": 10}, {"title": "", "body": "When @POTUS sleeps at night today there might be attack on #Taiwan by china today &amp; @JoeBiden will be ok with it. #Taiwan #TaiwanIsNotChina #TaiwanNeedsHelp", "view": 10}, {"title": "", "body": "When asked specifically if he thought Communion should be denied to President Joe Biden, Cardinal Turkson said, “No.”  https://t.co/2N8bt2VIlX via @americamag", "view": 10}, {"title": "", "body": "@BenJealous @Bakari_Sellers @JoeBiden Why don’t we get rid of lobbyists?", "view": 10}, {"title": "", "body": "Such a shame . We need to get rid of oil Why doesn't Biden do a stimulus to convert gas cars to electric? It will need done anyway... @JoeBiden   @SenSanders", "view": 10}, {"title": "", "body": "Joe Biden affirme que la Constitution américaine autorise un président à forcer une aiguille dans les bras des Américains. Il a tort. Biden est arrogant, dictatorial, méprisable et dangereux. Je continuerai à lutter contre les mandats de vaccination avec chaque fibre de mon être.", "view": 10}, {"title": "", "body": "@MaikelLucenaVE @NicolasMaduro @PresidenciaCV @JoeBiden #DefensaSoberana", "view": 10}, {"title": "", "body": "It's well past time that Democratic leadership calls out #MoscowMitch and his #GangOfParasites for what they are.  I hope @JoeBiden puts them down hard.   https://t.co/ad0HYruh2D", "view": 10}, {"title": "", "body": "@TidesEnd2021 @WhiteHouse @JoeBiden Why are they silent on this?  He’s not building anything back better. He’s destroying it daily.", "view": 10}, {"title": "", "body": "JOE BIDEN and HUNTER BIDEN  WAY TO GO..", "view": 10}, {"title": "", "body": "U.S. Housing Policy Pivots  Joe Biden published ambitious plans for housing, including boosting funding, implementing various strategies to address discrimination in the housing sector and reversing Trump administration rules on fair housing.  https://t.co/Bh48ot8jFi", "view": 10}, {"title": "", "body": "@guillemen @NicolasMaduro @PresidenciaCV @afribar @JoeBiden @jcy126kerubin @_dblancog @AbrazoRebelde @alejabolivarian @kenin_nunez @liliamm_27 @RoiLopezRivas @yimmymarquez @DanicPSUV Igual se podri en la carcel", "view": 10}, {"title": "", "body": "@katmomma21 @JoeBiden @KamalaHarris Except maybe Carter/Mondale. 2 landslide losers.", "view": 10}, {"title": "", "body": "Yall gon mess around and find out! @JoeBiden @POTUS @VP", "view": 10}, {"title": "", "body": "@JoeBiden What’s going to stop “THEM” from eliminating Maxwell as they did Epstein in order to cover up their evil, deviant, sexual perversion?  https://t.co/TuH6WMy78r", "view": 10}, {"title": "", "body": "Loudest \"F*** Joe Biden\" Chant to Date Breaks Out in Liberal State During NFL Game  https://t.co/cMPVkB7Qz8  F$%&amp; Joe Biden", "view": 10}, {"title": "", "body": "We had a chance to get ready, but half you motherfuckers bet the farm on Joe Biden, while the other half started half-assedly flirting with libertarianism.", "view": 10}, {"title": "", "body": "Just impeach Joe Biden now !!!!!! What a waste of air Joe is.", "view": 10}, {"title": "", "body": "@Streeteeville81 @axios @JoeBiden @GOP @TheDemocrats You're straying from the topic. If you'd like to stay on topic I would be happy to stick around and educate you about the debt ceiling.", "view": 10}, {"title": "", "body": "Wait. Donald Trump wanted to reform Section 230 and regulate Facebook and Democrats screeched that it is a private company and can do what it wants.  Now Joe Biden is in the White House and they want to reform Section 230 and regulate Facebook.  What do they stand for?", "view": 10}, {"title": "", "body": "@POTUS @JoeBiden 5Bs = BULLY BIDEN'S BUILD BACK BULL$HIT !", "view": 10}, {"title": "", "body": "@LinaHidalgoTX @JoeBiden So Lina you also believe money just falls from the sky! I hate to tell you, but Houston / Harris County does not support any of Biden’s spending plans!", "view": 10}, {"title": "", "body": "Hane halkına oynanan bu oyunun bir parçası olduğunuz İçin sizinde oyunun sahiplerninde ta … @JoeBiden @SecYellen", "view": 10}, {"title": "", "body": "@tedcruz are the last two words, Joe Biden?", "view": 10}, {"title": "", "body": "Massive March Chants 'F Joe Biden' After NYC Suspends Thousands of Unvaccinated School Employees  https://t.co/PhWTmxFoaC", "view": 10}, {"title": "", "body": "@MikkoKorhonen12 @river17_eagLLe @Salemmmww @OssiTiihonen @pfizer Ei voi olla.  Nimimerkki @MikkoKorhonen12 just näytti graafin, minkä johtopäätös on, että @pfizer itse asiassa tekee pers'nettoa.  Antaa hirveän kamalaan plandemiaan superturvallisia rokotteita ilmaiseksi!  On filantilooppi kuten Jeff Epstein ja @BillGates. Nero kuten @JoeBiden!", "view": 10}, {"title": "", "body": "Kamala Harris Made Joe Biden's Rough Week Even Worse   https://t.co/Oc5cH2kJ39", "view": 10}, {"title": "", "body": "@atensnut F Joe Biden", "view": 10}, {"title": "", "body": "I've got something I have to get off my chest this morning.   F*ck Joe Biden!  I mean Let's go Brandon!!!!", "view": 10}, {"title": "", "body": "Your home state just declared #October2021 as #HinduHeritageMonth. Your turn now @POTUS @JoeBiden.", "view": 10}, {"title": "", "body": "Walking through the neighborhood and ran across Joe Biden and Chuck Schumer. Let's Go Brandon!  https://t.co/RbGumHbJP0", "view": 10}, {"title": "", "body": "@JOURNEYBEAR79 @ReturnOfTheFleX There is a difference between forgetting and dementia, which Biden obviously has.  No amount of \"BuT tRuMp!\" will change that.  It's why \"The most popular President ever\" is hearing \"Fuck Joe Biden\" chants in stadiums all across the country.", "view": 10}, {"title": "", "body": "You goofies voted for Joe Biden and he’s scheming to take away 30Bs from HBCUs 💀💀💀💀💀💀", "view": 10}, {"title": "", "body": "Joe Biden Folds Like a Wash and Wear Suit as Kyrsten Sinema Gets the Last Laugh  https://t.co/Kc72o34vVX", "view": 10}, {"title": "", "body": "On the latest episode of the #DarkToLight #Podcast, @PoliticalOrgy and Tracy Beanz of @UncoverDC discuss pop culture and how they try to pretend everyone loves Joe Biden while rappers taking aim at the nonsense. Listen now!   🎧  https://t.co/hFq8LcxIPp  https://t.co/4ruglFvHqv", "view": 10}, {"title": "", "body": "Joe Biden Begs for $2.2 Trillion in Entitlement Spending  https://t.co/GDTSFKh31C via @BreitbartNews", "view": 10}, {"title": "", "body": "@SleightlyDavid @JoeBiden @POTUS Hopefully we will hear something this week, no idea why they keep it vague .", "view": 10}, {"title": "", "body": "@AYK_70 @ScottCWaring @JoeBiden @POTUS While you're thinking about how normal this is, he's thinking about what it means. Stupid comment.", "view": 10}, {"title": "", "body": "President Joe Biden is shifting strategy to sell his ambitious social spending plan by getting out of Washington and courting Democrats who have complained they felt left out of the process.  https://t.co/zRn1vLf8KS", "view": 10}, {"title": "", "body": "sora kingdom hearts smash they did it relevant tweet deltarune spamton aries taurus leo gemini scorpio hashtag cofeve joe biden", "view": 10}, {"title": "", "body": "Así vive Estados Unidos de mentiras e Infamias. #AlexNosUnioMas  #DefensaSoberana   @NicolasMaduro @PresidenciaCV @JoeBiden", "view": 10}, {"title": "", "body": "The $3.5 trillion plan is what we voted for when we made Joe Biden @POTUS and elected a Dem majority. Two stubborn Senators are not the voice of the party, or the American people. #HoldTheLine", "view": 10}, {"title": "", "body": "President @JoeBiden is shifting strategy to sell his ambitious social spending plans by traveling outside Washington and courting Democrats who have complained they felt left out of the process.  https://t.co/J4RGnhsP21", "view": 10}, {"title": "", "body": "Even though President Joe Biden has been in office only eight-and-a-half months, his policies have had a remarkably negative impact on the morale of the Border Patrol.  https://t.co/1dFPULNd0x", "view": 10}, {"title": "", "body": "@tedcruz Ted why do you want to have sex with Joe Biden?", "view": 10}, {"title": "", "body": "President Joe Biden will hit the road on Tuesday to try to shift the spotlight from the wrangling within his Democratic Party over his huge social spending package to its potential benefits for a wide swath of Americans.  https://t.co/ZwKbTr5sQ2", "view": 10}, {"title": "", "body": "Today is Oct 5, 2021. In Afghanistan, there are still Americans who want to come home but were left behind due to Joe Biden's failed decision-making.", "view": 10}, {"title": "", "body": "@JackPosobiec Just part of the process   - joe biden.    #LetsGoBrandon", "view": 10}, {"title": "", "body": "@RepJamesComer @JamesComer @JoeBiden @FoxNews Republicans are refusing to pay the debts they created under Trump. They should be blamed for their attempt to drive the economy into a depression, while receiving salaries 4 1/2Xs the national average. The rest of what you wrote in your Tweet are lies.", "view": 10}, {"title": "", "body": "#Fauci, congress, any government official or government entity SHOULD NOT profit off mandating a vaccine! DEMAND that they FORFEIT THEIR STOCK, profits or donations that are a direct result from a VACCINE that is mandated by the government! @POTUS @JoeBiden @VP #Accountability", "view": 10}, {"title": "", "body": "@TaxReformExpert @RyanAFournier Sorry but joe Biden isn’t responsible for prices at stores nice try thou", "view": 10}, {"title": "", "body": "No funny i don't want joe biden to win again either", "view": 10}, {"title": "", "body": "@Sen_JoeManchin and @senatorsinema, thank you.  Stay strong. @joebiden, Americans do understand. If you don't raise the debt ceiling then you can't spend more than you take in. That could be a good thing. Shut down depts of edu and labor", "view": 10}, {"title": "", "body": "FUCK JOE BIDEN", "view": 10}, {"title": "", "body": "@POTUS @JoeBiden Come join our Howell Varsity soccer game for senior night at Parker Middle School at 8pm. Please.", "view": 10}, {"title": "", "body": "@dawnmichele68 #Fauci, congress, any government official or government entity SHOULD NOT profit off mandating a vaccine! DEMAND that they FORFEIT THEIR STOCK, profits or donations that are a direct result from a VACCINE that is mandated by the government! @POTUS @JoeBiden @VP #Accountability", "view": 10}, {"title": "", "body": "And Joe Biden drone bombed an innocent father greeting his children as he came home.   What’s your point?", "view": 10}, {"title": "", "body": "If that pillock Your Hero Joe Biden hadnt made such a disaster about leaving Afghanistan the Ex soldier would not have still been there. I think you will find Skys reporting is wrong yet again.@lbc", "view": 10}, {"title": "", "body": "ARLIN REPORT THOUGHT(S) OF THE DAY: JOE BIDEN HAS ALWAYS BEEN A POLITICAL PROSTITUE.  https://t.co/rsw5WJ5gRY", "view": 10}, {"title": "", "body": "#FarmersProtest #FarmersProtest_InChardiKala #लखीमपुर #लखीमपुर_किसान_नरसंहार #BJP_KillerOfFarmers #1YearOf_PakkaKisanMorcha @diljitdosanjh @SonuSood @JoeBiden  https://t.co/CAY1TKk8zg", "view": 10}, {"title": "", "body": "Good gracious. Anti-private banking!! Now we need to have government run banks??  ---Joe Biden's controversial anti-private banking, Soviet-born pick to lead her department's Office of the Comptroller of the Currency (OCC) #SauleOmarova", "view": 10}, {"title": "", "body": "@Lenabellalou Joe Biden is beyond impeachment! So we wait", "view": 10}, {"title": "", "body": "Hyperbolic alarmism designed to SCARE you.  Don't fall for it.  Never trust a senile old man that gaslights for a living.  At least 3 times in the past, Joe Biden voted against raising the debt limit when GOP controlled congress.  Call out the #Hypocrisy on raising debt limit", "view": 10}, {"title": "", "body": "Amazing ignorant liberals.          Joe Biden, you are a shadow leader in service of evil. You are the enemy of what is good, right and moral,  “You represent no flag, no country, no soul. You eat hope, you twist minds. And that goes for all your democratic evil doers.", "view": 10}, {"title": "", "body": "Joe Biden is not my president", "view": 10}, {"title": "", "body": "FUC! Joe Biden He is as useless as TIT! on a bull", "view": 10}, {"title": "", "body": "@wilmerrincon2 @NicolasMaduro #PuebloSoberano #AlexNosUnioMas @NicolasMaduro @delcyrodriguezv @nicmaduroguerra @TareckPSUV @ConCiliaFlores @lLigia_Fonseca @jorgerpsuv @PresidenciaCV @JoeBiden @ecowas_cedeao", "view": 10}, {"title": "", "body": "@JoeBiden if Merrick Garland doesn't prosecute the cover up/conspiracy fraud and incitement to a bloody coup by republicans based on all of the hours of recorded evidence that prosecutors are not typically lucky enough to have you will be America's last president", "view": 10}, {"title": "", "body": "Why the Media Is (Mostly) Screwing Up What’s Happening With Democrats: Progressives are the pragmatists; Conservadems are blocking Joe Biden’s agenda. That’s it. That’s the story.   https://t.co/XqVyzgWqd1", "view": 10}, {"title": "", "body": "@thehill When #Chinese #Communist Party attacks the sovereign, self-ruling country of #Taiwan next year, @POTUS @JoeBiden will be hiding under his desk. #Biden tells Taiwan we got your back, but unfortunately #USA won't fight #CCP to defend Taiwan because Biden Bad 4 #Democracy worldwide.", "view": 10}, {"title": "", "body": "@Wil_Johnson1 F***JoeBiden!!", "view": 10}, {"title": "", "body": "@matlew1960 @Betterw05759703 @MysterySolvent ⬇️ happy as hell along with the over 81+ million voters that voted for Joe Biden and Kamala Harris to speak their voice amplified and protect their interests in America join us and vote Democrat!  https://t.co/vh7tPg6Tcd", "view": 10}, {"title": "", "body": "@HillaryClinton @JoeBiden @kamlaharris @UN @POTUS", "view": 10}, {"title": "", "body": "@DaWang026 @tonkafun2006 @mama_pause @andrealschultz @JoeBiden Are you mentally stable? Wtf are you even saying?", "view": 10}, {"title": "", "body": "Joe Biden says he's built most extensive \"voter fraud\" org in history  https://t.co/P503mZk3Ry via @YouTube", "view": 10}, {"title": "", "body": "Notice how much backing #Taiwan is getting from @JoeBiden in the news, nothing. China will continue and possibly even enter on the ground in Taiwan while Biden goes after Parents at school board meetings.", "view": 10}, {"title": "", "body": "So, in joe Biden’s America, parents have no say over  -what their children are taught in school and  -what is injected into their children.", "view": 10}, {"title": "", "body": "Great ep on how are connectedness is fueling hate &amp;driving us apart. @intelligence2. Dishonest media &amp; politicians are fueling the fire and taking advantage of this hate and division. @FoxNews @CNN @MSNBC @DanCrenshawTX @tedcruz @JohnCornyn @JoeBiden @GOP  https://t.co/g5U4wTcW0o", "view": 10}, {"title": "", "body": "@JoeBiden \"We? ur the president\"", "view": 10}, {"title": "", "body": "The Two People Pulling Joe Biden's Strings  https://t.co/hCvijPdw2f via @YouTube", "view": 10}, {"title": "", "body": "Joe Biden Begs for $2.2 Trillion in Entitlement Spending After Moderates Reject $3.5 Trillion Proposal  https://t.co/W66UUup7Jn", "view": 10}, {"title": "", "body": "@ModerateVoiceGA @alaynatreene @PunchbowlNews @TheDemocrats @JoeBiden There it is. The stupidest take in the thread. Someone finding a way to blame the democrats for the republicans obstructionist policies.  https://t.co/5YrNcsIYqq", "view": 10}, {"title": "", "body": "@jeffsupersaiyan @SeanHChin @GeesNYC @MaryLTrump @JoeBiden So your comment then is reverse-reverse-racism. 😜🦇💩🤪", "view": 10}, {"title": "", "body": "#ResilientlyOnwards @SecBlinken @nytimes @USAmbUN @USAID @CNN #ResilientlyOnwards #ETHnewBeginning 🇪🇹 @Reuters @JoeBiden @StateDept @BBC #UnityForEthiopia #EthiopiaPrevails", "view": 10}, {"title": "", "body": "@tedcruz They are definitely saying \"F*** Joe Biden\". No doubt. It's a very popular chant these days.", "view": 10}, {"title": "", "body": "@neece23 @cameron8digi @TulsiGabbard @JoeBiden @KamalaHarris Tech doesn’t employ enough people, and the workers who do stare at screens all day don’t wanna live in Iowa.", "view": 10}, {"title": "", "body": "@folha Pergunta pro @NelsonPiquet que ele sabe. @BarackObama @JoeBiden @nytimes @WSJ  @washingtonpost @OmarAzizSenador", "view": 10}, {"title": "", "body": "Peter Doocy makes Jen Psaki squirm with questions about Joe Biden’s garbage take on Kyrsten Sinema getting harassed [video]  https://t.co/YkFTGQGc4s via @twitchyteam", "view": 10}, {"title": "", "body": "if i don’t get hired at an overpriced farm to table restaurant soon im straight up just k*lling joe biden.", "view": 10}, {"title": "", "body": "@SykesCharlie Senator Joe Biden 2006 - \"My vote against the debt limit increase cannot change the fact that we have incurred this debt already, and will no doubt incur more.  It is a statement that I refuse to be associated with the policies that brought us to this point.\"", "view": 10}, {"title": "", "body": "@Reuters Joe Biden doesn't care about White people  https://t.co/hScLZ1FeUm", "view": 10}, {"title": "", "body": "@JoeBiden KEEP IT UP! Sing it from the mountain tops! Blast often and forcefully the reality of the debt ceiling and the Biden Agenda. GET GRANULAR!", "view": 10}, {"title": "", "body": "Some say fake, i think for myself, and you?   Biden Unveiled!! PM Boris Johnson Whispers \"You're Not Joe Biden!! Who The Bloody Hell Are You\"? - Must Video | Opinion - Conservative | Before It's News  https://t.co/oWn5gHeJ3E", "view": 10}, {"title": "", "body": "@ewarren Come on @JoeBiden! Millions of Americans are hurting! NOW is the time to make a difference, and you don’t need to wait for Congress!", "view": 10}, {"title": "", "body": "Magnet! Joe Biden's $3.5 trillion bill hands cash to illegals worth more than annual per capita income of 74 countries  https://t.co/XrT8oYppzd", "view": 10}, {"title": "", "body": "A group of frontline House Democrats will meet with Joe Biden this morning. We have the list. - POLITICO  https://t.co/vB1HYNQLqi via @GoogleNews", "view": 10}, {"title": "", "body": "George Floyd’s funeral was one of Joe Biden’s few campaign events, and he didn’t even show up in person", "view": 10}, {"title": "", "body": "@AngieinWAState @HerreraBeutler @JoeBiden @GOP Who do you know is running against Jamie Buetler? I created Alice f dems running against incumbent GOP, please see my pinned tweet and follow these folks! Thanks", "view": 10}, {"title": "", "body": "@JoeBiden peace and love...  https://t.co/qau35c8fBm", "view": 10}, {"title": "", "body": "@JoeBiden IS asinine! So are #AGMerrickGarland @TheJusticeDept &amp; @FBI! They are are insane communist THUGS!", "view": 10}, {"title": "", "body": "Japan’s new Prime Minister Fumio Kishida held his first talks as Japanese leader with US President Joe Biden …  https://t.co/6v421qkfgH", "view": 10}, {"title": "", "body": "#FakeNewsReports!    Experts Are Saying That Joe Biden’s Vaccine Mandate For Workers Is Supported By Legal Precedent!    Unfortunately, those legal precedents are in communist countries.", "view": 10}, {"title": "", "body": "Facebook is causing 13% or teenage girls to think about killings themselves and joe Biden is going to do something about it. Republicans will still not vote for him bc they hate blacks more than they love their own kids LOL", "view": 10}, {"title": "", "body": "Les grands oubliés du « Pandora Papers » : Macron et Joe Biden  https://t.co/7JcDRwfz9i via @Réseau International", "view": 10}, {"title": "", "body": "A group of frontline House Democrats will meet with Joe Biden this morning. We have the list #house #cnnbiden #joebiden #group #democrats #partyleaders  https://t.co/xqM4kWqSin", "view": 10}, {"title": "", "body": "@BenJealous @Bakari_Sellers @JoeBiden Joe Biden can’t do that on his own, Ben, and you know that.", "view": 10}, {"title": "", "body": "5 week shipping backlog @WhiteHouse @JoeBiden . Yes The worst administration in the history of the USA!", "view": 10}, {"title": "", "body": "@advchaser @JoeBiden @TheDemocrats FFS! You’re really gonna tell his daughter and the whole fricken’ internet that you knew her dad better than she? That takes a next level kind of narcissistic ego.", "view": 10}, {"title": "", "body": "Indict ⁦@JoeBiden⁩ for human trafficking foreign nationals infected with multiple variants of COVID.  https://t.co/Y9LfQVzSbe", "view": 10}, {"title": "", "body": "Nolte: Deadline Hollywood Praises NBC for Misleading Public About ‘F**k Joe Biden‘ Chant  https://t.co/A68Og8Jc2l via @BreitbartNews", "view": 10}, {"title": "", "body": "Joe Biden is proving he's pretty inept at politics  https://t.co/FxBzlOzUdz via @nypost", "view": 10}, {"title": "", "body": "Fulani Nigeria govt is heavily buying over some mainstream media against IPOB,they have succeeded in bribing @ProfSheehan &amp; @washingtontimes to publish that Christian Biafrans IPOB are killing Fulani Muslims in Nigeria when it is the opposite. We must counter their lies @JoeBiden  https://t.co/W2j7pdgb85", "view": 10}, {"title": "", "body": "Sinema should tell these malcontents to write her a letter - that will surely confound the illiterate bastard POS...  @ChrisPlanteShow  @wmalnews  @TuckerCarlson  @PrisonPlanet  @ClayTravis  @BuckSexton   Inappropriate (illegal) tactics that F Joe Biden will do nothing to address", "view": 10}, {"title": "", "body": "Don't blame the parents.  Blame the man who opened the school in a plague.   Joe Biden did this    https://t.co/5hwsQgdLep", "view": 10}, {"title": "", "body": "Minecraft Facts : joe biden wtf", "view": 10}, {"title": "", "body": "Shocking at the intentional incompetency from @JoeBiden @KamalaHarris @WHCOS @JakeSullivan46 @SecBlinken @AmbRice46 @PentagonPresSec @thejointstaff", "view": 10}, {"title": "", "body": "@wolfyycubzz @NukaCreeper @Ms_Father69 @JoeBiden I’d be very interesting", "view": 10}, {"title": "", "body": "@BenJealous @JoeBiden You’re preaching to the choir Ben", "view": 10}, {"title": "", "body": "@76kf @BTS_twt @bts_bighit @JoeBiden no se si estas jodiendo o de verdad tenes problemas mentales", "view": 10}, {"title": "", "body": "Fu*k #joebiden  https://t.co/3eJyhHVUoV", "view": 10}, {"title": "", "body": "@UNoticias La supuesta justicia gringa, siempre actuando en base a supuestas pruebas, para emitir supuestas \"preocupaciones\" @NicolasMaduro  @PresidenciaCV  @JoeBiden  #AlexNosUnioMas  #FreeAlexSaab  #DefensaSoberana", "view": 10}, {"title": "", "body": "Have you spoken with your buddy Joe Biden? Will you please pass that message along to him🙏🏾Also could you please tell him to take the gloves off and fight like all of humanity depends on him?...because it does. 🥺", "view": 10}, {"title": "", "body": "\"If the U.S. had learned from its mishandling of the original #SARSCoV2 it would have been better prepared for the variant that was already ravaging India. Instead, after a quiet spring, President Joe Biden all but declared victory ... \"   https://t.co/m0bdFbE7il", "view": 10}, {"title": "", "body": "Fellow Conservatives, Joe Biden can’t even get a Bill passed in The House, in which his Party has the Majority. What does that say about his Leadership skills?? The Conservative Corner National Republican Political Forum…  https://t.co/806LUFtm5j", "view": 10}, {"title": "", "body": "How Are you Joe Biden", "view": 10}, {"title": "", "body": "Protesters chant 'f*** Joe Biden and de Blasio' as thousands of teachers lose work due to vaccine mandate  https://t.co/6g77CY1hL4 via @YahooNews", "view": 10}, {"title": "", "body": "Good morning got to keep this going FJB f joe biden til all dems gone", "view": 10}, {"title": "", "body": "Another interesting Quote: “No one is holding Zuckerberg accountable” So Very True! How about Joe Biden? I guess if you steal the Presidency your in! It can’t every be challenged if your a Democrat that is! GOP ARE YOU OUT THERE?", "view": 10}, {"title": "", "body": "@RepJeffries @abramson1234 it’s legitimate by definition so we have to accept that. I’m terrified of what might happen. And when I say ‘might’ that’s just because what I fear is to awful to say out loud. Joe Biden needs to at least threaten to pack this SCOTUS. There’s nothing left. We need action.", "view": 10}, {"title": "", "body": "We all know  there is some crazy Cosmetics going on  and  there's puppets  from here to Nome Alaska.   question is   will the real Joe Biden please stand up", "view": 10}, {"title": "", "body": "@ArvelaizMusic @SatcomPatriot @BellaAugust4 @andrealschultz @JoeBiden Keystone XL was stopped YEARS ago, ludicrous to suggest it's suddenly having an effect on gas prices now.  And Russian pipeline is for natural gas for Europe, ALSO has nothing to do with price of US gasoline.  Logic is not your strong suit, Manuel.", "view": 10}, {"title": "", "body": "I will not put joe biden or harris on page i don't think so im a Trump Fan if u don't like o well", "view": 10}, {"title": "", "body": "@wind4me @JoeBiden @SenSchumer @CoryBooker Platinum Vape &gt; Select We just wish Raw Garden (CA) would go public.", "view": 10}, {"title": "", "body": "U. S. A. Downward spiral @JoeBiden OWNS this. #RESIGN  https://t.co/RiQtlh0oUy", "view": 10}, {"title": "", "body": "Only 44% approve of incompetent Biden in the average of polls....  How Popular Is Joe Biden? | FiveThirtyEight  https://t.co/YfsJFKQRxw", "view": 10}, {"title": "", "body": "@POTUS @JoeBiden The cost of this bill is ridiculous!  There are plenty of jobs available right now if anyone wants to work.  Stop paying people to stay home!", "view": 10}, {"title": "", "body": "It's pretty sad this is the only way Joe Biden can get a crowd", "view": 10}, {"title": "", "body": "@BenJealous @JoeBiden We can't wait to unseat Sinema. We must protect voting rights &amp; elections this year (&amp; end Gerrymandering this year) or Republi-CONS take control of House in 2022. The time to act is now w/ a carve-out [51 votes]! Distracting is happening right NOW!", "view": 10}, {"title": "", "body": "I don't know who needs to know this.  The #BorderCrisis is still in full affect.  Thousands are crossing day in and day out.   Mr #JoeBiden fails to be in leadership for the safety &amp; welfare of Americans.", "view": 10}, {"title": "", "body": "@ClayTravis Maybe they got tired of F Joe Biden, so they eliminated it", "view": 10}, {"title": "", "body": "@Mauerback @TheScrum1 @thefloutist @JoeBiden I agree, I'm all in favor of the bills' investments in people, especially young Americans. Maybe I'm too old, but I'm just skeptical that the U.S. will adopt and implement an effective industrial policy. China's system has some key issues, but it gets things done, U.S. doesn't.", "view": 10}, {"title": "", "body": "What is joe Biden’s plans to get me tickets to the rest of the love on tour shows like i need to see him more times", "view": 10}, {"title": "", "body": "@Miggysmalls6767 @JosefaEspinos1 @CNN @JoeBiden And you thought a disbelieving ideology like liberal democracy was gonna work in a land where 99% of the population want Shar'ia as the law of the land? Is this how mass murdering colonisers humanise themselves?  https://t.co/yD1S7Awx6f", "view": 10}, {"title": "", "body": "stltoday: resident Joe Biden urged Republican senators to “get out of the way” and let Democrats suspend the nation’s debt limit, hoping to keep the U.S. government from bumping dangerously close to a credit default.  https://t.co/j82ITZkm6Z", "view": 10}, {"title": "", "body": "Les grands oubliés du « Pandora Papers » : Macron et Joe Biden !  https://t.co/ZnfQzWmILL  I grandi dimenticati dei \"Pandora Papers\": Macron e Joe Biden!", "view": 10}, {"title": "", "body": "#LauraIngraham Cringes at the Rapidly Spreading ‘F*ck #JoeBiden’ Chants: ‘I Don’t Care For This’  https://t.co/eMOM4zXsFZ  https://t.co/snLwE5cCRR", "view": 10}, {"title": "", "body": "Joe Biden is Trump   https://t.co/MRQ2DjMFQT", "view": 10}, {"title": "", "body": "@JoeBiden @SenSchumer @SpeakerPelosi  Study below and make things happen.   #DebtCeiling  #Accountability  #January6thInsurrection", "view": 10}, {"title": "", "body": "@JihJihJi @JoeBiden you interested?  He's single AND ready to mingle!", "view": 10}, {"title": "", "body": "Joe Biden claims the U.S. Constitution empowers a president to force a needle in Americans’ arms. He is WRONG. Biden is arrogant, dictatorial, despicable, and dangerous. I'll continue to fight vaccine mandates with every fiber of my being.  https://t.co/FJKMpzUBvy", "view": 10}, {"title": "", "body": "bad cup of Joe Biden coffee //and very high price to pay/ and why is Biden gasoline not coming down ,he made 1/2 trillion just on gas price on every $2.00 per gallon over $1.50 a gallon / is this more of Joe Biden magic act ?", "view": 10}, {"title": "", "body": "Thanks Joe Biden!", "view": 10}, {"title": "", "body": "ARRESTED ' joe BIDEN  INCITING VIOLENCE", "view": 10}, {"title": "", "body": "Reminder as Joe Biden travels to Michigan today👇", "view": 10}, {"title": "", "body": "Thunderous ‘F**k Joe Biden’ Chant Breaks Out During The Titans/Jets Game  https://t.co/qd8iLXwkUs via @dailycaller", "view": 10}, {"title": "", "body": "Why is @CNN towing the line for corporate democrats? @JoeBiden ran on an agenda to build back better. That includes people not just roads. Questions framing progressives as bad actors when it’s the corporate dems going back on their word. #HoldTheLine", "view": 10}, {"title": "", "body": "NEW: @NJDSC Chairman LeRoy Jones is calling on Democrats in NJ and around the country to unite behind the full @JoeBiden agenda by passing both the budget reconciliation package and the bipartisan infrastructure bill in an Op-Ed  https://t.co/tJGOBApWwg", "view": 10}, {"title": "", "body": "@harrisonjaime @JoeBiden PASS THE BILL", "view": 10}, {"title": "", "body": "@Darkmattr @CameronWiebe1 @caroljsroth Which is why Joe Biden wants to further weaponize the IRS against citizens by doubling its size.", "view": 10}, {"title": "", "body": "@matlew1960 @Betterw05759703 @MysterySolvent That’s what they said in 2016 but in 2020/81+ million people reverse that whole fucking philosophy and elected Joe Biden and Kamala Harris historically with more votes than any other president or vice president in the history of this nation the proof is in the pudding.  https://t.co/UJENEtIPFl", "view": 10}, {"title": "", "body": "Such a leader, see how #AbiyAhmed honours its people. #ResilientlyOnwards #ETHnewBeginning 🇪🇹 @SecBlinken @nytimes @USAmbUN @USAID @CNN #ResilientlyOnwards #ETHnewBeginning 🇪🇹 @Reuters @JoeBiden @StateDept @BBC #UnityForEthiopia #EthiopiaPrevails", "view": 10}, {"title": "", "body": "@buffybatik @FisherAndrew79 @johnmcdonnellMP It was no good because it needs global agreement to end it, Joe Biden lobbied the G7 for just such an agreement but Ireland (EU Tax Haven and Member State) resisted.", "view": 10}, {"title": "", "body": "@ashishkjha I know how to stop covid-19 on the second pass get Joe Biden to follow me on Twitter mark Stambaugh 3 it will take a presidential order to do so", "view": 10}, {"title": "", "body": "@SecMayorkas is another of @JoeBiden’s evil insane #CommunistTHUGS controlled by wicked @georgesoros @BarackObama! #FireMayorkas @AliMayorkas #ImpeachBiden #ImpeachHarris #ImpeachPelosi", "view": 10}, {"title": "", "body": "@GBSteelers333 @tonkafun2006 @mama_pause @andrealschultz @JoeBiden \"Im not crying!!! The liberals are the ones that are crying!!! Im a big tough conservative look i can fit this whole boot in my mouth as i hump the leg of the police and hand them AR-15s to protect me because I LoVe fREeDuMb\"  https://t.co/DA4XIiwPN0", "view": 10}, {"title": "", "body": "Joe Biden Lifts Abortion Ban Referrals By Family Planning Clinics Put In Place During Donald Trump’s Administration  https://t.co/1lnJLXfKfD  https://t.co/kFzr1Sdm5T", "view": 10}, {"title": "", "body": "@FoxNews This Socialist Insurgency will lead to a country of Bullets Not Ballots.  The War is coming, and the Socialists love it.  @SpeakerPelosi @RepAOC @cnnbrk @Varneyco @JoeBiden @JoeConchaTV @LeaderMcConnell @kilmeade", "view": 10}, {"title": "", "body": "NBC Reporter Stays Silent as World Mocks Obvious Coverup of ‘F*ck Joe Biden‘ Chant  https://t.co/RymQDI8qcK via @BreitbartNews", "view": 10}, {"title": "", "body": "PURE ZDX X COMMUNISM  AG GARLAND  He should BE REMOVED for this. IMPEACH AG GARLAND... IMPEACH JOE BIDEN", "view": 10}, {"title": "", "body": "@Setsukue_ voy a bombardear argentina  odio el kpop y corea  #BTS_XYLITOL  @BTS_twt   #BTS  @bts_bighit   #ARMY_BOOSTDAY #KPOP第二世代  @JoeBiden", "view": 10}, {"title": "", "body": "Who is wiping Joe Biden's Butt?  https://t.co/wiEibgHddU", "view": 10}, {"title": "", "body": "While the greens in America, including their champion zealot, Joe #Biden , howl their primal screams over climate change, the rest of the world is turning to coal. The dark stuff. The satanic fuel. But it’s back big time across the globe.    https://t.co/B6LMN10pBQ", "view": 10}, {"title": "", "body": "@TrumpJew2 Feed Joe Biden more ice cream.", "view": 10}, {"title": "", "body": "@DougJBalloon Did Joe Biden stalk Krysten Sinema in a toilet stall? It’s complicated.", "view": 10}, {"title": "", "body": "@SenSanders The U. S. Military is the biggest polluter on earth and you backed Joe Biden.   We need better politicians than the likes of you.", "view": 10}, {"title": "", "body": "China becomes aggressive while @JoeBiden fiddles!   They know how weak he is.", "view": 10}, {"title": "", "body": "\"They aim to rebuild communication channels and implement consensus reached between presidents Xi Jinping and Joe Biden,\" 拜登国安顾问苏利文要跟杨洁篪见面 谈台海危机控管，跟可能擦枪走火的问题 大陆肯定不会近期打台湾了。当然苏利文也不会跟杨洁篪谈人权问题。   https://t.co/WxDfmsxtQz", "view": 10}, {"title": "", "body": "NO HAY PRUEBAS! Se basan en chismes de pasillos!   Quién puede creer  en el Departamento de Justicia de EE.UU cuando acusan sin pruebas al diplomático Alex Saab en un caso marcado por motivaciones políticas.   https://t.co/Gi21sCoVI8  @JoeBiden @NicolasMaduro  #AlexNosUnioMas", "view": 10}, {"title": "", "body": "Massive March Chants 'F Joe Biden' After NYC Suspends Thousands of Unvaccinated School Employees  https://t.co/iEpOziDJ0C", "view": 10}, {"title": "", "body": "\"Crowd at NASCAR Race Chants “F*ck Joe Biden” During Interview on NBC\" via @MWSNsports  https://t.co/sB7Jb7kCxM", "view": 10}, {"title": "", "body": "Joe Biden is destroying America you insufferable a_s. My God, Democrats are the dumbest MF’ers on the planet!", "view": 10}, {"title": "", "body": "Of course, @BarackObama is involved. It's his third term with dumb Dementia fuck @joebiden in the WH at the corrupt, criminal hands of Obama and the DEMOCRATIC COMMUNIST PARTY.", "view": 10}, {"title": "", "body": "@POTUS @JoeBiden Time to come clean on Hunters dealings", "view": 10}, {"title": "", "body": "tell that to Joe Biden have him evaluated", "view": 10}, {"title": "", "body": "Pesquisan Rasmussen hoje: 64 dos eleitores americanos acham que o país se tornou mais dividido depois da eleição de Joe Biden.  E não era esse o plano?  #ofimdaamerica", "view": 10}, {"title": "", "body": "@ChidiNwatu @davidmweissman Joe Biden has destroyed everything dude", "view": 10}, {"title": "", "body": "If you voted for Joe Biden in this last election- while I applaud and encourage you to exercise your rights- you're a fucking idiot.  Wake up! Pay attention! Did you vote for this dementia ridden pedophile because of what he stood for or was it because Trump was being demonized?", "view": 10}, {"title": "", "body": "Joe biden", "view": 10}, {"title": "", "body": "Enact a flat tax that reduces the IRS to a handful of phone operators. The rest? They can learn to code. According to Joe Biden, they could be fully trained as programmers in a couple months.", "view": 10}, {"title": "", "body": "Because fuck you. That’s why.   They want the power and that’s all they care about.   @JoeBiden and his administration are deliberately destroying this country in order to make us all dependent on the government.  Fuck. Them.", "view": 10}, {"title": "", "body": "The 23 marines that Joe Biden killed because of his incompetence.", "view": 10}, {"title": "", "body": "WATCH: NBC Reporter Covers for Biden, Claims ‘F*ck Joe Biden‘ Chant is ‘Let‘s Go Brandon‘  https://t.co/NEwdinr6c2 via @BreitbartNews", "view": 10}, {"title": "", "body": "FUC* JOE BIDEN.  HE IS A MENTAL WARD PATIENT WHO IS THE MAN BEHIND THE CURTAIN?  IS IT OBAMA? SOME SAY THIS IS HIS 3RD TERM; IS IT GEORGE SOROS? WE KNOW HE OWNS EVERY DEMOCRAT BREATHING AND SOME REPUBLICANS TOO.  NOTHING THIS MAN SAY'S IS TRUE", "view": 10}, {"title": "", "body": "@UNinIndia @JoeBiden @UN", "view": 10}, {"title": "", "body": "Improve my life? Lmao what a joke. @JoeBiden doesn’t wanna improve anyones life but his own.", "view": 10}, {"title": "", "body": "Sobre la base de mentiras y casos desestimados en el mundo, la justicia gringa sustenta el caso de Alex Saab, vaya seriedad... @NicolasMaduro @JoeBiden @mae_rusia @MFA_China @CancilleriaVE @NoruegaMexCA #DefensaSoberana #AlexNosUnioMas", "view": 10}, {"title": "", "body": "New Japanese Prime Minister Fumio Kishida said on Oct. 5 that he received a “strong” message from President Joe Biden about the United States’ commitment to defending the disputed East China Sea islets known as the Senkaku Islands in Japan.  https://t.co/RdnX7tNuSi", "view": 10}, {"title": "", "body": "@SpeakerPelosi  @JoeBiden why do you always threaten not to pay the military or social security payments? Perhaps you should try to do this in a diffrent manner  .like no pay for congress the senate ect till you work together with your counterparts?  https://t.co/FysupamvXq", "view": 10}, {"title": "", "body": "@TiggerTwo4 Yes it does. Dressing like a cop makes you a cop. Dressing like a homeless man makes you homeless. That’s why I dress like Joe Biden and the APS has been chasing me ever since.  https://t.co/Vu8om5ZDfL", "view": 10}, {"title": "", "body": "@zGKUG0mYjSRurqF @VanathiBJP @annamalai_k This is India under Modi rule...  @nytimes @CNN @foxnewstalk @MSNBC @BBCWorld @MEAIndia @Reuters @AFP  @smh @dwnews @USCIRF @WhiteHouse @WSJ @PMOIndia @DrSJaishankar @narendramodi @SpeakerPelosi @JoeBiden  @potus @MofaQatar_EN @vp @AJEnglish @KamalaHarris @flotus", "view": 10}, {"title": "", "body": "If Marsha asked me any question while before the committee the 1st thing I would say is \"Just to establish YOUR credibility Senator, did Joe Biden win the election?\"", "view": 10}, {"title": "", "body": "F joe biden AND f Donald Trump!", "view": 10}, {"title": "", "body": "sleepy joe biden still can’t believe you guys voted for this grandpa lmfao", "view": 10}, {"title": "", "body": "FiveThirtyEight has recorded that Kyrsten Sinema has voted with Joe Biden approximately 100% of the time this term", "view": 10}, {"title": "", "body": "@RobManess @JoeBiden the US should not ignore what is ccp doing to #Taiwan", "view": 10}, {"title": "", "body": "@monkeym1a @parapolitika @Zoran_Zaev Joe Biden, the President of Washington. 21st century stuff.", "view": 10}, {"title": "", "body": "@ASlavitt this will need presidential order by Joe Biden have them contact me Mark Stambaugh 3 I'm Twitter", "view": 10}, {"title": "", "body": "It is the best decision to keep our country safe.  Some leaders have ulterior motives that don't serve the people.   Mr #JoeBiden you have jeopardized the safety of all #Americans.", "view": 10}, {"title": "", "body": "@Qnie_Addis @hailu_tsinat @awolallo @DanielsonKassa1 Just to add, her Biden relationship is clear cut (in 2020) \"In 2020 Amane served as a key staffer for President Joe Biden, Vice President Kamala Harris, and the DFL ticket, ensuring Minnesota stood up to Donald Trump's reckless agenda.\"  https://t.co/EITV1Pmz3i", "view": 10}, {"title": "", "body": "How about @JoeBiden?", "view": 10}, {"title": "", "body": "#freedom #kissan_ekta_zindabaad #FarmerProtest #FarmersProtest #LakhimpurKheri #muder @JustinTrudeau @JoeBiden @TheRock @JohnCena @vindiesel @rihanna #BJP_KillerOfFarmers #LakhimpurKheriViolence #FarmerProtest #WeStandWithFarmers #share #help #😭😭😭👏🏻  https://t.co/IzYCCcfMji", "view": 10}, {"title": "", "body": "Joe Biden is asleep at the wheel.    https://t.co/YpbIqQXjcj", "view": 10}, {"title": "", "body": "56 Chinese aircraft we're in taiwan's air space yesterday!  Joe Biden, crickets", "view": 10}, {"title": "", "body": "@JoeBiden @KamalaHarris @VP @POTUS @nytimes @washingtonpost @politico @smh @TIME @ScottMorrisonMP @EmmanuelMacron @BorisJohnson @CanadianPM @JustinTrudeau @AlJazeera_World @AlJazeera @jacindaardern @JPN_PMO @globeandmail @guardian @UNHumanRights @UN @theJagmeetSingh", "view": 10}, {"title": "", "body": "Japan's new Prime Minister Fumio Kishida said on Oct. 5 that he received \"strong words of commitment\" from US President Joe Biden on Washington's promise to defend the Senkaku Islands in the East China Sea.  https://t.co/GcwJ6M04RJ", "view": 10}, {"title": "", "body": "My opinion is Joe Biden really said for those harassing Miss Sinema to keep up the pressure until she is a yes vote. What the harassers did was criminal and they should be jailed right away before they get violent and someone gets killed.", "view": 10}, {"title": "", "body": "#ATENCIÓN  @PresidenciaCV  @JoeBiden  @POTUS   #FreeAlexSaab  #AlexNosUnioMas", "view": 10}, {"title": "", "body": "Hands up. China is coming and @JoeBiden will surrender. Cowards die many times their death……..", "view": 10}, {"title": "", "body": "@bette_oh \"Crowd at NASCAR Race Chants “F*ck Joe Biden” During Interview on NBC\" via @MWSNsports  https://t.co/sB7Jb7kCxM", "view": 10}, {"title": "", "body": "Joe Biden: Deceitful or Demented?  https://t.co/38yq2o3oQb via @@trumptrain_news", "view": 10}, {"title": "", "body": "@davidmweissman I'm a lifelong Delaware resident who has supported &amp; appreciated Joe Biden from the beginning of his political career. It's never going to change. He's a good decent human being. I may not have always agreed with him, but I support him 100%.", "view": 10}, {"title": "", "body": "@Christi75733524 @JoeBiden Speak for yourself.", "view": 10}, {"title": "", "body": "@davidmweissman If you support Joe Biden, you're either stupid or corrupt. Which one fits you Davey?", "view": 10}, {"title": "", "body": "hello Joe Biden from Michigan //never going into Detroit //it still in bankruptcy// no pumps //no street lights //and all run by democrats ?", "view": 10}, {"title": "", "body": "@tedcruz 66,000 Texans have already died, thousands more are dying each week, and deaths in Texas are on the rise...  But Texans can rest easy knowing their senator working hard posting humorless \"Fuck Joe Biden\" memes on Twitter.  You'd think he'd have something more important to do? 🤔  https://t.co/wSFNwIVzbD", "view": 10}, {"title": "", "body": "maybe the left would be more comfortable if we chanted:  “ABORT joe biden” 🤔  https://t.co/Mg9YtiPn40", "view": 10}, {"title": "", "body": "That's JOE BIDEN \" PLAN GET IT NOW.????????? WAKE UP AMERICANS..!!!!!!!!!", "view": 10}, {"title": "", "body": "@SatcomPatriot @BellaAugust4 @GoatyMcTroll @andrealschultz @JoeBiden 🤦🏻", "view": 10}, {"title": "", "body": "@SenTomCotton Joe Biden is failing America on too many important fronts!  It is time to stop his abuse of power.", "view": 10}, {"title": "", "body": "media doesnt report on how much the population hates Biden...so crowds have responded:  FUCK JOE BIDEN", "view": 10}, {"title": "", "body": "Joe Biden insults Sinema and Manchin, the very senators he needs to win over for his porkulus spending  https://t.co/fYVkcnPRg4", "view": 10}, {"title": "", "body": "😊👍.                                           Joe Biden booed at Congressional Baseball game  https://t.co/BqKA1cctzN via @YouTube", "view": 10}, {"title": "", "body": "@sfpelosi @JRubinBlogger @JoeBiden Free money to kids flunking out of college.", "view": 10}, {"title": "", "body": "Half of Americans approve and about half disapprove of how Joe Biden is handling his job as president, a significant drop from the president’s approval rating earlier this year. Just 34% of Americans say the country is headed in the right direction.", "view": 10}, {"title": "", "body": ".@JoeBiden ’s claim that those earning less than $400K a year wouldn't see a tax hike isn’t true. It'd be impossible to fund his spending agenda by raising taxes only on high-income earners. via @DailySignal  https://t.co/0kQ7XIrB4l", "view": 10}, {"title": "", "body": "Former #UnitedStates Vice President #MikePence has slammed media focus on Capitol riots as an attempt to divert attention from President #JoeBiden's \"failures.\"    #Taliban    https://t.co/ISNyfFRpPf", "view": 10}, {"title": "", "body": "📉 EE.UU cerca de caer en default por primera vez  Joe Biden advirtió que podrían entrar en default y apuntó contra los republicanos por negarse a apoyar a los demócratas para aumentar el límite de endeudamiento. #Navarro2023  https://t.co/qwJN565aI6", "view": 10}, {"title": "", "body": "Since @JoeBiden entered the White House ALL COMMON SENSE is out the door", "view": 10}, {"title": "", "body": "@jfurlan14 @TheScrum1 @thefloutist @JoeBiden No problem with the expansion of the social safety net. We can scrap a ton of corporate subsidies if CBO wonders how we \"pay for it\". But there is little coherence to the Biden proposals, either domestically or in foreign policy. A lot of slogans and (dare I say it?) \"malarkey\"", "view": 10}, {"title": "", "body": "@SchmitterCecile @JoeBiden @ChangeFrance Already signed but shared", "view": 10}, {"title": "", "body": "This is amazing!!! Twitter is a savage. #FJBiden #fjoebiden #FJB #JoeBiden #TrumpWasRight", "view": 10}, {"title": "", "body": "Joe Biden is good for Texas", "view": 10}, {"title": "", "body": "I'm not surprised @JoeBiden is fine with lunatics following you into the #bathroom? After all #25thAmendmentJoe loves getting really up close to youngsters Imagine that future of #America hinges on #SlowJoe waking up each day for 3 more years  @1speaks   https://t.co/gYNHS7mTfG", "view": 10}, {"title": "", "body": "@MzWiz1 Joe Biden", "view": 10}, {"title": "", "body": "@realpfigueiredo Fuck Joe Biden MESMO... and Kamala as well", "view": 10}, {"title": "", "body": "Joe Biden Appoints Sanctuary City Supporter to Prosecute Illegal Aliens  https://t.co/O6DQFyAGpS", "view": 10}, {"title": "", "body": "I was today's year old when I learned ab joe biden squaring off with a gangster named Korn pop.", "view": 10}, {"title": "", "body": "Remember when Joe Biden promised he would leave no Americans behind in Afghanistan and then promptly left hundreds of Americans behind with a botched withdrawal that killed 13 American service members and then Biden called it an extraordinary success? Me too.", "view": 10}, {"title": "", "body": "Can anyone answer this ? @WhiteHouse @JoeBiden  @KamalaHarris", "view": 10}, {"title": "", "body": "@JoeBiden is already the worst President in history", "view": 10}, {"title": "", "body": "Les grands oubliés du « Pandora Papers » : Macron et Joe Biden !  https://t.co/8wGZ2zq3CG #Politiqueinternationale #Economie", "view": 10}, {"title": "", "body": "@0110100t @Goomba_Respawnd @ChrisKi51238608 @Matthew10518930 @cenkuygur @JoeBiden So a whole 10 months!  Your \"Most Popular\" POTUS said there was no vaccine when he came to office. And you have the gall to speak about liars.", "view": 10}, {"title": "", "body": "@C_RMartinez @GlennYoungkin @bdomenech @FoxNews @TerryMcAuliffe @BillClinton @HillaryClinton @JoeBiden It was a pleasure to see him in Martinsville last night!🇺🇸🇺🇸🇺🇸", "view": 10}, {"title": "", "body": "@JoeBiden could totally f up a wrecking ball with a rubber hammer", "view": 10}, {"title": "", "body": "Virus Death Truth Bomb, China Tests Joe Biden  Today’s Top Patriot Headlines:  Fauci: “It’s (cont)  https://t.co/vHTiw3IF0v", "view": 10}, {"title": "", "body": "@mmpadellan @kamalaharris @VP @TeamPelosi @SpeakerPelosi @RepAdamSchiff @POTUS @joeBiden @SenWhitehouse @tedlieu @amyklobuchar @staceyabrams @katieporteroc @ChrisMurphyCT  @RonaldKlain @BetoORourke @TheDemocrats @SenSchumer @PeteButtigieg @RepSwalwell THIS!!", "view": 10}, {"title": "", "body": "@ShutDown_DC @JoeBiden @POTUS And it defies the United Nations plea @ American lawmakers to respect indigenous treaty and human rights. The whole thing would have been impossible without police brutality and pain compliance tactics", "view": 10}, {"title": "", "body": "If even old, white moderate Democrats like Joe Biden - or here in Wisconsin, Tony Evers - generate this behavior from an entire party, you need to look harder for causal explanations. And telling yourself and your readers comforting Panglossian bedtime stories is not good enough.", "view": 10}, {"title": "", "body": "@KellySpringer11 @MrsFalbulous @drew_pickard @JoeBiden Yep. I think that's the point!", "view": 10}, {"title": "", "body": "US’ worst SecState .@MikePompeo’s 100% wrong about #Jerusalem Consulate per US Constitution Chief Executive (.@POTUS) has sole discretion as to where US diplomatic missions are located  it’s perfectly legal for .@JoeBiden Admin to open a E. J’lem Consulate  https://t.co/v98sfLf0rB", "view": 10}, {"title": "", "body": "Hmmm- let’s leave Joe Biden’s son alone after whores, underage orgy, cocaine off Nipple, ohh let’s not forget the Ukrainian thievery, and go get mom &amp; dad American..  effff you to all involved!", "view": 10}, {"title": "", "body": "Arizona Sen. Sinema clearly understands that it is totally inappropriate form her and Joe Manchin to hold up and water down President Biden’s Build Back Better plan. This is what we need and this is what we elected Joe Biden President for. She know what inappropriate means.", "view": 10}, {"title": "", "body": "A document from late July shows Schumer’s SIGNATURE on an agreement with Manchin laying out the terms in which the West Virginia senator would vote “yes” on for this fiscal year’s budget and President Joe Biden’s “Build Back Better” plan.", "view": 10}, {"title": "", "body": "F*ck Joe Biden", "view": 10}, {"title": "", "body": "@SatcomPatriot @ArvelaizMusic @BellaAugust4 @andrealschultz @JoeBiden But but but we need that extra tar sands crude so that we can waste it by illegally modifying our already inefficient diesel guzzling trucks that we don't really need, in order to make them waste even more fuel and have even less power making them roll coal. #Murica  https://t.co/P8evlHytRm", "view": 10}, {"title": "", "body": "Can’t @JoeBiden just call out @Sen_JoeManchin &amp; @SenatorSinema b/c it’s clear they’re obstructing the agenda that put him in the White House. This isn’t rocket science, or hand over the gov’t to the @GOP b/c at least they do what they say, regardless of how awful it is.", "view": 10}, {"title": "", "body": "@duty2warn @kamalaharris @VP @TeamPelosi @SpeakerPelosi @RepAdamSchiff @POTUS @joeBiden @SenWhitehouse @tedlieu @amyklobuchar @staceyabrams @katieporteroc @ChrisMurphyCT  @RonaldKlain @BetoORourke @TheDemocrats @SenSchumer @PeteButtigieg @RepSwalwell THIS!!", "view": 10}, {"title": "", "body": "@lawyer4laws @phyle17 ⏳Attorney General \"Merrick Garland⌛on behalf of Joe Biden has weaponized📍the DOJ📍 &amp; FBI📍\"  Listen to @Kevin_Shipp, CIA whistleblower. Uploaded 3 years ago; they were already weaponised.  \"It's almost too late; post-constitutional #ShadowGovernment.\"  https://t.co/xifS5omepl", "view": 10}, {"title": "", "body": "@SenBlumenthal Sounds like Zuck's policy is identical to your guy @joebiden #FrancesHaugen Let's face it no accountability in govt, with no apologies, the same for Corp America, especially bigtech #Facebook @CNBC", "view": 10}, {"title": "", "body": "Biden plots debt ceiling blitz to focus the blame on McConnell  https://t.co/3ghmETDcFb step one of Joe Biden magic act// make $3 trillion disappear //and taxing the rich to pay their far share ,&amp; more magic// as that disappears //", "view": 10}, {"title": "", "body": "@angusfgillan Build Back Better was Joe Biden's campaign slogan but now its being used by the Tories?", "view": 10}, {"title": "", "body": "What about my finances... Ms. Vice president...pleaee reply to my email... I am eagerly waiting for the same.... Sent reminder mail as welll  @JoeBiden @HouseDemocrats  @NH_India", "view": 10}, {"title": "", "body": "But, but....the debilitated #imbecile @POTUS @JoeBiden is judging them by their actions.... @WhiteHouse sucks.", "view": 10}, {"title": "", "body": "💥NBC Reporter Goes Into Damage Control After NASCAR Fans Chant \"F**K Joe Biden\"  https://t.co/2COiCzVD7m", "view": 10}, {"title": "", "body": "Prediction:  @Potus will invite @AbiyAhmedAli to the @WhiteHouse before @JoeBiden's term is over.", "view": 10}, {"title": "", "body": "@Ktiburcio @PaulettoShirlei @azevedoandreiat @opropriofaka @JoeBiden @elizianegama @GadoDecider Primeiro pare de politizar a doença e Respeite a prerrogativa médica. Se informe melhor  https://t.co/rxpSZhxZmN", "view": 10}, {"title": "", "body": "Not much reporting on the Fuck You Joe Biden Chants at sporting events If it was Trump they were chanting about the media would be reporting it like there would be no tomorrow while laughing about it", "view": 10}, {"title": "", "body": "As I walk across the living room, my foot faces a lego. Joe Biden left that lego on the floor of my house and crippled my poor foot.", "view": 10}, {"title": "", "body": "I’m sorry Mr AG, but according to @JoeBiden your @POTUS and boss, it is just “part of the process” so why dont you do your job and leave parents alone!  BTW:   #FuckJoeBiden", "view": 10}, {"title": "", "body": "As the  #FJBMovement begins to include #BLM and #Antifa millennials who  have severed ties from their #BlueWave #Soros handlers they fill \"dead airtime\" with sports with empty seats &amp; no one is chanting \"F Joe Biden\"like in packed stadiums nationwide #FJB #MorningJoe #Trump", "view": 10}, {"title": "", "body": "El presidente de EEUU, #JoeBiden, categorizó a los miembros del Partido Republicano como “hipócritas, peligrosos y vergonzosos” por rechazar la propuesta demócrata de aumentar el techo de la deuda, algo que considera que es “jugar a la ruleta rusa con la economía estadounidense”.  https://t.co/6l8h1Hrb6f", "view": 10}, {"title": "", "body": "Do you believe the rumor that President Joe Biden will announce that Americans not vaccinated before 2022 will be put in camps? Answer by Sue Lambert  https://t.co/jJk8RHE2Hb", "view": 10}, {"title": "", "body": "Biden: Men harassing and filming women in the bathroom 'a part of the process'  https://t.co/St2Ndj2DW9 YA JOE JUST PART OF THE PROCESS. JOE BIDEN IS LEADING THIS COUNTRY TOWARD ANARCHY.", "view": 10}, {"title": "", "body": "@POTUS @JoeBiden #tarareade", "view": 10}, {"title": "", "body": "@seanhannity @GOP YOUR WORD IS THE FUTURE OF OUR BOND 🚨  Buy some PUTS in the QQQ'S and hold on tight for the Economic Ride 📉  This guarantees a Joe Biden Impeachment come 2023 🇺🇸", "view": 10}, {"title": "", "body": "President Joe Biden delivers remarks after Afghanistan withdrawal  https://t.co/cvCuCI9paN", "view": 10}, {"title": "", "body": "Wonder if there’s a stadium in the US that hasn’t started a fuck Joe Biden chant yet lol", "view": 10}, {"title": "", "body": "@SamGoody2021 @RSBNetwork Great for Americans. Unlike Joe Biden, who makes the Taliban Great Again. Did you see the reports of China taking control of Bagram airbase? Now that Hunter Bidens laptop has been confirmed, we know why Biden did it, he's in China's pocket.", "view": 10}, {"title": "", "body": "🤜🏽🤛🏽El presidente Alberto Fernández confirmó que el acuerdo con el Fondo Monetario Internacional está \"cerrado”. Lo dijo en una nota a El Destape y declaró que habló con la Directora del FMI. Además, intentará pedir un apoyo final a Joe Biden para cerrar en lo político el acuerdo  https://t.co/YVZysb8P56", "view": 10}, {"title": "", "body": "I wish I couldn't STOPPED you. Don't be intimidated by COMMUNIST  Dictator FAKE ' JOE BIDEN.  MANDATES are ILLEGAL.  I hope you RECOVER.. TC...", "view": 10}, {"title": "", "body": "@JoeBiden lying joey biden never tells the truth. Can't trust any of the obiden regime", "view": 10}, {"title": "", "body": "Joe Biden is proving he's pretty inept at politics  https://t.co/PDu2twPi7n via @nypost", "view": 10}, {"title": "", "body": "@davidmweissman Yes, he's well aware. Joe Biden is smart.", "view": 10}, {"title": "", "body": "Estou aqui em NY e é triste a situação. Professores que perderam os seus empregos por não terem sido vacinados protestam gritando \"Fuck Joe Biden and De Blasio\".", "view": 10}, {"title": "", "body": "Texas Tells Federal Judge to Reject Joe Biden’s Attempt to Block Abortion Ban.   https://t.co/PsW9exiJGe via: @LifeNewsHQ", "view": 10}, {"title": "", "body": "@harrisonjaime @JoeBiden With the Republicans  refusing to raise the Debt limit after giving Trump 8.7 trillion dollars to protect the Economy and the 1%ers, one has to wonder if they really care, if the Economy  tanks or a Depression Starts!  They stole the money they can destroy the 99% if they want!", "view": 10}, {"title": "", "body": "Vive Joe Biden", "view": 10}, {"title": "", "body": "PLS. FIRE THESE EVIL, DO-NOTHING CROOKS! @JoeBiden", "view": 10}, {"title": "", "body": "Chris Christie Just ‘Buried’ 2020 Joe Biden – He Accuses The President Of Bowing Down To The Progressive Wing  https://t.co/uUsAp31zle via @onlinepatriots", "view": 10}, {"title": "", "body": ".@JoeBiden ’s claim that those earning less than $400K a year wouldn't see a tax hike isn’t true. It'd be impossible to fund his spending agenda by raising taxes only on high-income earners. via @DailySignal  https://t.co/u55bOm1i6G", "view": 10}, {"title": "", "body": "#ULTIMAHORA  CAÍDA DE BIDEN: La aprobación de Joe Biden cae a un nuevo mínimo del 40% en la última encuesta nacional.  https://t.co/Q2ZcU29Qpn", "view": 10}, {"title": "", "body": "@Buddy_Carter @JoeBiden Pay your bills Buddy…  https://t.co/ItEgXm0IPk", "view": 10}, {"title": "", "body": "@secretsocietyse @ISafeyet @jorgan10s @mdtufayeahmed1 @TonyVenutiShow @lsferguson @Italianborn2 @ItsHammerTimeII @itsmesetfree @Jacfam2 @JackieVasser @JamesEarl2112 @jbirdj77 @JBlaze69er @jacquihughes17 @JamesPh71820226 @JeffTwosocks888 @JellyBellyYolo @JessieJaneDuff @joedisomma @MikeCompton @jameswa48312143 @Pgh_Buz @keith0sta @txark76 @spzkaz @01IOTA @abd130usa22nq @0u8up2 @MarilynLavala @4321parker @smrose29 @TheGreatUniter3 @ExposeTheMedia @Tee2019K @karthik_es @TJ2020landslide @tnolwene @OldPrague @BellaZZu @earthing5000 @MaggieS66638762 @patriot_roll @qfd_bruce @tannermaze6 @ICanPlainlySee @ernestleenot @Cavitation19 @itsaboutdamnti1 @Lynda63986855 Fuck Joe Biden is the ultimate pathological liar. You lose.", "view": 10}, {"title": "", "body": "Why isn’t @JoeBiden on TV telling all Americans what’s in these two pieces of legislation?  All we hear about is the cost.  What we need to know is all of the “wonderfulness” and how taxes are being raised on the rich.  @POTUS @VP", "view": 10}, {"title": "", "body": "\"Do you think, @BuckSexton, that Joe #Biden is up to this situation, this geopolitical game of chess with Chairman Xi in #China?\" - @ClayTravis #Taiwan   https://t.co/QCtOWK3mNV  https://t.co/NO4vosIcOY", "view": 10}, {"title": "", "body": "Joe Biden said his nickname in school was \"Shoeleather\". Watch a movie called \"Wag The Dog\". I think we're coming to the part where the \"producers\" think \"Ole Shoe\" is more trouble than he's worth.", "view": 10}, {"title": "", "body": "@GEhodl @SECGov @Atlanta_SEC @UGASchoolofLaw @CFTC @FINRAFoundation @TerryCollege @GaryGensler @JoeBiden @RobinhoodApp @robinhood 😬 yikes", "view": 10}, {"title": "", "body": "\"Now, a new tar sands pipeline is online, and expected to add 50 coal plants' worth of carbon pollution to the atmosphere every year.\"  This is your legacy @JoeBiden @POTUS", "view": 10}, {"title": "", "body": "@NoahMontoyaVJA @cyjameswilson Where’s the Republican signs? Serious question, as I’m in an area that makes the video blurry right now (bad internet lol.) The sign that says “F*ck Joe Biden?” Bc that doesn’t make someone a Republican. The friends I know that are self-proclaimed liberals hate the man.... 😬", "view": 10}, {"title": "", "body": "Democrats are going to continue exploiting COVID-19. It won’t end with Joe Biden’s vaccine mandate.  We must vote them out in 2022.", "view": 10}, {"title": "", "body": "Massive March Chants 'F Joe Biden' After NYC Suspends Thousands of Unvaccinated School Employees  https://t.co/6uq1IKV2Rl", "view": 10}, {"title": "", "body": "And the “it’s not the man” problem cuts both ways. The GOP is reacting to &lt;checks notes&gt; Joe Biden - old white man and lifelong median voter in the Democratic caucus - as it did to Barack Obama, with total nihilism and nullification and continued attempts to dismantle democracy.", "view": 10}, {"title": "", "body": "@BillGates @JoeBiden @POTUS @JustinTrudeau", "view": 10}, {"title": "", "body": "@JoeBiden I graduated, but still 😒 cancel the debt or stop the compounding interest.", "view": 10}, {"title": "", "body": "@Insulinlaw @JRubinBlogger @tify330 Like Joe Biden’s morals? Or mental capability. Either way, agreed don’t waste your vote", "view": 10}, {"title": "", "body": "@CCowboy723 @_Joe_Patriot There are no more ' United States' thanks to so called Mr Unity' Joe Biden. He lied.", "view": 10}, {"title": "", "body": "@Michael59630180 @BidenBurner46 @JoeBiden Really depends who leads the revolution. It could be authoritarian like Stalin, where dissent was oppressed. But there’s a big anti-authoritarian movement within socialism too, lots of anti-Leninist/anti-Stalinists too. Socialism has a different form of democracy.", "view": 10}, {"title": "", "body": "President Joe Biden on Tuesday will visit Howell, Michigan, to drum up more public support of his legislative agenda.   https://t.co/UACdIkgOXw", "view": 10}, {"title": "", "body": "Report: WH Staff Veto Joe Biden, Keep Him from Taking Democrat Lawmakers' Questions  https://t.co/l6JR7pFkBQ", "view": 10}, {"title": "", "body": ".@nytimes .@Washingtonpost @politico @axios @AP @ABC @CBS @NBC @CNN @MSNBC @Reuters @MeetThePress @kenvogel Tabloid @maggienyt  @chucktodd @mitchellreport   Your attempt at demonizing, undermining, &amp; swiftboating of Pres Joe Biden &amp; VP Kamala Harris, will be met with — 👇👇👇👇  https://t.co/HLRNv2LJXf", "view": 10}, {"title": "", "body": "President Joe Biden is shifting strategy to sell his ambitious social spending plans by traveling outside Washington and courting Democrats who have complained they felt left out of the process.    https://t.co/GJHZW18AYi", "view": 10}, {"title": "", "body": "Joe Biden Folds Like a Wash and Wear Suit as Kyrsten Sinema Gets the Last Laugh  https://t.co/Rs7kaLQOWg", "view": 10}, {"title": "", "body": "They are destroying the party and the @POTUS agenda that helps 'ALL' Americans.  You have handed control to the Republicans and apparently Manchin and Sinema are POTUS and VP not, Joe Biden.  @SpeakerPelosi @SenSchumer .    This, is your legacy!  2/2", "view": 10}, {"title": "", "body": "joe biden fine asf 🤣❤️", "view": 10}, {"title": "", "body": "@Pablo89910 @17thLetter3 @AetherEmrys @JoeBiden 🤣🤣🤣🤣🤣  https://t.co/RItcgTnOLv", "view": 10}, {"title": "", "body": "Market movers: 🇺🇸 Joe Biden pide ayuda a legisladores para elevar el techo de deuda de EE.UU. @expansioncom 🇲🇽 Ventas de autos registran su septiembre más débil desde 2011 @eleconomista  #PrivateCapital #FinancialWellness #WealthManagement #finanzas #invertir #inversiones #dinero", "view": 10}, {"title": "", "body": "Been there every since Joe Biden lied and swung to the radical extreme left in his governing. Irreconcillable differences.", "view": 10}, {"title": "", "body": "President Joe Biden never spoke a word about the Line 3 tar sands pipeline, which officially went online on Friday (cont.)  https://t.co/JaTWo08s5R", "view": 10}, {"title": "", "body": "@mikezuchowski2 @cbjkc5 @JoeBiden So she was physically forced as in a bunch of people forced it into her against her wishes 🤣 imma need a citation", "view": 10}, {"title": "", "body": "THIS IS WHAT THE EVIL FAUCI &amp; @JoeBiden THINKS IS OK. ITS HORRIFYING", "view": 10}, {"title": "", "body": "... and the U.S.’s ability to influence abroad. @JoeBiden could have easily paused #Line3’s construction by ordering the complete environmental review Trump never gave it. Instead, he chose to let it move forward—and ignored every attempt by his constituents to explain why.\"", "view": 10}, {"title": "", "body": "@POTUS @JoeBiden How much longer must we wait ? #VotingRightsNOW", "view": 10}, {"title": "", "body": "@rochellemaginn2 @davidmweissman Joe Biden couldn't even handle a wrong order at McDonald's but somehow that would be Trumps fault", "view": 10}, {"title": "", "body": "So let me see if I understand what is going on;  After raising the debt ceiling 3 times under #DonaldTrump #republicans now say they don’t want to raise is for @POTUS Joe Biden?  Hmm… sounds like they are fucking hypocrites.", "view": 10}, {"title": "", "body": "IF America defaults on its #debt,  It will be 1000% #JoeBiden and the #Democrats fault. They are in charge. The ball is in their court.   It shouldn't happen but IF IT DID, Biden WILL go down as the worst president in U.S. history &amp; the only one to default.", "view": 10}, {"title": "", "body": "Statement by President Joe Biden on Dr. Francis Collins Stepping Down as Director of the National Institutes of Health  https://t.co/oqe0uS0GXW via @whitehouse", "view": 10}, {"title": "", "body": "@johnrobertsFox @JoeBiden Misleading half-quote. Fits with the Fox standard for \"reporting.\"", "view": 10}, {"title": "", "body": "@kayleighmcenany  Joe Biden was President in 2020? WOW! You need to check before you try to post lies!! #UnapologeticLiar", "view": 10}, {"title": "", "body": "@waltshaub @kamalaharris @VP @TeamPelosi @SpeakerPelosi @RepAdamSchiff @POTUS @joeBiden @SenWhitehouse @tedlieu @amyklobuchar @staceyabrams @katieporteroc @ChrisMurphyCT  @RonaldKlain @BetoORourke @TheDemocrats @SenSchumer @PeteButtigieg @RepSwalwell THIS!! THEY WILL SUCCEED NEXT TIME!!!", "view": 10}, {"title": "", "body": "Biden declara que no puede garantizar que EE.UU. logre pagar su deuda  El presidente de EE.UU., Joe Biden, afirmó que no puede garantizar que su país logre evitar un impago mientras el Partido Republicano no apruebe la propuesta de aumentar el techo de deuda  https://t.co/Td6bL3kNna", "view": 10}, {"title": "", "body": " https://t.co/g9zwA7F5pK @JoeBiden", "view": 10}, {"title": "", "body": "@urfavisprez @ANIME2YT Anything as long as its not Joe Biden.", "view": 10}, {"title": "", "body": "@TheScrum1 @Mauerback @thefloutist In the reams of social/MSM commentary on @JoeBiden two \"Build Back Better\" bills, there is very little discussion of what and how to actually build anything, most of it being on expanding the social safety net.", "view": 10}, {"title": "", "body": "@atrupar @StevijoPayne wait, he wants to fuck Joe Biden?", "view": 10}, {"title": "", "body": "Joe Biden Joe Biden Joe Biden Joe Biden Joe Biden Joe Biden Joe Biden Joe Biden Joe Biden Joe Biden Joe Biden Joe Biden Joe Biden Joe Biden Joe Biden Joe Biden Joe Biden Joe Biden Joe Biden Joe Biden Joe Biden Joe Biden Joe Biden Joe Biden Joe Biden Joe Biden Joe Biden ice cream", "view": 10}, {"title": "", "body": "🇺🇸🇫🇷Dans notre Médoc, la politique #AmericaFirst est bénéfique pour notre viticulture, les chiffres à l’exportation sont bons &amp;la suppression de la #TaxeTrump confirme nos relations historiques business friendly! @JoeBiden @SecBlinken @EmmanuelMacron @BrunoLeMaire @USAenFrancais  https://t.co/4Vy7ueVzru", "view": 10}, {"title": "", "body": "@FinisimaPersona .......Las energías renovables y a Joe Biden", "view": 10}, {"title": "", "body": "@JoeBiden We need 2000 fourth Stimulus check and Ubi or GBI or Adult tax credit monthly payments.We need the reconciliation bill and Infrastructure bill. passed.For all benefiaries and low income.A raise to our benefits.", "view": 10}, {"title": "", "body": "@beafk18 Frosty warns Joe Biden ? I think 🧐 the Tories have seriously disappeared up their own exhaust pipe ( euphemism for R’s hole )   Boris is so close to the Russians he and his cronies starting to act like them.", "view": 10}, {"title": "", "body": "YOUR GOVERNMENT IN ACTION FOR HONEST GOVERNMENT?? JOE BIDEN’S ADMINISTRATION BUILD BACK BETTER BILL THEY ARE PROMOTING ACCORDING TO THEM IS FULLY PAID FOR AND WILL NOT COST AMERICAN TAXPAYERS ANYTHING, EXCEPT THOSE MAKING OVER $200 THOUSAND A YEAR. CONTINUED", "view": 10}, {"title": "", "body": "@stucam7771 @kamalaharris @VP @TeamPelosi @SpeakerPelosi @RepAdamSchiff @POTUS @joeBiden @SenWhitehouse @tedlieu @amyklobuchar @staceyabrams @katieporteroc @ChrisMurphyCT  @RonaldKlain @BetoORourke @TheDemocrats @SenSchumer @PeteButtigieg @RepSwalwell WHAT R U DOING TO SAVE DEMOCRACY????", "view": 10}, {"title": "", "body": "@mikezuchowski2 @cbjkc5 @JoeBiden A: 🤣 bro what took you so long B: stop being a sheep and wake up C: again sheep yada yada", "view": 10}, {"title": "", "body": "Who’s ready to see some #FuckJoeBiden billboards start popping up all over the nation ? @JoeBiden @POTUS", "view": 10}, {"title": "", "body": "Instead, because of Joe Biden we had 13 K.I.A.  https://t.co/u0xRL2uUS9", "view": 10}, {"title": "", "body": "Chillin with Joe Biden #blessed  https://t.co/KsFSWvUrTQ", "view": 10}, {"title": "", "body": "@sfpelosi @JRubinBlogger @JoeBiden Then go to the RNCs website for their platform. *crickets*", "view": 10}]