[{"title": "", "body": "Former [Trump] Press Sec Tries to Repent for Years of Lying for Trump in Brutal CNN Interview - (10-05-2021)  Trump's ex-press secretary [Stephanie Grisham]  says [Trump's]  administration's handling of Covid-19 was 'tragic' - CNN - (10-05-2021)  [Trump White House Press", "view": 10}, {"title": "", "body": "*trump ... pun not intended, but appropriate.", "view": 10}, {"title": "", "body": "Trump's Georgia election meddling puts him 'at substantial risk of charges predicated on multiple crimes': legal experts  https://t.co/j0UGl1Ku4d", "view": 10}, {"title": "", "body": "Trump Will Be Hauled in for Questioning in Summer Zervos Lawsuit, Judge Says - The Daily Beast  https://t.co/CuElcblX4L", "view": 10}, {"title": "", "body": "@VAKnightStick @TheView @Alyssafarah Exactly. That’s all I had to hear in opening…”former communications director for the Trump White House”? You mean … Former Minister of Propaganda for the Trump White House! Hard pass! @Alyssafarah", "view": 10}, {"title": "", "body": "Georgia Secretary of State Brad Raffensperger Details Donald Trump’s ‘Threats’ and Infamous Phone Call  https://t.co/ydscW742Kk", "view": 10}, {"title": "", "body": "@PatrickSvitek He can’t wheel outta the governor’s mansion fast enough. His demand for a Tx vote audit shows him as the Trump toady he is.   And can I get an extra blanket? The buck stops with Abbott for allowing a loophole that lets natural gas suppliers avoid winterizing.", "view": 10}, {"title": "", "body": "What is happening to the Republicans?One answer is that the Party’s predicament might fairly be called the revenge of “the kooks.” In just four years, the G.O.P., a powerful, hundred-and-sixty-seven-year-old institution,has become the party of Trump.The Party Of Lies and Deceit .  https://t.co/QWVPE0U2ko", "view": 10}, {"title": "", "body": "@tedcruz Looks more like Trump's people.", "view": 10}, {"title": "", "body": "@laetitiakrupa @Abuisson991 Après, beaucoup d'électeurs républicains modérés on voté Trump précisément parce que derrière lui, il y avait le parti républicain. Zemmour n'a pas ça, et au bout d'un moment les aspects qui bloquent le RN (perception d'un manque de compétence et de personnel) le bloqueront.", "view": 10}, {"title": "", "body": "@berttaling Verandering is altijd mogelijk, wat ik op Trump tegen had, was dat hij, op een andere manier dan Biden, minder opvallend ook, het westen verzwakte.", "view": 10}, {"title": "", "body": "Mike Pence all but admits he's a whore for sicko Donald Trump.", "view": 10}, {"title": "", "body": "@CarlosEZuniga Mira un Trump - Sechin en el museo Max Uhle  https://t.co/dFPddLi7Dh", "view": 10}, {"title": "", "body": "The harm to individuals, families, communities is just incalculable. QAnon is antisemitic, fascistic bullshit that should have remained in obscurity on 8kun. Instead Facebook spoon fed it to Trump-supporting middle America. They knew they were doing it and they chose not to stop.", "view": 10}, {"title": "", "body": "@mvandemar @jennycohn1 @Davetepps @TheJusticeDept @FBI when they care more about the optics for Trump supporters than for us, we have a serious problem", "view": 10}, {"title": "", "body": "@mtgreenee Electing Trump started bad things that can't be un-done. Can't wait until you are voted out of office.", "view": 10}, {"title": "", "body": "\"Merrick Garland\" Conservatives on here going after Merrick garland for wanting to send in people to protect school board members from crazy Trumper’s. It appears you people still haven’t learned from the Civil War. The federal government trumps states. Get it through your skulls", "view": 10}, {"title": "", "body": "We haven't been all that bright since we elected Trump", "view": 10}, {"title": "", "body": "Criminal inquiry into Trump’s Georgia election interference gathers steam  https://t.co/WWBSSn6dZb", "view": 10}, {"title": "", "body": "GOP mega-donor says he wouldn't back Trump 2024  https://t.co/c7rDmYIfhe", "view": 10}, {"title": "", "body": "Trump has always lied about his worth. He probably never belonged on that list in the first place. He's just under tighter scrutiny now", "view": 10}, {"title": "", "body": "Bimbo and Bimbette will now lead Loser Trump's super PAC formed after @CLewandowski_  forced out due to his normal, ugly, bad behavior. Really smart replacements?  LOL   https://t.co/l1zjuP93nd", "view": 10}, {"title": "", "body": "@PalmerReport Totally agree that the media needs to stop chasing anything with a trump headline attached to it and start being reporters with integrity.", "view": 10}, {"title": "", "body": "@TheTwanfather @BenLumen Ah you're one of those \"only\" 700k are dead people aren't you? You clearly don't get it and clearly don't WANT to. FYI the vax will be available for 5 and up. That still leaves a vulnerable population.  Not that you care. Your \"rights\" trump all eh?", "view": 10}, {"title": "", "body": "@elliespoon13 @SenatorSinema @Sen_JoeManchin This continuation of harassment of Congress at their homes, their jobs and baseball games that started during Trump era. Now Marxists are coming from those in their own party.", "view": 10}, {"title": "", "body": "Statement by Donald J. Trump, 45th President of the United States of America  https://t.co/xFN5T5WBw8", "view": 10}, {"title": "", "body": "@nytimes If Trump made them richer...", "view": 10}, {"title": "", "body": "What is happening to the Republicans?One answer is that the Party’s predicament might fairly be called the revenge of “the kooks.” In just four years, the G.O.P., a powerful, hundred-and-sixty-seven-year-old institution,has become the party of Trump.The Party Of Lies and Deceit .  https://t.co/d967q9DKgl", "view": 10}, {"title": "", "body": "@MeaCulpaPodcast @jefftimmer Reality show with trump org guiliani the mooch hillary ole mitch and Michael cant wait", "view": 10}, {"title": "", "body": "@Mickey_Kelly @dzenna2000 @CiaraMmmm @MeghanMcCain Then why is he lying about it! Do your own research the facts are there! His own words in 2012 hcl works for all corona viruses! Why ban the cure hcl, ivmn! Follow the money! Wake up your selling your freedom because of your hate for Trump!", "view": 10}, {"title": "", "body": "\"Criminal inquiry into Trump’s Georgia election interference gathers steam | Georgia | The Guardian\"  https://t.co/ZVCKyDw6sq", "view": 10}, {"title": "", "body": "@rosesbloom24 I’m wondering if they feel above the law because Trump is their man. We’ll see soon enough, but Congress has the law on their side. Bannon can’t keep his mouth shut, so he keeps digging his hole.", "view": 10}, {"title": "", "body": "😂 I guess, by his own admission, @davidmweissman was showing his hate and ignorance. He may say Trump wasn't trying to improve our lives, yet one look at the country under Trump, then Biden, and it becomes clear who tried to IMPROVE our lives, and who's trying to CONTROL them.  https://t.co/Z4dMFiI3zq", "view": 10}, {"title": "", "body": "@OneDakineHowlie @sltrib @SenMikeLee That means Mike Lee has to go.  He doesn't get it.  He's sucked into the Trump/ MAGA  mentality, as are many.   Ergo, since political Slogans are what he understands,  I'll use them.  I doubt truth and logic, let alone brotherly love,  would have an effect at this point.", "view": 10}, {"title": "", "body": "Trump’s the biggest loser of 2020", "view": 10}, {"title": "", "body": "@kenjeong I try not to bring up my parents too much on here anymore, but my mother, a medical doctor, actually defended Trump over this.  I still can't even...", "view": 10}, {"title": "", "body": "Wer hat Lust ein wenig zu schreiben? #feucht #ficken #sex #dic #daddy #dick #horny #schwanz #spalte #vagina #gay #lesbe #penis #nass #onlyfans #sexting #spalte #vagina #mum #muschi #Minecraft #Roblox #Trump #geil #cum #kink #fetisch", "view": 10}, {"title": "", "body": "Today would be a good day to indict Donald Trump.", "view": 10}, {"title": "", "body": "“Jen Psaki charged that Republicans under President Donald Trump spent like ‘drunken sailors’ and unveiled a chart comparing the debt they incurred.”  #DrunkenSailors   https://t.co/vFvNKYME4K", "view": 10}, {"title": "", "body": "@MollyJongFast Make no mistake about it, the republican party is now the Russian party. They went all in with Russia under Trump.", "view": 10}, {"title": "", "body": "Trump Cult  https://t.co/dbUVA4WBsS", "view": 10}, {"title": "", "body": "Hahahahhahahahha, trump is a dumbass.", "view": 10}, {"title": "", "body": "@Hi_IQ_Trump @misterchambo @kksheld Stellar 😂", "view": 10}, {"title": "", "body": "EE.UU.: Trump queda fuera de la lista de los 400 más ricos por primera vez en 25 años  https://t.co/GesZqK5PSu", "view": 10}, {"title": "", "body": "Trump advisor told Steve Mnuchin he'd be 'the reason' the pandemic would never end: new book  https://t.co/cPWD9pfGmh", "view": 10}, {"title": "", "body": "Let's not forget this crybaby, little Steltie Weltie, and his 10 viewers each night. If President Trump made him cry himself to sleep every night, Poor Wittle Brian must really be crying these days.  https://t.co/zhM1g65Nkh", "view": 10}, {"title": "", "body": "Trump No Longer on Forbes List of Richest Americans  https://t.co/jklr8oxSZP", "view": 10}, {"title": "", "body": "@sjbailey1060 Food inflation was already rearing its ugly head before Trump left office.", "view": 10}, {"title": "", "body": "@jonasnuts Vejo tweets patrocinados (aliás, passo a vida a silenciá-los). E tweets com informação manipulada são mato (vide Trump e seguidores). Aqui, como no FB, tudo depende do empenho que colocas na afinação do feed. A única diferença que encontro é a snobeira, que lá não existe", "view": 10}, {"title": "", "body": "@DonaldJTrumpJr The good thing about Trump, DeSantis, Abbott preventing safe measures against covid is that, as these ignorant devotees continue to tempt fate, a huge number won't even be around for the 2022 or 2024 elections. It's called cleaning out the of ignorant people vene pool! Yippee!", "view": 10}, {"title": "", "body": "#BooHoo #OhMyEgo Guess who ain't so rich? Trump Tumbles Off Forbes Rich List After COVID Pandemic Slashes His Fortune. He only got on Forbes 500 by lying &amp; cheating.  https://t.co/WVTqMJIwug via @thedailybeast", "view": 10}, {"title": "", "body": "@The_Vickster2 @StaceyPlaskett @SenateGOP Lol, I'm sorry, I'd love to debate you directly but you can't even... Type. The Word. Trump.  Of course, that's her point, what is this fingerpainting with Psaki?  Use equal terms for comparison or you look like a fool", "view": 10}, {"title": "", "body": "What is happening to the Republicans?One answer is that the Party’s predicament might fairly be called the revenge of “the kooks.” In just four years, the G.O.P., a powerful, hundred-and-sixty-seven-year-old institution,has become the party of Trump.The Party Of Lies and Deceit .  https://t.co/3dYJZyNupt", "view": 10}, {"title": "", "body": "Current Culture - USA - October 2021  ...  Former [Trump] Press Secretary Stephanie Grisham Says She Regrets Enabling Trump's Lies - (10-04-2021)  [Trump Press Secretary] Stephanie Grisham says there was a 'culture of abuse' in the Trump White House - Daily Mail - (10-05-2021)", "view": 10}, {"title": "", "body": "@StaceyPlaskett @nutmeg3isme @SenateGOP She's right. I wonder if the majority of Trump supporters are capable of interpreting this graph. They probably think the bigger number is better.", "view": 10}, {"title": "", "body": "We did it was Donald Trump", "view": 10}, {"title": "", "body": "@tribelaw Ross is one of the most consistently wrong people in politics.  his opinion piece here is not just wrong but dangerous.  Trump and the party at enabled him are a fascist authoritarian threat which the press has gone out of its way to minimize &amp; dismiss.", "view": 10}, {"title": "", "body": "Statement by Donald J. Trump, 45th President of the United States of America  https://t.co/6NvbSl2gQe", "view": 10}, {"title": "", "body": "Ladies and gentlemen the former POTUS  reliving his MAGA brainchild I said'That is so good.' I wrote it down,\"Trump recalled in an interview.\"I went to my lawyers.I have a lot of lawyers in-house.We have many lawyers.I have got guys that handle this stuff  https://t.co/MVOgP2nTRX", "view": 10}, {"title": "", "body": "@statnews Trump.", "view": 10}, {"title": "", "body": "I think Trump is a fucking Stooge, but in a free country stooges should be allowed to speak freely", "view": 10}, {"title": "", "body": "@waltshaub Grisham didn't bother RESEARCHING TRUMP. It should have been clear they were corrupt criminals whose occupancy of the White House was meant, first and foremost, to ENRICH THE TRUMPS and SELF-AGGRANDIZE FOR THE TRUMPS w/FUTURE BUSINESS OPPORTUNITIES. Her ignorance was no excuse!!`", "view": 10}, {"title": "", "body": "@iamproudamericn @krispynchewy @sward1458 @TheQuie68743839 @SteveScalise @MELANIATRUMP That’s nonsense. They’ve reported on many books that trash Clinton. You’re making things up. That’s your perception based on YOUR view that Trump was great and how dare his former associate trash him. It must not be true right? After all you love him.", "view": 10}, {"title": "", "body": "Trump and Melania were 'totally unfazed' by abuse allegations against White House staffer: new book - Raw Story - Celebrating 17 Years of Independent Journalism  https://t.co/4WdSHLuRTT", "view": 10}, {"title": "", "body": "Why are people STILL talking about Trump with their bullshit arguments? Look at who’s in office NOW. AND FOCUS ON HIM.", "view": 10}, {"title": "", "body": "Hey,remember Trump and the Republicans created this problem with their huge tax break for the rich and corporations..  now it is our turn.  Get rid of that tax break. They need to pay their fair share!!! Period.  End of discussion! Get rid of the filibuster.", "view": 10}, {"title": "", "body": "Shit happens; then you go to prison if you are a trump insurrectionist.   Tick tock...", "view": 10}, {"title": "", "body": "U r seriously underestimating trump’s ability to stash his money in hidden accounts off shore, etc. his MO is to ALWAYS use other ppl’s money. This is a guaranteed fact. He’s been doing it all his life.", "view": 10}, {"title": "", "body": "@donie Zuck holding the flag makes me nauseous.  Reminds me of every truck with a U.S. flag and trump 2024 driving through our town.  Another reason I’m glad I’ve never had a Facebook account.", "view": 10}, {"title": "", "body": "He said a few months ago that he wanted the GOP in congress to oppose every think the Democrats put up. The GOP have come very close to that ever since. Trump's games are a useful diversion to what the GOP is doing in the Capital Building.", "view": 10}, {"title": "", "body": "There's a certain segment of dumb podcast left guys that say \"GOP gets what they want when they have majorities Dems don't want to pass anything\" that will just ignore the fact Dems are on track to get more down than GOP did under Trump with smaller majorities! ACA repeal failed!", "view": 10}, {"title": "", "body": "DHS has a habit of ignoring Democratic presidents to do basically whatever they want with immigrants.   Then when Republicans take power the agency destroys as many immigrants as it can as quickly as it can while Democrats Trump at the need for reform.   This is the cycle.  https://t.co/zvAmTw9HGv", "view": 10}, {"title": "", "body": "@kylegriffin1 Rs also think illegal immigrants never show up for court hearings - so why did Trump hire 200+ new immigration judges and open 60+ new courts? A lot of resources for people who “never show up”.", "view": 10}, {"title": "", "body": "Donald Trump has tumbled out of the ultra-exclusive Forbes 400 list of America’s richest people for the first time since making it on in 1996, worth $400 million shy of this year’s cutoff,  https://t.co/KxITnBlTq2", "view": 10}, {"title": "", "body": "@SouthpawBeezo @KingstonClyde @OANN I watched Jan 6 terrorist attack live. Benghazi was military. More people died Jan 6. But you are ok with trump lying about the virus? The president of the United States of America caught on camera lying about a pandemic and that’s fine with you. Ok I understand your intellect 👍", "view": 10}, {"title": "", "body": "Trump and the GOP spent $8 Trillion in 4 years, $2.6 Trillion and counting in a 20 year war they ended in 2020 by releasing 5,000 members and the cofounder of the Taliban, the same people we spent that money and our troops lives to capture to free Afghanistan. WAKE UP PEOPLE!!!", "view": 10}, {"title": "", "body": "@JeffOnTheRight @Myish1 Dude we aren't there in his face to say what he is or isn't doing. You believed HE FLAT OUT denied funding and passed around via your biased  chosen media outlet. That's not cool. At least I gave Trump credit for 3 things he did that I favor.", "view": 10}, {"title": "", "body": "@TheJusticeDept All of these things are important, but what about charging Donald Trump for Russian interference in the United States elections? Bribery? Giving aid and comfort to the enemy? Does he actually have to shoot someone in Times Square?", "view": 10}, {"title": "", "body": "@Franklin_Graham But aren't you one of those who claimed only Trump could save it?", "view": 10}, {"title": "", "body": "Go dig up every single silly thing every liberal ever said about Trump being a bully and make them eat their own words.", "view": 10}, {"title": "", "body": "Tesla, Rivian, Trump e altro: le 5 notizie del weekend Da Benzinga Italia  https://t.co/xUQ4Cr3jmg", "view": 10}, {"title": "", "body": "@BenDen25 @Raycerx58 @Judson4Congress @GOPChairwoman Thanks to much effort from Trump Biden has done nothing but clean up disasters trump set for him.", "view": 10}, {"title": "", "body": "what do Trump wanna tweet so bad? imagine going to court to tweet 🤦🏾‍♀️", "view": 10}, {"title": "", "body": "Trump demanded 'personal information on voters' during threatening call to Georgia's Raffensperger: new book - Raw Story - Celebrating 17 Years of Independent Journalism  https://t.co/o0XxufwSjF", "view": 10}, {"title": "", "body": "What is happening to the Republicans?One answer is that the Party’s predicament might fairly be called the revenge of “the kooks.” In just four years, the G.O.P., a powerful, hundred-and-sixty-seven-year-old institution,has become the party of Trump.The Party Of Lies and Deceit .  https://t.co/ILzsfQLSo7", "view": 10}, {"title": "", "body": "What a Surprise: Top Obama Official is Advising Anti-Trump Facebook 'Whistleblower'  https://t.co/UoR1JcW4xt via @gatewaypundit", "view": 10}, {"title": "", "body": "He is back on FB! #Trump  https://t.co/cyWaEp572h", "view": 10}, {"title": "", "body": "@EvanMcMullin A trump Patriot!  Another republican wanna be", "view": 10}, {"title": "", "body": "@lindastwts @LHMSolutions @falconsview @POTUS Funny Linda. No personal attacks on commenters except from you, obviously anti-Trump. Criticism of the administration is one thing but you clearly have zero class.", "view": 10}, {"title": "", "body": "@WitchesFor @NoobRydar Witches, I understand that feeling. I have family members, many with whom I have positive relationships and experiences with, that sadly voted Trump. I've had my arguments with them. Months of not talking. And it sucks.  Minds rarely change until we meet ppl where they are.", "view": 10}, {"title": "", "body": "Trump No Longer on Forbes List of Richest Americans: Former President is no longer on the Forbes list of America’s richest people. According to Forbes 400, Trump’s fortune dropped to $2.5 billion, which is $400 million short of the cutoff needed", "view": 10}, {"title": "", "body": "Trump did this. #GQPDeathCult 💀", "view": 10}, {"title": "", "body": "@TheView @Alyssafarah So is Alyssa going to be interviewed today or a co host. Any former Trump admin is not a good look. Is she on your list?", "view": 10}, {"title": "", "body": "Ah, #Donald -- the irony.    \"One decision #Forbes said cost Trump $2 billion was hanging on to his assets when he took office in 2017. If he would have put the money in an index tracking fund, he could have earned $4.5 billion by 2021.\"   https://t.co/mNXVHj8O7e", "view": 10}, {"title": "", "body": "@Mike_Pence Gaslighting Bum! January 6th was an attempted \"Coup\"! You know it, we know it quit \"Lying\" to gain favor with Trump voters!", "view": 10}, {"title": "", "body": "IMAGINE BELIEVING THERE IS SUCH A THING AS \"TRUMPISM\",  AS A POLITICAL MOVEMENT?!  A TRUMPISM, WOULD IN FACT BE A QUOTE, SOMETHING TRUMP SAID YOU KNOW, LIKE \"MAKE AMERICA GREAT AGAIN\" OR \"DRAIN THAT SWAMP\" THINGS OF THAT NATURE.", "view": 10}, {"title": "", "body": "@Ard_Amsterdam @ImiPov @CortesSteve Let's see you attempt to prove it wrong. Y'all say we need a safe space but you just need to walk around with shotguns and rifles while in a target. Cannot accept that Trump lost and constantly cry fraud with no proof. We know who the real snowflakes are lol", "view": 10}, {"title": "", "body": "Trump is not eligible for office.", "view": 10}, {"title": "", "body": "@heKtikIstOxIc @KyleKulinski During election by democratic process. Otherwise it's anarchy. Imagine if Trump supporters just beat up the opposition politicians to sign all the bills that Trump and Republicans wanted. What then. Democracy is a system of governance, you either follow or don't at all.", "view": 10}, {"title": "", "body": "What is happening to the Republicans?One answer is that the Party’s predicament might fairly be called the revenge of “the kooks.” In just four years, the G.O.P., a powerful, hundred-and-sixty-seven-year-old institution,has become the party of Trump.The Party Of Lies and Deceit .  https://t.co/AA8krJZgE0", "view": 10}, {"title": "", "body": "@J_Mei21 People who get to know Trump,  really end up hating his guts. So glad he no longer matters.  #TrumpMob", "view": 10}, {"title": "", "body": "@TheDemCoalition According To Records Today, Trump's Fortune Is Actually A Pile Of Debts. Current Estimates Are His Family Business Is $1.2 Billion In The Hole Right Now. 😉", "view": 10}, {"title": "", "body": "Biden administration reverses Trump rule against abortion referrals  https://t.co/TVIsDWVSiu", "view": 10}, {"title": "", "body": "@Brand_pandit1 @AAOLion @AtulAdlaw @Minakshishriyan @shuklaapinku @Apshre333 @chota_trump @labdhi__B143 @Divya2550 @Ishabajaj00 @UshaVer57739992 🙏🙏", "view": 10}, {"title": "", "body": "@KarlsenStanley @DonaldJTrumpJr You can list all the things that you think obama did wrong and I guarantee you my list would make yours look like child's play. Let's talk about left to die. What about the thousands of Kurds that were our allies being left to slaughter by the Turkesh army. Trump did that", "view": 10}, {"title": "", "body": "He sold designer drugs with the figure of Donald Trump  https://t.co/wBhtLSCefS", "view": 10}, {"title": "", "body": "January 2021 - during the last month of President Trump’s Administration - we hit ZERO barrels of oil imported from the Middle East. We have the oil! What’s preventing us from $7/gallon in coming months like the UK? Biden/Harris Admin is choking the American People… on purpose!  https://t.co/UsS4me02oY", "view": 10}, {"title": "", "body": "Donald Trump loses place on Forbes rich list for first time in 25 years – The Independent  https://t.co/hZamM47qWo", "view": 10}, {"title": "", "body": "@SenBillCassidy @POTUS Inflation is transient as a result of supply bottlenecks largely due to the pandemic.  Chair of the fed (nominated by Trump btw) said as much on the briefing last week.  I assumed you watched &amp; are using buzzwords to trick uninformed ppl. Either that or you didn’t watch &amp; are FOS", "view": 10}, {"title": "", "body": "@SaltyFoulMouth @Mike_Pence Are you for real? NEVER TRUMP", "view": 10}, {"title": "", "body": "Trump Tumbles Off Forbes Rich List After COVID Pandemic Slashes His Fortune - The Daily Beast  https://t.co/jzOFxyjS9W", "view": 10}, {"title": "", "body": "SHOULD HAVE BEEN YEARS plus RESTITUTION  Trump's judges are not dolling out harsh enough sentences, go figure!🙄", "view": 10}, {"title": "", "body": "Criminal inquiry into Trump’s Georgia election interference gathers steam  https://t.co/wd6GSjQzSn via @Yahoo", "view": 10}, {"title": "", "body": "@Sheer_Light @jsolomonReports @BernardKerik I'm thinking Trump supporters are. They don't want to pay for our past debt obligations, which is what raising the debt ceiling does. It's not for future spending. So, Trump spent all those trillions last year and MAGAs don't think we need to pay for it.", "view": 10}, {"title": "", "body": "So this guy reports that Trump is gone as he writes a report about him.  Too funny.  They need him.", "view": 10}, {"title": "", "body": "@nycookie15 @TifanyRobb10 @AmerMilNews Trump bumper stickers.", "view": 10}, {"title": "", "body": "@hojetapesado tem so duas provedoras boas de equipamento: a ericsson (ou a nokia?) e a huawei. o chines eh melhor e mais barato, mas o trump queria forcar o brasil a barrar, com a desculpa de espionagem. o bozo caiu na onda pois sinofobico. mas parece que andou perdendo umas brigas ai", "view": 10}, {"title": "", "body": "Trump has gotten away with the crimes of the modern century without a slap on the wrist. So much for Law and Order. If I believed in the system I sure don’t now! Trump will take down the United States Democracy and literally get away with it….", "view": 10}, {"title": "", "body": "Trump Cult  https://t.co/DA6eKwLUtb", "view": 10}, {"title": "", "body": "@NanaMac1993 @bethejoy2 @Texas_Ranger_US I am so sorry.  My daughter and grandson are not vaccinated but I am due to health risk and VA, we go to each other’s houses.  We think Fauci is either an idiot, a liar, has mental problems or all.  But we know Fauci on national TV (2017) tell Trump he would have a Pandemic.", "view": 10}, {"title": "", "body": "Good for her tear zuckerberg a new one he’s nothing but a spineless twit who helped trump get elected in 2016 along with Putin ,and tried to do it again in 2020.", "view": 10}, {"title": "", "body": "What is happening to the Republicans?One answer is that the Party’s predicament might fairly be called the revenge of “the kooks.” In just four years, the G.O.P., a powerful, hundred-and-sixty-seven-year-old institution,has become the party of Trump.The Party Of Lies and Deceit .  https://t.co/mMPSMd9QJ8", "view": 10}, {"title": "", "body": "@WannaFacett While it's hard to feel sorry for her, she does have interesting inside information about what went on behind closed doors during the Trump years. None of it surprising, BTW.", "view": 10}, {"title": "", "body": "@RepLeeZeldin @SenatorSinema @Gutfeldfox THE GQP LIES TRUMP ORDERS AFGHAN WITHDRAWL, BLAME BIDEN GQP GIVES TRILLIONS TO RICH AND CORPS, BLAME INFRASTRUCTURE GQP BELIEVES JESUS WAS A SNOWFLAKE GQP WANTS NO MASK OR VACS, MAKES YOU CARRY RAPIST'S BABY GQP BUILT WALL IN DC JAN 6, TRUMP WALL FAILING  https://t.co/9KNDX7Ju6N", "view": 10}, {"title": "", "body": "Top GOP Donor Says He Wouldn't Back A Trump 2024 Run: Time To 'Move On'  https://t.co/wU5C6a4lE3 via @Yahoo Hopefully TRUMP will pass the torch and his policies to someone else. DEFEAT COMMUNISM", "view": 10}, {"title": "", "body": "@fritzzy66 @TheView @JujuChangABC I'm sick of hearing about Trump just as much as you. He lost right??? If so then let's focus on what's in front of us and not was in the rear view!!! 🤪🤪🤪🤪", "view": 10}, {"title": "", "body": "Pence says media focus on Jan. 6 insurrection is to ‘demean’ Trump supporters  #PenceBookmark     https://t.co/xrUUV8XsJF", "view": 10}, {"title": "", "body": "Trump Tumbles Off Forbes Rich List After COVID Pandemic Slashes His Fortune  https://t.co/K6aw5rfREy via @thedailybeast", "view": 10}, {"title": "", "body": "@Ard_Amsterdam @CortesSteve LOL That one is good . . . Its the Equivalent of \"Trumps \"Many People are saying", "view": 10}, {"title": "", "body": "@coxashton82 @VerifyThis @kare11 The facts are: Biden received 8 million more votes than Trump and won the election. I know that triggers you losers, but that’s how a democracy works. Don’t like democracy? Move to a country ruled by a totalitarian regime.", "view": 10}, {"title": "", "body": "@leighkeystone @XxJudexX @AngelaRayner Perhaps @Facebook and @Twitter should be looking at @angelarayner incitement of violence and ban her like they did with trump", "view": 10}, {"title": "", "body": "CNN‘s Cooper Pushes Back on Excusing Sinema Bathroom Confrontation: Would Reaction Be Same if Trump Supporters Did That to Pelosi?  https://t.co/jKOBMNdRwz via @BreitbartNews", "view": 10}, {"title": "", "body": "@ToneVays @JimmyRed17 @GovRonDeSantis @govkristinoem @CynthiaMLummis @RandPaul @RonPaul @RepThomasMassie Trump will be elected for the 3rd time, enough of the politicians!!!!", "view": 10}, {"title": "", "body": "@abigailmarone Trump made a bad deal telegraphing our moves. There were consequences to that poorly executed diplomacy. Just because you don't choose to live in reality doesn't mean everyone else does.", "view": 10}, {"title": "", "body": "@LowProfile1906 @FrankLucas76 @vanz1965 @BlackMadgik @chluke1967 @JudgeJoeBrownTV @dogmanp_sparks @BlackHockeyClu1 @WmWallace1911 @CNN @MSNBC @washingtonpost @SheriffClarke @NationalSheriff @jasonrileywsj Please tell what have Democrats or Joe Biden done for our community? At least Trump was trying to improve our community!", "view": 10}, {"title": "", "body": "Seriously? A  man who groveled in front of Trump for 4 years and would allow himself to get hung is lecturing us about weakness? That's rich.", "view": 10}, {"title": "", "body": "@GarrettHaake @SenatorSinema I’m glad that media is finally catching on to how Sinema has ignored her constituents for the past year. I once called her office to ask Sinema’s position on Trump’s first impeachment hearing and her staff referred me to her comments from a nonexistent article.", "view": 10}, {"title": "", "body": "No. Some of us are &amp; have been listening to them. But all they keep saying are parroted LIES told to them by Trump and Republicans on Right Wing Tabloid ENTERTAINMENT Media calling themselves NEWS to add credibility to their BS", "view": 10}, {"title": "", "body": "Melania Trump’s Reported Nickname from Secret Service Says A Lot About Her Time at the White House  https://t.co/ZSfwUFlDYm via @sheknows", "view": 10}, {"title": "", "body": "What is happening to the Republicans?One answer is that the Party’s predicament might fairly be called the revenge of “the kooks.” In just four years, the G.O.P., a powerful, hundred-and-sixty-seven-year-old institution,has become the party of Trump.The Party Of Lies and Deceit .  https://t.co/Cx87t6JSeu", "view": 10}, {"title": "", "body": "The Biden Administration has maintained draconian measures that Trump put in place. Title 42 is denying people their human rights and antithesis to our American values-- Excellent piece by @mikehposner What America Owes Haitian Asylum Seekers  https://t.co/500cvXfNW7 @dkearney_29", "view": 10}, {"title": "", "body": "Remember I didn’t seek Fylnn out he sought me out. I worked with him and military intelligence as I did with Trump. Always with the promise that they would make this evidence public.They would tell the American people the true depth of corruption.I’m waiting! @State0fCorrupt", "view": 10}, {"title": "", "body": "@mikepompeo “Take the vaccines” Trump, 21 August 2021", "view": 10}, {"title": "", "body": "@OKBuckSlayer @RonnyJacksonTX @alliemarie777 And Trump trash be like “It really does taste like a Cheeto covered mushroom”.", "view": 10}, {"title": "", "body": "TODAY: De-Facedbook #Facebook #Instagram #WhatsApp #NFT #Art #HobbyLobby #HunterBiden #Biden #Trump #SiliconValley #Bezos #PandoraPapers #ClimateChange #NobelPrize #Qanon #SchoolBoards #TeachersDay #China #Russia #OilSpill #Extinction #Environmentalism  https://t.co/jvyDVgYUEk", "view": 10}, {"title": "", "body": "@rogerharford @viva_libertad34 @IslandGirlPRV @RepThomasMassie It’s the Ron Paul fallacy. Libertarians had to agree with 100% of what Ron Paul did or said. Therefore, if you are “only” defending an orange failure 99%, to you, that means you are not a trump supporter.  Comforting thoughts I guess.", "view": 10}, {"title": "", "body": "@WalshFreedom No. Some of us are &amp; have been listening to them. But all they keep saying are parroted LIES told to them by Trump and Republicans on Right Wing Tabloid ENTERTAINMENT Media calling themselves NEWS to add credibility to their BS", "view": 10}, {"title": "", "body": "@retrover16 It may not be the way or what it seems. I trust Trump &amp; his backing all Military &amp; Police, frontliners. Keep watching.", "view": 10}, {"title": "", "body": "@NBCNews Ha , Ha , and Trump didn't get one !  https://t.co/29Tj11mclc", "view": 10}, {"title": "", "body": "@maklokgai @Samhker @dents_d_acier 支持trump的法国人不厌恶美国，就喜欢资本主义的铜臭味", "view": 10}, {"title": "", "body": "@IX_Christner Right, it’s so asinine for these people to try and rehab themselves.  It’s not like Trump ever hid who he was or his intentions. If you joined that administration you knew what it was.", "view": 10}, {"title": "", "body": "@Seanopolis1 @dgozinia919 @SamBrockNBC The reason there were bad stories about Trump is because he was a terrible President.", "view": 10}, {"title": "", "body": "@CortesSteve Maybe for some people the idea of Trump is favourable to the experience of Trump?", "view": 10}, {"title": "", "body": "@RealLoriJT @HansMahncke I do think some of the people Trump relied on were not worthy of his confidence.  But I also think he - in some respects - is a man of second chances. If a person has been on “the wrong side” in the past, it doesn’t rule out the possibility that he can “redeem” himself now.  1/2", "view": 10}, {"title": "", "body": "@pattonoswalt @PrettyGonzo He floated having it named after himself. Was thoroughly disgusted by his arrogance. Hind sight really is 20/20. Normal folks still would have taken it, and his acolytes would have too. Of course, they would have wanted to pray while taking the “blood of Trump”. Communion 2.0!", "view": 10}, {"title": "", "body": "Stephanie Grisham: I told the Trumps my relationship with a White House staffer had turned abusive. They didn’t se…  https://t.co/qxzd6AQlsr", "view": 10}, {"title": "", "body": "#TRUMP #DARKMONEY 501(C) #AMERICAFIRST  #TRUMP CAMPAIGN #RNC", "view": 10}, {"title": "", "body": "@CBSNews Is she OK with Facebook silencing Trump, pro-Trump voices?", "view": 10}, {"title": "", "body": "@EnderSkoom Biden supporters? Nah, Biden's got nobody on his side it was just people who wanted Trump out-", "view": 10}, {"title": "", "body": "That is why Trump picked Mike as his running mate…  https://t.co/iFLciT6OJD", "view": 10}, {"title": "", "body": "@davidmweissman No they just want to be jerks.  Those that still support Trump in particular.", "view": 10}, {"title": "", "body": "I don’t know how I feel about people who were in the trump WH, loyal to a fault, spreading his false narrative and putting people in serious danger who now write tell-all books about how horrible it was. I totally believe it was horrific, but why now? Why not then? I’m just torn.", "view": 10}, {"title": "", "body": "@TomJChicago The only dementia patient is Biden 😂 but either one isn’t any good but at least trump knew what he was talking about", "view": 10}, {"title": "", "body": "@V4MP1R3M0N3YY @NewDay @clarissaward Oh, it's' over. Trump Lost! LOL", "view": 10}, {"title": "", "body": "Blaming the media for 1/6 it was Trump Barr and you. You are a spineless pc of wannabe Christian. God knows you helped a criminal President knowing that you were wrong. No confidence!", "view": 10}, {"title": "", "body": "What is happening to the Republicans?One answer is that the Party’s predicament might fairly be called the revenge of “the kooks.” In just four years, the G.O.P., a powerful, hundred-and-sixty-seven-year-old institution,has become the party of Trump.The Party Of Lies and Deceit .  https://t.co/r0YspBK7t1", "view": 10}, {"title": "", "body": "@TucTap It's Trump nation  https://t.co/om5VlnCZoS", "view": 10}, {"title": "", "body": "@Mac95731479 @Jim_Jordan Bleach injections are the Trump vaccine, I’ll concede that…", "view": 10}, {"title": "", "body": "APPEAR AS IF HE'S PUTTING FEMALES IN AN IMPORTANT ROLE FO RHIS 2024 RUN AT PRESIDENT!!! TRUMP IS ONCE AGAIN USING DECIET AND A BIG FAT SMOKE SCREEN TO MAKE AMERICANS BELIEVE HE RESPECTS WOMEN!!! YET ANOTHER BULLSHIT LIE BY TRUMP; WHEN EVERYONE KNOWS HE HIRED A PORN STAR FOR SEX", "view": 10}, {"title": "", "body": "New Trump super PAC formed after accusations of misconduct  https://t.co/2v3LVJ6349 DOES ANYONE ELSE SEE WHAT TRUMPS TRYING TO PULL HERE??? TRUMP HAS THREE FEMALES HEADING THIS SUPER PAC; TRUMP LOST THE LAST ELECTION BECAUSE OF THE FEMALE VOTES HE DID NOT GET!!! TRUMPS MAKING IT", "view": 10}, {"title": "", "body": "Trump is back on Facebook????  🤔", "view": 10}, {"title": "", "body": "@TinaChi52774847 @AZGOP Not a vaccine like trump aint a president ...", "view": 10}, {"title": "", "body": "#ELB: “Group asks DC court panel to investigate DOJ official who peddled false Trump election claims”  https://t.co/7Am9oi4Ri3", "view": 10}, {"title": "", "body": "@WHO ridiculous how Pfizer got approved in free weeks and Covaxin is taking so long! Was Mr. Trump right about @WHO ? I started to believe that… $OCGN", "view": 10}, {"title": "", "body": "Criminal inquiry into Trump’s Georgia election interference gathers steam #SmartNews   https://t.co/PuOSVQ6aHK", "view": 10}, {"title": "", "body": "@TheView Why would you have someone from the Trump Administration on the panel? Were all of the Proud Boys busy?", "view": 10}, {"title": "", "body": "Does anyone ever think that Trump realizes that 74M people voted for him in 2020 but 82M voted AGAINST him? Delusional or a perfect example of the Dunning- Kruger effect?", "view": 10}, {"title": "", "body": "@NewEnglandSun @catturd2 @TheAliceSmith Wow! I was unaware that Donald Trump wanted to destroy my life! Can you explain his diabolical plan to us? I mean, I agree that he looked like an evil villain, but how was he planning to destroy my life? Was Pence involved?", "view": 10}, {"title": "", "body": "@kelliwardaz @WendyRogersAZ What does the loser have to offer ?   Trump lost because people do not like him....  It's not the machines ballots or illegals", "view": 10}, {"title": "", "body": "If you haven’t subscribed to MoJo, you should take a look. Great, honest journalism. David Corn has a new post and those are always great. What happens when local election administrators believe Trump's big lie?  https://t.co/KMdIgDQGLP via @MotherJones", "view": 10}, {"title": "", "body": "@PoulpeShadow @AdontioII Vous n'en savez rien. Vous imaginez Trump ou Bolsonaro botter en touche pudiquement sur le sujet ?", "view": 10}, {"title": "", "body": "@schwindaddy @shaygitz1 @dawall @richardhine @GOP The CARES package was for 2.2 trillion last year.   Another 1.2 trillion for wallstreet bailouts.   What did Trump do with the the other 5 trillion in 3 years?  Did you look at the graph?  https://t.co/0TkoAVepFe", "view": 10}, {"title": "", "body": "@Mike_Pence @seanhannity Trump and Putin must have some interesting shit on you.", "view": 10}, {"title": "", "body": "Anyone who worked for the Trump Administration should be considered a traitor of our democracy and should not be given a seat at the table... @TheView ... this is shameful and WRONG!", "view": 10}, {"title": "", "body": "@YNB Don't you know that money is supposed to trump (pun intended) all things? That's the problem with the super rich running for the highest office w/absolutely no political experience. They assume they can buy an election. Yang assumed he could buy a Dem position. Worked for the GOP", "view": 10}, {"title": "", "body": "@seanhannity Republicans are just used to mayhem under trump. They know nothing could be that bad.", "view": 10}, {"title": "", "body": "@gayleasher1 @BlueFutureNow Thank you. I’m personally not in the US, but, like many Europeans, I am watching closely from across the pond since the election of Trump. I hope they can turn more states blue.", "view": 10}, {"title": "", "body": "Did Trump get the vaccine?", "view": 10}, {"title": "", "body": "@OnetWiadomosci \"Fort Trump\" pamiętamy. 😎", "view": 10}, {"title": "", "body": "Biden reverses Trump rule on abortion. Becerra blabbers from the far reaches of the Left. Again. #Becerra on #Abortion from the #Left   https://t.co/UTNEMa47Ne", "view": 10}, {"title": "", "body": "@ChrisCillizza Trump to Pence on Jan. 5, 2021:  \"Mike, you can do this. I don't want to be your friend anymore if you don't do this.\"", "view": 10}, {"title": "", "body": "Willams said Trumps “potential violations of GA law prohibiting the solicitation of election fraud, making of false statements to state &amp; local gov bodies, conspiracy, racketeering”  Criminal inquiry into Trump’s Georgia election interference gathers steam  https://t.co/HELnPncHhF", "view": 10}, {"title": "", "body": "Stanley has full on Trump hair", "view": 10}, {"title": "", "body": "@waltshaub @NewDay   Why is anyone giving this Trump enabler any face time?  She's in it for the $$$", "view": 10}, {"title": "", "body": "@Jim_Jordan The key word is family. Biden just reversed Trump’s position on abortion. Biden, the Catholic in name only, should now be excommunicated. Why isn’t his agenda being challenged by all the religious. He continuously places no value on life here and abroad.", "view": 10}, {"title": "", "body": "Voters With “No Record” Far Outweigh Donald Trump’s “Losing” Number In Arizonar-in-arizona/ via @Freedom Beacon # Would anyone who is honest expect the lying news media to report the real facts? NO And the feds will do nothing because it keeps them in power, what it is all about?", "view": 10}, {"title": "", "body": "What is happening to the Republicans?One answer is that the Party’s predicament might fairly be called the revenge of “the kooks.” In just four years, the G.O.P., a powerful, hundred-and-sixty-seven-year-old institution,has become the party of Trump.The Party Of Lies and Deceit .  https://t.co/9wjFNxJWPa", "view": 10}, {"title": "", "body": "@que_explique @VctorZurita11 @carlosjcani Por eso si quisieron sacar a Trump de encima el beneficiaba a las fábricas que volvían al país y tenía un plan  que se lo truncaron .", "view": 10}, {"title": "", "body": "@jimsciutto No. The GOP  is only threatening the social media companies as a way to turn them into 100% mouthpieces for right wing propaganda. They are mad that Trump was kicked off, but they are happy that Facebook is used as a platform for destabilizing democracy.", "view": 10}, {"title": "", "body": "\"This is right out of their playbook,\" said author and former White House press secretary Stephanie Grisham after insults from Melania Trump. \"When they don't like the message, they destroy the messenger.\"  https://t.co/QzBjiZkqQY # via @HuffPostPol", "view": 10}, {"title": "", "body": "@EastCoastalDB I love all the trumps..... Except that one weirdo niece 😉", "view": 10}, {"title": "", "body": "Trump's bill was 1.5 trillion. The goal was always somewhere closer to that.", "view": 10}, {"title": "", "body": "@ybmuck Trump ne demişti bir hafta önce 3 yıl içinde Amerika diye birsey kalmiycak...", "view": 10}, {"title": "", "body": "Trump pasa una discreta Navidad en Florida  https://t.co/ne0mxrEEqT", "view": 10}, {"title": "", "body": "@MamelaFialloFlo @nytimes So is extending Secret Service Protection to Trump and his family.  You don't get a choice about the referrals.  The Hyde amendment blocks the payment of abortion through federal funds.  When  women and the men who love them choose to pay for it on their own you don't get a say.", "view": 10}, {"title": "", "body": "@Mike_Pence Trump could buy a more obedient lapdog than Mike Pence @Mike_Pence  https://t.co/fddR77ILt5", "view": 10}, {"title": "", "body": "It will always be about Trump. Forever .   The man lives rent free I their heads .", "view": 10}, {"title": "", "body": "So because Mitch McConnell acquitted Trump on both impeachments and insurrection and attempted coup because it was political instead of legal he can get away with it and Trump doesn’t have to be accountable for his actions? That’s total bullshit!!!", "view": 10}, {"title": "", "body": "@SwingMillennial @NRO @RameshPonnuru Yes, but you see, there were safeguards. And unlike all the other safeguards that Trump ignored, and the GOP confirmed were ignorable, this time would have been different.", "view": 10}, {"title": "", "body": "Trump needs to wait until after 2022.  No sense in running if the House is not in play.  He will be a lame duck.", "view": 10}, {"title": "", "body": "@TheRickWilson Oh lord when is Trump going to stop taking the money of poor undereducated red necks 🤦‍♀️🤣😜🤣", "view": 10}, {"title": "", "body": "One can only wonder what it is that alienates Trump supporters from the rest of humanity. Perhaps they only want everyone else to be as miserable as they already are rather than trying to resolve their own misery. It would explain their hatefulness.", "view": 10}, {"title": "", "body": "#8Trillion$$ by #Trump &amp; @Senategop @Housegop approved the LAST4yrs has to be PAID for NOW! Duh you effin' idiots, quit playin' #RussianRoulette with our economy!", "view": 10}, {"title": "", "body": "\"Former Press Sec Tries to Repent for Years of Lying for Trump in Brutal CNN Interview\".  https://t.co/wlEC83I2Nc  To read it on the web, tap here:  https://t.co/LYesIe3U8e", "view": 10}, {"title": "", "body": "@FromidahoI @loriduan @DishCommish @TriNguyenLive @POTUS That gotta sux, Trump was President for an entire year and  you can only come up with 1 or 2 things he did to prevent the spread of a deadly virus .", "view": 10}, {"title": "", "body": "@V2JerChaL8cl1YO Trump作品についてのご意見のことですか？？", "view": 10}, {"title": "", "body": "@Mike_Pence TRUMP ADDED 8 TRILLION DOLLARS TO THE NATIONAL DEBT. TRUMP DESTROYED THE COUNTRY WHILE BIDEN IS TRYING TO SAVE IT.", "view": 10}, {"title": "", "body": "@Willie700WLW Does this mean your willing to talk about Trumps taxes now? Lol", "view": 10}, {"title": "", "body": "@thehill Do you mean how the media and politicians politicized the virus? How they were blinded by their hate for Trump?  How Biden/Harris said they wouldn't take the vaccine if Trump pushed it? Or how Fauci said masks didn't work. #NotaTrumper #thisiswhatyouget", "view": 10}, {"title": "", "body": "The Democrats are failing!  This weal and foolish infighting is doing this nation not a bit of good!  We need to proceed!  And we need to be prosecuting a dangerous Trump and several Republicans ASAP!  Get it done!", "view": 10}, {"title": "", "body": "@not_now_todd @Alanlsg No Mike , the media’s attention on the capital riots is to show the American people what a dangerous and utter mess trumps presidency actually was.. I wonder what you’d be saying if the rioters actually got ahold of you", "view": 10}, {"title": "", "body": "@mikepompeo Vote 🗳 ?  Really mike  Whatdamatteryou?  Do u realize what and where?  I'm the last 4 years?  Ask urself of the achievements  U Trump and others took the country down the authoritarian road and almost destroyed democracy in the process", "view": 10}, {"title": "", "body": "Mike Pence is Very Annoying....  Donald Trump has Every Right To Hang Him  https://t.co/mDFrJSPKgN", "view": 10}, {"title": "", "body": "@se_kear @marktheangry @melodiefryar @TheJusticeDept again -- which of the many Trump crimes are you talking about? You seem to be proving my point.", "view": 10}, {"title": "", "body": "Of course trump will get away with it. If Garland prosecuted it sets a precident of holding wealthy white people accountable and that's not why our government exists.", "view": 10}, {"title": "", "body": "Four years ago today, Trump lined up his Generals and says to the press:  \"The calm before the storm\"  https://t.co/wqDNg48taK", "view": 10}, {"title": "", "body": "Garland needs to go. If he's rrefusing to prosecute Trump, then he's handing our Country over to Authoritarianism.", "view": 10}, {"title": "", "body": "@TheDemCoalition If Trump wasn't from wealth he would be a babbling homeless person sleeping in doorways.", "view": 10}, {"title": "", "body": "Donald Trump is Off Forbes’ List of the 400 Richest Americans for the First Time in 25 Years  https://t.co/gwWcUWEHyQ", "view": 10}, {"title": "", "body": "Reasons NEWSOME SHOULD HAVE BEEN RECALLED: REJECTED TRUMP'S OFFER TO SOLVE HOMELESS. DEMOCRAT PELOSI DISTRICT IS S.F. THE SLUMS CLOSES BUSINESSES 0$'S  California Gov. Newsom announces nation’s 1st statewide COVID vaccine mandate for students #NewsBreak   https://t.co/wrjIFuuBKa", "view": 10}, {"title": "", "body": "Mrs. trump asked me if I had called the police and I said no, explaining that this close to the election, it wouldn’t be good to have yet another domestic abuse scandal hanging over the administration.  https://t.co/ZRp7yCJ4W4", "view": 10}, {"title": "", "body": "@DineshDSouza Trump lost", "view": 10}, {"title": "", "body": "It’s weirdo behavior to threaten a 9/11 committee when people who are on that committe were actually at the Twin Towers helping out in the rubble. It’s really a shame that politics trumps human decency and common sense; it’s even worse that some people are okay with it.", "view": 10}, {"title": "", "body": "Donald Trump loses place on EuroJournal rich list for first time in 25 years  https://t.co/rV44CknvKv", "view": 10}, {"title": "", "body": "I’m sure Donald Trump’s team did copious market research  Took thousands of surveys  And had dozens of focus groups  Before coming up with the brilliant marketing campaign:  “Make America Great Again, Again!”  See, it’s the exclamation point that’s the key  https://t.co/UPPOvDPLQJ", "view": 10}, {"title": "", "body": "TRUMP DROPS OFF RICHEST PEOPLE LIST BECAUSE SOMEONE FINALLY DID THE MATH AND REALIZED HE HAS BEEN LYING FOR ALL THESE YEARS #Duh #TrumpWorstPresidentEver #TrumpIsNotAsRichAsHeImplies", "view": 10}, {"title": "", "body": "That's a good point. Recall, that Trump and Lin Wood on their own essentially cost the GOP two very winnable races in GA. The other Republicans had nothing on the ball. Dems would be getting nada right now, were it not for the results of the Georgia Senata runoffs in January.", "view": 10}, {"title": "", "body": "@SpunkybyChance @MaryLTrump It's an excuse,  probably because she's a trump lovin republican. They have no reasons for anything they do.", "view": 10}, {"title": "", "body": "@Abyssal_Squid @DonaldJTrumpJr Daniel, Trump is long gone which means you are allowed to go back to being a normal thinking person. Your response is dopey. I think we all could agree that this course of action in Austin is dangerous and scary. Let's start out by agreeing on the obvious things!", "view": 10}, {"title": "", "body": "We live and hope:  Criminal inquiry into Trump’s Georgia election interference gathers steam  https://t.co/o174mEEZT4", "view": 10}, {"title": "", "body": "Still the same fucking idiot - Trump never parts ways with anyone amicably. You'll learn. Maybe.", "view": 10}, {"title": "", "body": "Still mixed feelings about RT Lincoln Project content, but they aren’t wrong about Youngkin being in Trump’s pocket.", "view": 10}, {"title": "", "body": "@SenThomTillis What’s wrong with making sure ppl pay their taxes?? How much do you hide from the IRS? If ppl paid taxes, especially rich ppl, we could pay for that $8Tr in expenses you approved under Trump but now refuse to pay for.", "view": 10}, {"title": "", "body": "@nick45784821 @Sportsmomma2020 @davidmweissman I don’t think so. I don’t think trump gave a flying fat fuck about improving our lives one bit.", "view": 10}, {"title": "", "body": "@judy5203 @atensnut Oh...I see.  You are actually the one who didn't understand that there's a Long Beach California AND a Long Beach New York.  What a Patriot..🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣 Smh.  Maybe if you didn't buy all that Trump crap, you could save up for a map????", "view": 10}, {"title": "", "body": "@700club @kayleighmcenany So Trump will go to prison very soon along with his entire criminal family and all his enablers like...Kayleigh McEnema?  Good.  We've waited long enough.  God's plan will make it happen.  High five.", "view": 10}, {"title": "", "body": "@Swoleup2 @TKirby42 @exist_you @hampton040609 @moneywisecom You’re hilarious. We are in this mess because of Trump!", "view": 10}, {"title": "", "body": "Trump isn't a typical far right leader. But he's afraid to challenge far right inside GOP, instead, he uses far right propaganda to gain donations, including donations from anti vaxxers, and organize his political operations to label his opponents socialists and communists.", "view": 10}, {"title": "", "body": "@leajovyford Why not ask Donald Trump?", "view": 10}, {"title": "", "body": "Don't vote for Trump because: He is a dumb and a cheeto", "view": 10}, {"title": "", "body": "@JakeSherman @USChamber @alaynatreene This seems like the natural result of the Trump era. At least rhetoric and style wise, the modern GOP doesn't look much like the Chamber anymore (that of course doesn't stop them from cutting taxes, though).", "view": 10}, {"title": "", "body": "@cashch result of trump.", "view": 10}, {"title": "", "body": "With the knowledge that Mike Pence was desperate to do Trump's bidding and only didn't out of cowardice, not conviction, this is so very true:   The revelations about Mike Pence’s role in Jan. 6 keep getting worse  https://t.co/zvWVK1iHxB", "view": 10}, {"title": "", "body": "What is happening to the Republicans?One answer is that the Party’s predicament might fairly be called the revenge of “the kooks.” In just four years, the G.O.P., a powerful, hundred-and-sixty-seven-year-old institution,has become the party of Trump.The Party Of Lies and Deceit .  https://t.co/dIRmywCGRt", "view": 10}, {"title": "", "body": "@LamantinPuni I reject Antifa tactics, actually. I think they're counterproductive. If you read my bio, I said, \"If hating Trump is wrong, I must be Antifa,\" referring to the rigid R-wing def of everyone on the L. I'll take the mod. Dem over the drafter of the bathroom bill any day.", "view": 10}, {"title": "", "body": "@EricBoehlert Ten bucks says that every mention of Trump will be poorly dubbed over with \"HILLARY CLINTON! *thunder*\"", "view": 10}, {"title": "", "body": "What a Surprise: Top Obama Official is Advising Anti-Trump Facebook 'Whistleblower'  https://t.co/J1C7cvi02Q via @gatewaypundit", "view": 10}, {"title": "", "body": "De Notaristefani joined the Trump administration in May 2020 to help the federal government find ways to scale the manufacturing and production of the Covid-19 vaccines. He worked alongside former Warp Speed leaders Moncef Slaoui and Gen. Gustave Perna. All have left their posts", "view": 10}, {"title": "", "body": "@RepMattGaetz @JackPosobiec We all should suspect that Putin blackmailed a Chinese scientist to release Covid to hurt China and steer US elections for Trump.", "view": 10}, {"title": "", "body": "Jared and Ivanka believed they were running a 'shadow presidency': former Trump spokesperson  https://t.co/YdGobvLRUZ", "view": 10}, {"title": "", "body": "@JoeChicom @tfrederick1118 @marren48 @JackPosobiec Hmm an article from right in the middle of Trump's term. Doesn't look like he made America great again does it Joe?", "view": 10}, {"title": "", "body": "Criminal inquiry into Trump’s Georgia election interference gathers steam  https://t.co/3lcwQmxLV8", "view": 10}, {"title": "", "body": "@thtaylor47 @newsmax Yes, all of trumps good work benefitted EVERY American.   No crazy inflation,  low fuel prices,  energy independence,  not a peep from terrorists or tin pot dictators.  No flood of almost 2M migrants.    Senile Biden fucked everything up.    EVERYTHING.", "view": 10}, {"title": "", "body": "@sprayfert @SenatorSinema You talking about Marjorie Taylor Greene or the terrorists that chased the Capitol police with Trump flag poles?", "view": 10}, {"title": "", "body": "@MarshaBlackburn LOL still derping about accountability? sure is nice after that 4 year hiatus. when do republicans hold trump accountable for the election lies? the blackmailing of a foreign leader? anything? bueller? @MarshaBlackburn", "view": 10}, {"title": "", "body": "Donald Trump Drops Off The Forbes 400 List Of Richest Americans | Forbes - Forbes  https://t.co/JVpa0RIhiq via @GoogleNews", "view": 10}, {"title": "", "body": "Fiona Hill says Trump was a national security risk because he was 'so vulnerable to manipulation based on the fragility of his ego'  https://t.co/FZxhtX3zqd LOL, Fiona seems to lost her sight and hearing. Trump's accomplishments tower over hers, Clinton's, Obama's, Biden's, Bush's", "view": 10}, {"title": "", "body": "@EdRieswijk Gaat niet om Trump alleen maar speelt daar wel een grote rol in. Linksom of rechtsom is de US toe aan een vernieuwing. Of Trump daar een rol in speelt of slechts meer van het oude in een slimmere uitvoering ben ik nog niet uit. Hij liet wel zien dat een verandering mogelijk is", "view": 10}, {"title": "", "body": "@davidmweissman Yes what exactly did Trump do while in office that was good for the American people? Anythig? Anything at all? Is there a list of his good deeds? I mean a real list with the real truth.", "view": 10}, {"title": "", "body": "Donald Trump Thought Fiona Hill Was a Press Secretary  https://t.co/1VUNVZo10Z", "view": 10}, {"title": "", "body": "Let's not forget she changed her profile picture to trump on 1/6  https://t.co/csr7JSTtpG", "view": 10}, {"title": "", "body": "And yet this is a priority over the dangerous criminals of Trump,his family and associates? Where's the people's justice and why are you trying to destroy our country and our democracy?", "view": 10}, {"title": "", "body": "@KaivanShroff @SaraCMoss All that is true. But it is also true that their information helps shine light on the dysfunction of the Trump wh, which is important to get out there.", "view": 10}, {"title": "", "body": "@scottmwillis @KJP46 The point is that the debt limit needs to go up to pay for trump’s debts", "view": 10}, {"title": "", "body": "@Winback24 @llauralouisiana @tedcruz I call this \"pulling a Trump\".", "view": 10}, {"title": "", "body": "I call bullshit that they plead ignorance. SA is another one of Trump's puppet masters.    https://t.co/LEYsBRjhxd", "view": 10}, {"title": "", "body": "Fiona Hill says Trump was a national security risk because he was 'so vulnerable to manipulation based on the fragility of his ego'  https://t.co/L2CXJ6VZ8s", "view": 10}, {"title": "", "body": "tRUMP \"Trolls\"still thinking they run things...🤬🤬🤬🤬🤬", "view": 10}, {"title": "", "body": "@JackPosobiec Just going to predict this is a false flag event by a \"conservative qanon Trump supporter domestic terrorist\". Garland put his notice out, then this convienient attack, and they will label any conservative or opposition as domestic terrorists. Welcome to China.", "view": 10}, {"title": "", "body": "@KearnsLady74 @TrumpJew2 Didn't you say you're German?? 😂😂😂 Trump's plan to retreat had conditions, Biden just did the opposite. First the citizens, then take out all military equipment and THEN the military. Our enemies are laughing at his weakness.", "view": 10}, {"title": "", "body": "@halkordusu31 Kendini Amerikalı Sanan Trump Sevdalıları çok BASED", "view": 10}, {"title": "", "body": "Stephanie Grisham says there was a ‘culture of abuse’ in the Trump White House  https://t.co/KhPFqsYY4U", "view": 10}, {"title": "", "body": "@ppkiyan1 @elhigadodmarita Se que la pregunta es para mar, pero yo no creo que lo sea, por eso me gusto Estudie mucho lo del globalismo, y me volví una detectora inmediata...por ejemplo hds es, y a millas lo detectas. Por eso me volví Trump supporter, el antiglobalista. Todos deberían saber Foro de Davos", "view": 10}, {"title": "", "body": "Donald Trump Seeks Reinstatement of @realDonaldTrump on Twitter  https://t.co/Q6g56rbHxX", "view": 10}, {"title": "", "body": "Mike Pence @Mike_Pence it's time to take you head out of the clouds and face the reality that you and Trump mislead America!  We need UNITY not what you're trying to give us. Think about it some more before talking...", "view": 10}, {"title": "", "body": "@gorskon Have you seen his timeline from the last couple of days? He’s absolutely unhinged. Also, he uses Trump’s 3rd person technique to promote himself (very bizarre).  Finally, have you seen this ‘expert’ statement he’s pushing?   https://t.co/I8gsOs85aH", "view": 10}, {"title": "", "body": "Donald Trump loses place on Forbes rich list for first time in 25 years - The Independent  https://t.co/FTKKyoZ0D0 via @GoogleNews", "view": 10}, {"title": "", "body": "@PalmerReport This may be true, but there are worse people than trump. So I don’t think we can breathe any sighs of relief if he doesn’t run. The party itself is trump now, whether he leads it, or not.", "view": 10}, {"title": "", "body": "@Heres_Johnny2 @larryelder Things were SO bad under Trump, weren't they??", "view": 10}, {"title": "", "body": "Trump Falls Off List of Wealthiest Americans  https://t.co/W2DZTYRUsQ", "view": 10}, {"title": "", "body": "What is happening to the Republicans?One answer is that the Party’s predicament might fairly be called the revenge of “the kooks.” In just four years, the G.O.P., a powerful, hundred-and-sixty-seven-year-old institution,has become the party of Trump.The Party Of Lies and Deceit .  https://t.co/EQAh4fjW3l", "view": 10}, {"title": "", "body": "@Dianne37467713 @wallace_andrew_ @janet60286241 @AvengerResister Lara Logan...lol...might as well have said Lara Trump.", "view": 10}, {"title": "", "body": "UH DOIEEE! #moo #wantedaHandjob #Trump #TrumpRally", "view": 10}, {"title": "", "body": "@miss_jordon @pfizer Why did trump make a deal with them?", "view": 10}, {"title": "", "body": "#Why hasn’t Trump been arrested yet for Treason and all the crimes he’s committed", "view": 10}, {"title": "", "body": "@PootDibou @StanPennington8 @InfoGuru16 @BobsDog4 @TheMattBoyScout @EricR42 @FighterTh @TheCenterStripe @John_iwas_ @battle_bullshit @PamelaEdwards @McDonnellMJ @AngryFleas @get_innocuous @PogueMoran @bryb1205 @princesspbbaby2 @Joe_Montoya_312 @ConradCaruthers @roboticshoe72 @BSHerrle @VicJules69 @TalkMullins @EducatingTrump2 @everclay1 @Trump_is_a_lock @NickDone8 @PaulR97503570 @TanyaYoakum @princesspbbaby @AngryPamela @JoeThejoe4 @NHSouthernGirl @RawkRari @Symonsez13 @HrhOrchid @FreddiMercury1 @LevDoctor @LittleBigTop3 @KelownaLuke @neville1776 @rationalnik @neal_cowboy @LeChocker @EarthOne_13 @FrankModeo @Higg09 @SwanIndependent @teamphil @Joes94CrimeBill First pallet, thanks.  I was wondering what the breakdown was, obviously wasn’t all ballots. How are you off by nearly a 1/3rd? That alone implies massive incompetence. I wonder if the early “100’s of thousands missing” was an extrapolation of this.", "view": 10}, {"title": "", "body": "@WalshFreedom Joe, I'm absolutely demeaning Trump supporters who didn't see this insurrection happen and go \"Oh, fuck no. This is too much crazy for me. I'm out.\" Anyone who still supports him after that deserves every comment about their lack of integrity and character that comes their way.", "view": 10}, {"title": "", "body": "@DarkHorseRyan @glennbeck Look how they turn on everyone that doesn't tow the line. Pence was loyal to the end and but because he wouldn't just throw the election to Trump, he was branded a traitor by trumps ilk", "view": 10}, {"title": "", "body": "@TheRickyDavila @MewllerRobert Yeah trump kicks them in the teeth and they come crawling back to lick his boots. It's unreal.", "view": 10}, {"title": "", "body": "@seanhannity Now tell us about the officials in the Trump admin that refused subpoenas.", "view": 10}, {"title": "", "body": "@NeilLowenthal1 It’s wonderful to see the reception that President Biden received. Hannity must have been at a trump rally by mistake.", "view": 10}, {"title": "", "body": "@anniegirl1138 @Dean_Winnipeg In o'tool's case, he's got a pretty good deal going. He might be very comfortable living free at Stornoway! Also, he's kind of like tRump and can't admit to his defeat!", "view": 10}, {"title": "", "body": "@saint_sean @SilentAmuse @BenSpielberg We only have the Senate b/c Hickenlooper, Ossoff, Warnock, and Kelly unseated Repubs, and Biden/Harris beat Trump last year. None of them are AOC / Bernie or even Warren type Dems. Meanwhile, the Justice Dem Swearengin wasted her time running in WV, losing by over 40%. (3/)  https://t.co/5nGWXIAxgZ", "view": 10}, {"title": "", "body": "@JDLuckenbach The same dems who admittedly held back Corona relief because passing it would've been a good look for Trump?", "view": 10}, {"title": "", "body": "Trump Tumbles Off Forbes Rich List After COVID Pandemic Slashes His Fortune  https://t.co/ofVyO2Y6mK via @thedailybeast", "view": 10}, {"title": "", "body": "@meridithmcgraw @PamBondi @kimguilfoyle Maybe if Trump wants to make America great again then he should expose the government for what it really is and take America back because if a president doesn't have control then hes just a walking orange ball of hair that's fun to laugh at, I will say I do miss that, so in all", "view": 10}, {"title": "", "body": "@thehill @PressSec Spending in general is whack and Trump was very much a populist when it comes to spending. But tax cuts....no, those are never bad.", "view": 10}, {"title": "", "body": "Stephanie Grisham says there was a ‘culture of abuse’ in the Trump White House  https://t.co/mPdMMzzkwr", "view": 10}, {"title": "", "body": "Author, @RealPNavarro, of \"In Trump Time: A Journal of America's Plague Year\" joins us at 4 pm MT today.  Listen live on the KLZ560am app or at  https://t.co/54TrtkBv6m Order Peter's book at  https://t.co/zEl7oZFOgc  #Trump  https://t.co/7c5SvspoBl", "view": 10}, {"title": "", "body": "@Voitecr2 @PlantBasedNews False. Obama didn't \"start\" any wars. Wars continued under him from former presidents and we did *join* another countrys war. Wars continued under Trump too. If continued wars count then youd have to count Trump in that too.", "view": 10}, {"title": "", "body": "Trump's former top Russia advisor says he has a bad case of 'autocrat envy'  https://t.co/Z8cNe8WP3y via @Yahoo  If he returns to power in 2024 - hopefully not, America would be in for a disaster!", "view": 10}, {"title": "", "body": "So, since the Dem legislation stalled till Halloween, LET'S work on DESTROYING the GQP/TRUMP Party in the MEANTIME!  They are actively trying to destroy OUR Democracy, LET'S GET THEM first!", "view": 10}, {"title": "", "body": "Trump queda fuera de la lista de los 400 más ricos por primera vez en 25 años: ha perdido 600 millones en dos años  https://t.co/QT5DcBSj2S #FVDigital #FelixVictorino  https://t.co/PLWJ58HkXj", "view": 10}, {"title": "", "body": "Choose your dictator: Biden or Trump.  https://t.co/2EUMDujRL0", "view": 10}, {"title": "", "body": "@nycjim Make no mistake about it, the republican party is now the Russian party. They went all in with Russia under Trump.", "view": 10}, {"title": "", "body": "What is happening to the Republicans?One answer is that the Party’s predicament might fairly be called the revenge of “the kooks.” In just four years, the G.O.P., a powerful, hundred-and-sixty-seven-year-old institution,has become the party of Trump.The Party Of Lies and Deceit .  https://t.co/HrlZOVZdYv", "view": 10}, {"title": "", "body": "🙄🙄🙄🤪🤪🤪😂😂😂👇 The fucking grifting never ends. JFC. Trump Unveils New Super PAC And Twitter Users Can't Stop Howling At The Name  https://t.co/bd6j4vhn28 via @Yahoo", "view": 10}, {"title": "", "body": "@gordoncraig11 There are still the pointed hat idiots about today. I know which side Trump would have been on", "view": 10}, {"title": "", "body": "@Mike_Pence Pence says \"Weakness arouses evil.\" what an appropriate way to describe what Trump accomplished in his four-year term and two campaigns. The word \"evil\" doesn't aptly described what both Trump and his \"Christian\" sidekick are.", "view": 10}, {"title": "", "body": "@thedailybeast It has to be rigged or fixed. Trump won the election for top 400. I say file a law suit", "view": 10}, {"title": "", "body": "@jason_kint The news last night was all about the downtime and not about these complaints   Trump trained Zuck well", "view": 10}, {"title": "", "body": "Finally, someone from the GOP has woke up to what Trump and his MAGAts are doing to destroy the party.   Top GOP Donor Says He Wouldn't Back A Trump 2024 Run: Time To 'Move On'  https://t.co/AqcNfpLcDW via @YahooNews", "view": 10}, {"title": "", "body": "MAGA is code for lie, cheat, and threaten. Trump had Capitol police murdered.", "view": 10}, {"title": "", "body": "Stephanie Grisham says this Jan. 6 text from Melania led her to resign : Grisham calls Trump \"Culture of abuse\" but she has NO problem with BLM riot buring peoples property ?", "view": 10}, {"title": "", "body": "\"Donald Trump: 'Nobody Has Done More' For Christianity, Evangelicals, or Religion Itself Than Him\" - in sending down the rabbit hole of racism, division and embarrassment.  https://t.co/7t57UowzDp via @ChurchLead", "view": 10}, {"title": "", "body": "Trump shouldn't have been on the list to begin with.", "view": 10}, {"title": "", "body": "#Internacional | Trump queda fuera de la lista de los 400 más ricos por primera vez en 25 años  https://t.co/S5FoxtyeMh", "view": 10}, {"title": "", "body": "@AgentP22 @themajorityscot That’s just an honest statement about Trump.", "view": 10}, {"title": "", "body": "Here we have America unneedingly and unceremoniously injecting themselves into another (my) country attempting to \"save\" it by protesting and promoting absolute GARBAGE! Fuck off you literal Trump chuds.", "view": 10}, {"title": "", "body": "@waltshaub All entirely true and she’s right - there won’t be redemption.  That said, if all the others, including those in congress, decided to go on FoxNews and tell the truth about Trump’s corruption, lies and role in overthrowing our democracy, it would be a step in the right direction.", "view": 10}, {"title": "", "body": "Kiedy w 2016 roku Donald Trump został niespodziewanie wybrany na prezydenta, George Soros stracił nie tylko ok. 5 tys. 1 miliard dolarów , https://t.co/7NeY4mrYjB  stracił również wyłączny dostęp do Białego Domu  o którego odzyskanie walczy do dziś.", "view": 10}, {"title": "", "body": "donald trump.İsme bak", "view": 10}, {"title": "", "body": "@MinnieFluff @JakeSherman Letting Trump run wild after the election was also a disaster for Republicans. Mitch isn’t the genius strategist he gets cracked up to be", "view": 10}, {"title": "", "body": "Statement by Donald J. Trump, 45th President of the United States of America  https://t.co/hhvovoxla2", "view": 10}, {"title": "", "body": "@larepublica_pe @tovar_samanez Jajajajaja Keiko, es la culpable de todo con ayuda de Alicorp  y Trump, el asno es su víctima", "view": 10}, {"title": "", "body": "@EricFlackTV Robert Palmer was at the Capitol on Jan 6th to help Donald Trump \"Hang Mike Pence\"  Should he get the planned Mike Pence Treatment???  https://t.co/3pf3c7JOSS", "view": 10}, {"title": "", "body": "Trump, after adding trillions to the government’s IOUs, comments on debt ceiling fight  https://t.co/fkBPEXNiTa via @Yahoo", "view": 10}, {"title": "", "body": "@Mike_Pence #January6thInsurrection isn't a failure of the media. It's about an organized coup attempt. MAGA were out to hang you because you didn't do tRump's bidding. You're just as culpable as you keep silent and gaslight an attack on our Democracy by #DomesticTerrorists", "view": 10}, {"title": "", "body": "@some_hispanic2 @AP @datnofact Oh, politicians knew. They harness the platforms. Trump especially harnessed FB personal data to suppress the vote for targeted populations in 2016.", "view": 10}, {"title": "", "body": "icymi, Oath Keepers brought numerous guns for their “ops” to back Trump on January 6", "view": 10}, {"title": "", "body": "Pelosi my fav trump troll🤣🤣🤣🤣", "view": 10}, {"title": "", "body": "Rudy Giuliani admits under oath that he got some of his 'evidence' of alleged election fraud from Facebook  https://t.co/gakXbN3XNo via @Yahoo It is time 4the legal system 2 end this  farce by Trump and all his associate's. Working middle class of all 3 parties are sick of this.", "view": 10}, {"title": "", "body": "Top GOP Donor Says He Wouldn't Back A Trump 2024 Run: Time To 'Move On'  https://t.co/tfIkQTcDX4 via @Yahoo   It's about time this nut bag is being called out by Republican donors for exactly what he is.  Pointlessly divisive...", "view": 10}, {"title": "", "body": "@LeaderMcConnell @lisamurkowski @SenDanSullivan Have the republicans got a platform yet, or is it still just Donald Trump?", "view": 10}, {"title": "", "body": "What is happening to the Republicans?One answer is that the Party’s predicament might fairly be called the revenge of “the kooks.” In just four years, the G.O.P., a powerful, hundred-and-sixty-seven-year-old institution,has become the party of Trump.The Party Of Lies and Deceit .  https://t.co/jXdG2iDf3W", "view": 10}, {"title": "", "body": "Today would be a good day to indict Trump of multiple crimes..inciting an insurrection, cooking the  books for his finances.. just to name a few. Why is this dragging on &amp; on? He is walking scot free &amp; will be able to run again if he is not indicted. We need justice!", "view": 10}, {"title": "", "body": "@PostOpinions @MJGerson venomous hatred towards trump is ruining things no?  Doesn't he have freedom of expression?", "view": 10}, {"title": "", "body": "@EricFlackTV Should get maximum. All of them especially Trump. I think I read this guy got 45 days!", "view": 10}, {"title": "", "body": "@libsoftiktok Wants to talk about how hurtful Trump supporters are… but I have a feeling that she would readily condone all of the domestic terrorist hate crimes perpetrated upon Trump supporters.", "view": 10}, {"title": "", "body": "TRUMP'S Illegitimate Son.  #regulatefFacebooknow #UnfriendFacebookNow #ZukerbergVonTrump #DeleteFacebook  #DeleteInstagram  #DeleteZuckerberg  #FuctheZuk  https://t.co/daQPbiPv1x", "view": 10}, {"title": "", "body": "@chucktowngent @henrymcmaster You can thank trump for adding almost $8 trillion to the deficit. The $ used for this project comes from the American Rescue Plan Act signed by Biden. Our great grandkids will benefit from infrastructure not tax breaks for rich white dudes in 2020.", "view": 10}, {"title": "", "body": "@realVozzFire Así salió Donald Trump,se está generando el mismo efecto,ya no se puede creer en lo vitalicio,la gente necesita cambios,ojalá piensen bien los Chilenos y no crean en los regalos y beneficios comunistas, otro régimen que no existe, por tanto está difícil, ni yo sé por quien votar", "view": 10}, {"title": "", "body": "NEVER FORGET: Facebook Eliminated or Censored ALL of the Top Pro-Trump Pages in 2017 Following the the Trump Victory -- Facebook Killed Off the Top Pro-Trump Pages After Election  https://t.co/L0TNUcwncM via @gatewaypundit", "view": 10}, {"title": "", "body": "If Mamta made S3 with other actors, so many would have blamed the actors &amp; said its bad cuz it doesn't have the OG cast. I hope ppl now realize how important writing is for a story to click. Yes the actors did well &amp; had good chemistry but writing trumps everything", "view": 10}, {"title": "", "body": "@LynPaul6 I was thrown back to my despair at Trump when I realised just how awful Bojo is 🤦‍♀️ whosoever approved this should be ousted pronto too !!", "view": 10}, {"title": "", "body": "How Is the Missouri Senate Race Shaping up -- and What Role Will a Trump Endorsement Play?  https://t.co/eEXOjowF0L", "view": 10}, {"title": "", "body": "Vaccinated people didn't want that shot either. They took there's for the Team. We're not listening to the GOP tell us to just get to work and risk our lives. They don't factor the rest of us past Trump Supporters. So No. Fuck them back. 📢 Unvaxed do their part.... Back to work", "view": 10}, {"title": "", "body": "@IngrahamAngle Absolutely Fauci was with Bill Gates, Birx, Soros in funding Wuhan! I think China  Intended to just leash it on the USA to blame Trump but it backfired on the World!All the above FUNDED the Lab. Knew about Covid in 2012! Kept it quiet! 😡😡", "view": 10}, {"title": "", "body": "Lying on Trump’s Order  https://t.co/ZJI3RJNwPT via @politicalwire", "view": 10}, {"title": "", "body": "Does anyone have the email address for the Trump 2024 campaign? I'd like to send Don Jr a giant dildo.", "view": 10}, {"title": "", "body": "Trump supporters aka your attempted murderers Mike.", "view": 10}, {"title": "", "body": "look when he was asked if he would have a problem with the FBI looking into him. Of course he didn't want to and that was what his face turned all kind of colors. Not to worry though Trump obstructed it by controlling the dates that the FBI looked at. You all know #2 would have", "view": 10}, {"title": "", "body": "“That Trump-in-exile drama is continuing, and it’s entirely reasonable to worry about how it might influence a contested 2024 election.” But to see democracy’s demise as foreordained is alarmist.    https://t.co/UGEtSX8XmI", "view": 10}, {"title": "", "body": "Donald Trump, Forbes dergisinin her yıl hazırladığı zenginler listesinde 25 yıl sonra ilk kez yer alamadı.", "view": 10}, {"title": "", "body": "No magnetic Bill Gates blood mixed with George Soros DNA to communicate with the Jewish space lasers that Q discovered while chatting with JFK about how Trump is still pres?  https://t.co/M8zlzhU8K8", "view": 10}, {"title": "", "body": "Trump No Longer on Forbes List of Richest Americans  https://t.co/DSmlYqz8Ax  https://t.co/4DBMO5wUfb", "view": 10}, {"title": "", "body": "Trump No Longer on Forbes List of Richest Americans  https://t.co/VwZCfErthS  https://t.co/g9tiiv7pgZ", "view": 10}, {"title": "", "body": "Trump No Longer on Forbes List of Richest Americans: Former President is no longer on the Forbes list of America’s richest people. According to Forbes 400, Trump’s fortune dropped to $2.5 billion, which is $400 million short of the cutoff needed to make…  https://t.co/2LPpSZZHV8  https://t.co/OcqqQMqTtP", "view": 10}, {"title": "", "body": "Trump No Longer on Forbes List of Richest Americans  https://t.co/fCL2yocoaE", "view": 10}, {"title": "", "body": "@leogane1026 @eclecticbrotha they left to seek asylum in the US which is their legal right not a rumor. why are you excusing biden using trump policies to treat haitian migrants like cattle?", "view": 10}, {"title": "", "body": "@McDutchoven PERFECT 👍 Thanks for the Refreshing Honesty Trump was Running a Transnational Crime Syndicate from our White House", "view": 10}, {"title": "", "body": "#TrumpIsTheWorldsBiggestLoser Donald Trump is Off Forbes' 400 Richest Americans List  https://t.co/52YBfzaTqx", "view": 10}, {"title": "", "body": "Trump advisor told Steve Mnuchin he'd be 'the reason' the pandemic would never end: new book - Raw Story - Celebrating 17 Years of Independent Journalism  https://t.co/cUDAXT8n2b", "view": 10}, {"title": "", "body": "@WhiteHawkRaven @2casey451 @jason_kint My brother was banned from FB for a month for calling another commenter and \"idiot\". Yet, I see the US Patriots for Trump page spewing all kinds of right wing lies and nothing happens.", "view": 10}, {"title": "", "body": "Foreign journalists sue U.S. broadcasting org after being fired during Trump administration  https://t.co/sXwsfCRq9t", "view": 10}, {"title": "", "body": "@Mike_Pence Pence was a placeholder, there are no Trump-Pence policies! His opinions didn’t count as Donald’s dummy puppet and they don’t count now as the discarded dummy puppet. He is irrelevant.", "view": 10}, {"title": "", "body": "Trump's former Russia expert has a message for voters if he runs in 2024 - Raw Story - Celebrating 17 Years of Independent Journalism  https://t.co/208gB4LeWn", "view": 10}, {"title": "", "body": "Mary Trump Reveals She Was Served in Donald Trump Lawsuit Moments Before Interview  https://t.co/QN7uFjWytS With Trump you expect lies, cheating and lawsuits.", "view": 10}, {"title": "", "body": "\"If Trump is looking for someone to blame, he can start with himself. Five years ago, he had a golden opportunity to diversify his fortune. Fresh off the 2016 election, federal ethics officials were pushing Trump to divest his real estate assets.\"   https://t.co/gP4MOsZrhP", "view": 10}, {"title": "", "body": "Lindsey Graham booed for asking Republicans to consider Covid vaccine Isn't that a shame, but more so, he recanted and tried to walk back his statement. Just like trump. Graham doesn't have the moral strength of back up his words.", "view": 10}, {"title": "", "body": "What a Surprise: Top Obama Official is Advising Anti-Trump Facebook 'Whistleblower'  https://t.co/KlA9xstbB1 via @gatewaypundit", "view": 10}, {"title": "", "body": "THAT STRATEGY IS GOING TO BACKFIRE ON THE DEMOCRATS, MOST OF THESE ILLEGAL IMMIGRANTS WILL EVENTUALLY BECOME REPUBLICANS/ 60 PERCENT OF HISPANIC MEN VOTED FOR THE TRUMP,", "view": 10}, {"title": "", "body": "Trump attorney Alina Habba of Habba Law said the case is “very much moving along” but argued that Zervos’ team had yet to provide some medical records that would be needed prior to depositions.  https://t.co/sxwWg3FKb9", "view": 10}, {"title": "", "body": "Mike Pence: media’s focus on Capitol attack is attempt to distract from Biden failures - The Guardian Mike Pence is a liar, We all know that they’re guilty for the insurrection. Trump/Pence need to be arrested for treason. #liarpence  https://t.co/Gu2nl3F1Kj", "view": 10}, {"title": "", "body": "@WalshFreedom There is no low to which Pence will not go. And Trump said that if Pence didn't do his bidding and block certification of the election, he'd no longer be his friend. But still, Trump's lackey refuses to tell the truth.", "view": 10}, {"title": "", "body": "U.S. Housing Policy Pivots  Joe Biden published ambitious plans for housing, including boosting funding, implementing various strategies to address discrimination in the housing sector and reversing Trump administration rules on fair housing.  https://t.co/Bh48ot8jFi", "view": 10}, {"title": "", "body": "Trump White House used cartoon image of a jailhouse in a slideshow as it warned interns against being 'leakers' and 'liberals'  https://t.co/wxLMmWL1ta", "view": 10}, {"title": "", "body": "@sltrib ATTENTION: Democrats, Independents and anti-Trump republicans can UNITE to get rid of the loathsome Mike Lee. Yippee!", "view": 10}, {"title": "", "body": "@prairiecentrist I was going to argue Trump, but that was a temporary 4 year ordeal. Brexit is much worse and will last a long time.", "view": 10}, {"title": "", "body": "@Jean_Lannes85 @GrossesFolles @SudRadio @andrebercoff En contextualisant le bonhomme, qui est un habitué des conspi sans fondement, cela relativise les propos. Ce n est pas la première fois qu il évoque des complots contre Trump, sans que l on en voit le début de preuve. Même du temps de la présidence Trump.", "view": 10}, {"title": "", "body": "@RpsAgainstTrump “Big protest in D.C. on January 6th. Be there, will be wild!”    -Trump tweet, December 20, 2020", "view": 10}, {"title": "", "body": "@CariCGA @GUN_Vanguard Did you ever watch the Weekend Updates on SNL with the “Trump Brothers”??? I feel like it’s that, but just all Eric’s. Just a room full of those Eric’s. I’m scared.", "view": 10}, {"title": "", "body": "@DavidManOnFire part 2. All it takes for forces of evil to rule , is for a few good men/women to do nothing! It would be awesome if some of the GoP &amp; previous admin overcame fear of Trump &amp; came forward to reveal what really happened in last 4 years, help strengthen our democracy &amp; stop the lies", "view": 10}, {"title": "", "body": "US: Here's Trump UK: Hold our tea", "view": 10}, {"title": "", "body": "@kenmorton @RobertA69326861 @LCarrington259 @dodi_rains @pewpewonepew But, We didn’t “elect” him! Our elections were rigged!! TRUMP WON 🇺🇸", "view": 10}, {"title": "", "body": "Trump's ex-press secretary says former administration's handling of Covid-19 was 'tragic'   https://t.co/KWAyNGGOZq", "view": 10}, {"title": "", "body": "@Zac2040 @TheLaurenChen No one listened to him at the start when he tried to protect people and now 500 million are dead in America because people listened to Trump instead", "view": 10}, {"title": "", "body": "Donald Trump, Forbes dergisinin her yıl hazırladığı zenginler listesinde 25 yıl sonra ilk kez yer alamadı.", "view": 10}, {"title": "", "body": "How much did your Kabul stunt cost America? It gave every military family in America a black eye. 2 years ago Trump did the same thing to our allies the Kurds in Syria, left them behind to be murdered by our allies Erdogan and Basha.  @RepMeijer is an embarrassment.", "view": 10}, {"title": "", "body": "@RpsAgainstTrump @IlannaPhillips The irony writes itself in tRump's claim about \"losing one brain cell\"", "view": 10}, {"title": "", "body": "@fredpotter2hotm @itsJeffTiedrich Spot on. And guess what? Trump will be the Republican nominee. They have nobody else.", "view": 10}, {"title": "", "body": "'Evidence of deep rot': Elise Stefanik buried by Steve Schmidt for her latest 'idiocy'  https://t.co/7sO4znKTRR @EliseStefanik isn't representing the people who voted her into office, she doesn't care about them! She is all about herself &amp; power! Another woman being used by tRump!", "view": 10}, {"title": "", "body": "@simonjamesjupp @HertsFarmer Wonder what you both think of your leader \"Britain Trump\" and his views on the Pig cull? Is this challenging and creating opportunities? Do you support his Build Back Bitter, Batter, Butter type sloganeering? Isn't it time to call the man out for the damage he's doing to the UK?", "view": 10}, {"title": "", "body": "Trump advisor told Steve Mnuchin he'd be 'the reason' the pandemic would never end: new book  https://t.co/8EuNgx3JRH", "view": 10}, {"title": "", "body": "@GlennKesslerWP @SpiroAgnewGhost trump being trump.he always has to demean the TRUTH.", "view": 10}, {"title": "", "body": "@Reuters F the French bishops. These scenarios are where the likes of Jeffrey Epstein &amp; Trump prey, play, &amp; stow their dark monies. Shut down these churches &amp; claim their dark assets in the name of victims. Enough is enough, the church is to be a safe place That’s even abuse FOR CENTURIES", "view": 10}, {"title": "", "body": "Pence destroyed his political career when he signed on with Trump.  He knew what was coming, don’t believe his fraudulent evangelical act", "view": 10}, {"title": "", "body": "@CongMikeSimpson has played the Trump card just well enough to likely survive a primary contest in Idaho's 2nd district. Struck an 8 on the 10-point Trump shame-o-meter.", "view": 10}, {"title": "", "body": "Baylee hates horses and toads and is indifferent about Trump", "view": 10}, {"title": "", "body": "@thehill Oh come on its rigged, fixed no way could Trump not be one of the top 400. Maybe Trump can file a lawsuit?? Lol", "view": 10}, {"title": "", "body": "@leahmcelrath This system can also be useful when Trump insurrectionist show up.", "view": 10}, {"title": "", "body": "@Neloangelo314 @JREDBOKIE So we talking the likes of trump??", "view": 10}, {"title": "", "body": "Source: Bears RB Montgomery out 4-5 weeks #breakingnews #news #china #trump #biden #photo #Bears #ChicagoBears #DavidMontgomery #ESPN #Montgomery #news #NFL #Source #weeks  https://t.co/CFHJMqMdrX", "view": 10}, {"title": "", "body": "@bradleymueller @FoxNews I think you’re being a little short-sighted.  There are verifiable, and tangible reasons why Israel so praised Trump.  Remember, the outgoing Obama Admin. did not veto the UN vote to condemn Israel for settlements.  Trump recognized JERUSALEM as Israel’s capital -a home run ball!", "view": 10}, {"title": "", "body": "So why isn't this guy under investigation yet?  Steve Bannon pledges 20k ‘shock troops’ ready to go as he rants that ‘we control this country’ | Donald Trump’s former strategist has called on GOP to ‘deconstruct’ the state  https://t.co/Fyx4QyrPeR", "view": 10}, {"title": "", "body": "@WalshFreedom @Acyn @TheValuesVoter @BillKristol Hey, Walsh, thanks for indulging my 'preaching to the choir.' This cult of Trump is an existential risk to our system that gets me riled up🤓.", "view": 10}, {"title": "", "body": "Trump Unveils New Super PAC And Twitter Users Can't Stop Howling At The Name  https://t.co/Lfm3W50BOE via @YahooNews. SHOULD CHANGE ITS NAME TO “WE GONNA TAKE MORE OF THE FOOLS MONEY, AGAIN!”", "view": 10}, {"title": "", "body": "@RepLeeZeldin @SenatorSinema @Gutfeldfox Trump only stalks women and teens in private dressing rooms before beauty pageants", "view": 10}, {"title": "", "body": "Statement by Donald J. Trump, 45th President of the United States of America  https://t.co/TqEzSsUbTq", "view": 10}, {"title": "", "body": "@invertedfragil1 @Rikki_Girl @caroljsroth IRS Commissioner Charles Rettig (a Trump appointee) testified that relying on banks to report basic information about their customers’ deposits and withdrawals could put a big dent in annual tax evasion   https://t.co/OJbaettWkh", "view": 10}, {"title": "", "body": "@MarshaBlackburn Yeah like Trump won Arizona 4 times ...stuff like that ???", "view": 10}, {"title": "", "body": "But Trump was the “fascist”. 😒", "view": 10}, {"title": "", "body": "Stephanie Grisham says there was a ‘culture of abuse’ in the Trump White House  https://t.co/0k6HTFK71K", "view": 10}, {"title": "", "body": "@SenBlumenthal  what happened with the news from a couple of weeks ago about Zuckerberg and Trump having a deal???????Trump would not have his hate speech removed in exchange for him not putting regulations on Facebook.What happened with this?? @CNN  @MSNBC  @DeadlineWH  @maddow", "view": 10}, {"title": "", "body": "@BarbariansRidd1 and by \"going through a lot\" you mean \"are intentionally being sabotaged by a Trump-administration holdover, who has financial holdings that will literally see the benefit of a USPS degradation or collapse.\"", "view": 10}, {"title": "", "body": "Trump sought promotion for young aide after viewing her butt in Air Force One cabin: former staffer  https://t.co/U0Bc1Q7BTU", "view": 10}, {"title": "", "body": "@patriottakes Show them your trump card and offer to add them to your will  https://t.co/yhqAbFvm4J", "view": 10}, {"title": "", "body": "@FoxNews Let's see... she is exempt from property taxes because she is a disabled veteran who sacrificed her fucking legs for the country.  Trump meanwhile is using goats to avoid paying property taxes on his golf course. But I noticed you conveniently ignored that.", "view": 10}, {"title": "", "body": "@lopezdoriga Trump y Cárter los únicos presidentes de USA que no pertenecen al club Bildelberg,", "view": 10}, {"title": "", "body": "@ShadesOfShay how much was the allocation for HBCUs under Trump.", "view": 10}, {"title": "", "body": "Trump wore Stephanie Grisham's makeup during a speech in Saudi Arabia because his body man forgot to bring the 'usual arsenal of products': book   https://t.co/UKEC0RzXyb  https://t.co/tmhqOVgUYy", "view": 10}, {"title": "", "body": "'I flatly disagree': Judge rejects claim by Trump-appointed colleague that MAGA rioters getting unfair treatment  https://t.co/TryQpOERq7 #SmartNews", "view": 10}, {"title": "", "body": "@Melissa5857 @Jacob_Rees_Mogg Remember some people loved Hitler..later on playing to the same anti immigrant/pick on the poor agend voted for Trump ..you have to be a bot surely....", "view": 10}, {"title": "", "body": "If this happens Trump will face perjury charges. Judge orders Trump to give deposition in Apprentice lawsuit. A deposition. Under oath. *That* Trump... Under oath... Why are you laughing?  https://t.co/7wVWhWbkvX", "view": 10}, {"title": "", "body": "Statement by Donald J. Trump, 45th President of the United States of America  https://t.co/rUw7aMj26k", "view": 10}, {"title": "", "body": "Discussing public statement Trump DICTATED for Grisham saying she worked with Kelly and knew he was “totally unequipped to handle the genius of our great president.”", "view": 10}, {"title": "", "body": "@mrs_friendly I agree. What the hell is Merick Garland doing? Sounds like he’s working as hard as Trump did.", "view": 10}, {"title": "", "body": "Alıntılarla mentionlara kendini amerikalı sanan trump sevdalıları doluşmuş, bidena babasından kalan serveti yiyen halef muamelesi yapıyor 🤣🤣🤣🤣", "view": 10}, {"title": "", "body": "@blando87 @on_piggott @annvotedJoe @Molly4everLoved @MarshaBlackburn The wall construction was halted by Obiden's cronies, Under Trump: World Peace, Best Economy, Energy Independence, Minorities finally have a voice, and Yes, we can say MERRY Christmas !!!!", "view": 10}, {"title": "", "body": "Mike Pence — ‘President Trump and I parted amicably’…  https://t.co/R4dlXb6QyS", "view": 10}, {"title": "", "body": "@518CoachD @ProjectLincoln @GlennYoungkin It's not a coincidence that they guy who can't spell \"morals\" has the word \"patriot\" in his bio and a pinned tweet about mythical voter fraud. Trump loves the poorly educated.", "view": 10}, {"title": "", "body": "@Ash_961 @LFCmike_ @POTUS The Phase One trade deal with China, signed by Trump will expire at the end of the year. Biden’s administration will then renegotiate.  Cars companies are having issues because of semiconductor chip shortages that have NOTHING to do with President Biden!  Educate yourself!", "view": 10}, {"title": "", "body": "@kylegriffin1 2% but 1400 employees is still big … what other options do they have … don’t leave them on streets to join trump 😐", "view": 10}, {"title": "", "body": "The Trump campaign had veto power over stories that ran on cable outlet OAN, thanks to an arrangement with OAN head Charles Herring and an OAN reporter moonlighting for Trump’s legal team after the 2020 election, per Rudy Giuliani in this deposition.    https://t.co/Sb7Cj33ccO", "view": 10}, {"title": "", "body": "when the media is going to admit that Donald Trump’s mind has clearly been turning into a bowl of jello as the year has gone on. #politics", "view": 10}, {"title": "", "body": "Ivanka Trump and Her Brothers Get Bad News: Ordered to Hand Over Devices in New York Lawsuit  https://t.co/xRfUC4wGS2", "view": 10}, {"title": "", "body": "Is a \"booster\" shot anything like a cost over run? What is Fauci's cut? How about Biden's? Pfizer started trying to get rid of Trump as soon as they heard about his \"most favored nation\" pricing concept for Pharma.  https://t.co/DBosCyVHCb", "view": 10}, {"title": "", "body": "@Debz1904 @thetimesscot @JaneyGodley So should she have just left trump alone rather than call him a c@nt and racist.", "view": 10}, {"title": "", "body": "All social media platforms are shit holes rn. They allow porn, nudity violence but don’t allow Trump to speak his mind lol everything else is okay though. Eh.", "view": 10}, {"title": "", "body": "Dear MAGA or MAGAA. it was never about making America great or making you great. It was never about making a better, easy life for you and your family. It has always been about making Trump richer, powerful and protected from prosecution. It was never about us it was always him.", "view": 10}, {"title": "", "body": "@Noble_Loser5834 ¡Stalin haciendo el signo masón al igual que su sucesor Trump!", "view": 10}, {"title": "", "body": "I miss Trump", "view": 10}, {"title": "", "body": "Trump drops off 'richest people' list for first time since 1996 because he refused ethics advice: Forbes - Raw Story - Celebrating 17 Years of Independent Journalism  https://t.co/tG7GrxsjHY", "view": 10}, {"title": "", "body": "#m_hangyakusha_trump  https://t.co/YqfBGtNlAp", "view": 10}, {"title": "", "body": "@seanhannity Anyone who sided with the 1/6 violence and QAnon 'Stop the Steal' Kraken BS that fomented it deserves to be demeaned.  The question is why Pence thinks it demeans Trump supporters vs. why he doesn't think the right answer is for Trump supporters to distance themselves from it?", "view": 10}, {"title": "", "body": "@HuffPost Consider the Source...  Seems Media and America Loves Trump Soo much they just can't stop talking about him #PresidentTrump #JustLikeAPhoenix #HeWillBeBack👍🏻", "view": 10}, {"title": "", "body": "@Mediaite Trump supporters absolutely deserve to be demeaned.", "view": 10}, {"title": "", "body": "Wait. Donald Trump wanted to reform Section 230 and regulate Facebook and Democrats screeched that it is a private company and can do what it wants.  Now Joe Biden is in the White House and they want to reform Section 230 and regulate Facebook.  What do they stand for?", "view": 10}, {"title": "", "body": "Why @POTUS is becoming increasingly impotent  to control Chinese incursions of Taiwanese air territory in comparison to Mr Trump? @PMOIndia @INDOPACOM @DefenceMinIndia @MEAIndia", "view": 10}, {"title": "", "body": "@FoxNews Trump lost", "view": 10}, {"title": "", "body": "@owillis Politics is about pressure. No one criticized Trump's bullying of the republican party. But when someone wants to do something to help people they're touchy about direct action. They should have been doing this for months. If she doesn't like being a dem she should resign.", "view": 10}, {"title": "", "body": "Former President Donald Trump is worth an estimated $2.5 billion, leaving him $400 million short of the cutoff to make this year’s #Forbes400 list of America’s richest people.  https://t.co/pBTQgICbaI", "view": 10}, {"title": "", "body": "Statement from Donald J. Trump, 45th President of the United States of America on 17,000 Illegal Immigrant Haitians..  https://t.co/tJY13enD45", "view": 10}, {"title": "", "body": "@TomJChicago The DOJ doesn’t seem to care if Trump kills our country!", "view": 10}, {"title": "", "body": "@ManhattanDA Hey Easy  Money how about doing some work and getting Donald trump charged,tried and convicted. Don’t pull another mueller fiasco !", "view": 10}, {"title": "", "body": "@GOPChairwoman Explain to me how -2T in revenue was paid for by Trump’s tax break.   That’s much more interesting than closing loopholes, collecting what has been owed for years, and an insignificant tax increase.", "view": 10}, {"title": "", "body": "Donald John Trump... or is it Add John Lump Torn?", "view": 10}, {"title": "", "body": "@Newsweek As consolation tRump is still holding 1st place for malice, stupidity and spite.", "view": 10}, {"title": "", "body": "my politics teacher's storeroom has a gay flag and framed picture of trump 💀  https://t.co/WBBGlkhMyA", "view": 10}, {"title": "", "body": "Hell no. $79 to fill my work truck. It's was $50 under the president that hurt weak people's feelings. I really miss that guy. President Trump didn't rip my asshole apart at the gas station or grocery store.", "view": 10}, {"title": "", "body": "I know absolutely nothing about this investigation but I’m willing to guess that since the SBA came down as being on “Trump’s side” they’re now being being penalized and harassed by that wannabe cop agency down at 26 Fed like the rest of us. But I could be wrong. We’ll see.", "view": 10}, {"title": "", "body": "@nytimes Just like the Democrats did under Trump and The Wall????   Dems threatened AND SHUT DOWN GOVERNMENT over only 6 billion.  This is about almost 5 TRILLION!!!", "view": 10}, {"title": "", "body": "@PorterLarsen @SenWhitehouse Polls suggest otherwise.  Show me the replacement plan that Trump and the GOP have been promising for years.", "view": 10}, {"title": "", "body": "@CheriJacobus @TheJusticeDept Why wasn't Trump locked up the minute he wasn't POTUS any longer?  Meanwhile, Michael Cohn gets 3 years over Stormy Daniel's hush money...&amp; that's just ONE of the many crimes Trump committed!", "view": 10}, {"title": "", "body": "What is happening to the Republicans?One answer is that the Party’s predicament might fairly be called the revenge of “the kooks.” In just four years, the G.O.P., a powerful, hundred-and-sixty-seven-year-old institution,has become the party of Trump.The Party Of Lies and Deceit .  https://t.co/yDiA8u995B", "view": 10}, {"title": "", "body": "Trump was right! No matter what dark days are here, we Americans can survive any challenge thrown at us:   https://t.co/jeqGi0Xcue", "view": 10}, {"title": "", "body": "On this day in 2020, coronavirus atomizer Donald J Trump left the hospital early, climbed up to the White House balcony for a maskless photo-op, and proceeded indoors to expose as many staffers as possible to the virus.", "view": 10}, {"title": "", "body": "@AceCapitalist How much were HBCUs getting under Trump?", "view": 10}, {"title": "", "body": "@RonFilipkowski But no trump?", "view": 10}, {"title": "", "body": "I love reading the newspaper…  I ❤️ politics—the Fall of Trump, etc. (And @NPR.)  But I also like thinking about #SquirrelGirl in #Deadpool3.    https://t.co/rVHmKp0YI6", "view": 10}, {"title": "", "body": "This ranks right up there with High School Musical, The Musical: The Series. #Morons #NoCreativity  Trump Unveils New Super PAC And Twitter Users Can't Stop Howling At The Name  https://t.co/4xaoGaJmxy via @YahooNews", "view": 10}, {"title": "", "body": "@Layla_Shadilay @TrumpJew2 I´m an American. Inflation, not his fault ;) I love your statement about Afghanistan ;) That was Trump´s contract he bragged about having negotiated with his new terrorist Taliban friends. Gosh! When did you start recognizing your total loss of brain activity?", "view": 10}, {"title": "", "body": "@Mike_Pence Pence learned the art of gaslighting from Trump. Pence already had lying down. Pence is still trying to tie himself to the man who wanted supporters to hang him. It’s like watching an abused person defend the abuser.", "view": 10}, {"title": "", "body": "Statement by Donald J. Trump, 45th President of the United States of America  https://t.co/cXOAhOaSgi", "view": 10}, {"title": "", "body": "@mflambert How do you spell Trump?  Let me try...  F-U-C-K-E-D  Yup. Got it :D", "view": 10}, {"title": "", "body": "@martyduren @richstarnes Yes, there's a segment of the pre Trump culture warriors who haven't come to terms with where we are in 2021 and how the terrain has shifted along with a head in the sand obliviousness to flaws of even pre Trump evangelicalism", "view": 10}, {"title": "", "body": "CNN‘s Cooper Pushes Back on Excusing Sinema Bathroom Confrontation: Would Reaction Be Same if Trump Supporters Did That to Pelosi?  https://t.co/DUdIN5giNw via @BreitbartNews", "view": 10}, {"title": "", "body": "Most Americans support the Biden agenda. But most Americans probably don’t know that most Americans do! The GOP is running on Trump and the border right now. Nothing that proactively helps the American people.", "view": 10}, {"title": "", "body": "\"Whether by sheer luck, real-time trial and error, or advance knowledge by rioters, several of those vulnerable windows and two glass-paned doors…became easy entry points for hundreds of Trump supporters…on Jan. 6.\" @highbrow_nobrow  https://t.co/eeNM8Hoo1Y", "view": 10}, {"title": "", "body": "@meridithmcgraw @PamBondi @kimguilfoyle It doesn't matter who the president is, they're not in charge, did Trump really look like he had much pull on any subject honestly I'd of spent even more time golfing, does Biden look like he's in charge? And what ever happened to the Kamala? Haven't seen her in over a year, so", "view": 10}, {"title": "", "body": "@TGGabller @SteveScalise @MELANIATRUMP I have nothing but contempt for Grisham, who served the Trump administration and now wants to rehabilitate her rep. My only point is that Scalise hasn't refuted the claim, whether it's true or not.", "view": 10}, {"title": "", "body": "@SameeraKhan Crimson Contagion, an exercise Trump conducted in 2019, with numerous national, state &amp; local, private &amp; public US organizations, to test response to a severe pandemic of influenza originating in China. It showed US's complete lack of readiness for a Pandemic! Trump did nothing.  https://t.co/y4zVKiauQe", "view": 10}, {"title": "", "body": "Donald Trump lied when he argued on APRIL 11 \"I like Steve, but you have to remember he was not involved in my campaign until very late.\"", "view": 10}, {"title": "", "body": "@joncoopertweets If I've learned anything in my life, it's that if it's Trump approved, it's typically poor quality 😆", "view": 10}, {"title": "", "body": "one thing about working in florida. i have to fake laugh with a minimum 10 trump supporters and racist a day…", "view": 10}, {"title": "", "body": "Trump drops off 'richest people' list for first time since 1996 because he refused ethics advice: Forbes  https://t.co/mU5FqwKmvX", "view": 10}, {"title": "", "body": "@thehill “Although cryptocurrencies and some stocks and assets rose during the pandemic, a lot of Trump's wealth comes from his big-city properties.”  But I thought big city properties were rebounding in value as rents rise and demand for condos and single family homes rise.", "view": 10}, {"title": "", "body": "Biden Slams GOP for Obstructing Debt Limit in Wake of “Reckless” Trump Agenda  https://t.co/WtMI52ZHEW", "view": 10}, {"title": "", "body": "@TheGoodLiars Ted Cruz \"Trump called my wife ugly and I'm a bad little cuck\"", "view": 10}, {"title": "", "body": "I know, I'm a bit late to the party, but I just saw this. @realdonaldtrump #facebookdown #instagramdown #whatsappdown #Trump  https://t.co/LzfFx47iR8", "view": 10}, {"title": "", "body": "Former Press Secretary Stephanie Grisham Says She Regrets Enabling Trump’s Lies  https://t.co/MXWthS0lCI", "view": 10}, {"title": "", "body": "Former Press Secretary Stephanie Grisham Says She Regrets Enabling Trump’s Lies  https://t.co/sxrBxwn0Lf", "view": 10}, {"title": "", "body": "Lebron is a Laker Trump was President  Sora in Smash  I think the only thing that can surprise me now is the Apocalypse", "view": 10}, {"title": "", "body": "Kameraden, es gibt einen Lichtblick. Die Cousine einer Freundin (dürfte jetzt 17 sein) hat heute im Gym zusammen mit mir nen Selbsttest machen müssen, weil sie sich nicht impfen lassen möchte. Sie war früher sogar Trump Fan, wurde dann von ihrem Ex zum Antifa Mädel umgeräumt...", "view": 10}, {"title": "", "body": "@mikepompeo “Even without the vaccine, the pandemic’s going to end. It’s gonna run its course. It’s gonna end. They’ll go crazy. He said ‘without the vaccine’ — watch, it’ll be a headline tomorrow. These people are crazy. No, it’s running its course.”  Trump October 16, 2020", "view": 10}, {"title": "", "body": "@JOURNEYBEAR79 @ReturnOfTheFleX There is a difference between forgetting and dementia, which Biden obviously has.  No amount of \"BuT tRuMp!\" will change that.  It's why \"The most popular President ever\" is hearing \"Fuck Joe Biden\" chants in stadiums all across the country.", "view": 10}, {"title": "", "body": "@lorearchie1 @AnnaCru59661511 @mommakjay @ChuitoPlays @tride___0 @POTUS Trump lowered the corporate tax rate to 21% BEFORE the Coronavirus. The millionaire shareholders got Richer and the Middle Class was lined up at food banks, bankrupt and starving when the Free Market was Moody. The saddest thing ever", "view": 10}, {"title": "", "body": "Biden Slams GOP for Obstructing Debt Limit in Wake of “Reckless” Trump Agenda  https://t.co/21UlM4SY2B", "view": 10}, {"title": "", "body": "Donald Trump’s bad week just got worse and it’s only Tuesday  https://t.co/rtPUtSkzqh #SmartNews", "view": 10}, {"title": "", "body": "@LauraRiggaro @Jessicam6946 laura thank you so much for sharing that story about your father and grandfather. that was really sweet.  that was really cool.  i understand what you are saying. i just think trump is not as good as his supporters think he and hes not as bad as his haters think he is.....", "view": 10}, {"title": "", "body": "If a billionaire like Trump can't find a way to unban himself from the most popular social media platforms how much control does the average voter have?", "view": 10}, {"title": "", "body": "Trump advised you to get rid of 230 @GOPLeader @GOP . You had the opportunity and blew it.", "view": 10}, {"title": "", "body": "It's not quite blackmail, but I wonder how many people become Trump acolytes *because* they got caught doing something horrible. Like, they know Trumpworld defends people no matter what, and then they can say \"I'm being prosecuted for politics.\"", "view": 10}, {"title": "", "body": "When Trump speechwriter Darren Beattie reported in June that there was evidence suggesting FBI foreknowledge of the Jan 6 protest at the Capitol, if not active involvement, the corporate media mocked him and others who took it seriously for being deranged conspiracy theories.", "view": 10}, {"title": "", "body": "@Mike_Pence So you aroused tRump", "view": 10}]